Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/GSG/get_started.po
Languages: ru_ru

source: Get Started with |short_name|
ru_ru: Начните работу с |short_name|

source: |short_name| is a runtime-based parallel programming model for C++ code that uses threads. It enables you to simplify parallel programming by breaking computation into parallel running tasks. The library consists of a template-based runtime library to help you harness the latent performance of multi-core processors. Use |short_name| to write scalable applications that:
ru_ru: |short_name| - это модель параллельного программирования на C++, основанная на времени выполнения, использующая потоки. Она позволяет упростить параллельное программирование путем разбиения вычислений на параллельно выполняемые задачи. Библиотека состоит из основанных на шаблонах библиотек времени выполнения, которые помогут вам использовать скрытую производительность многоядерных процессоров. Используйте |short_name| для написания масштабируемых приложений, которые:

source: Specify logical parallel structure instead of threads
ru_ru: Вместо потоков используют логическую параллельную структуру

source: Emphasize data parallel programming
ru_ru: Делают упор на параллельную обработку данных

source: Take advantage of concurrent collections and parallel algorithms
ru_ru: Используйте преимущества параллельных коллекций и параллельных алгоритмов

source: System Requirements
ru_ru: Системные требования

source: Refer to the `oneTBB System Requirements <https://github.com/oneapi-src/oneTBB/blob/master/SYSTEM_REQUIREMENTS.md>`_.
ru_ru: Обратитесь к разделу `Системные требования OneTBB <https://github.com/oneapi-src/oneTBB/blob/master/SYSTEM_REQUIREMENTS.md>`_.

source: Before You Begin
ru_ru: Перед началом

source: After installing |short_name|, you need to set the environment variables:
ru_ru: После установки |short_name| необходимо установить переменные окружения:

source: Go to the oneTBB installation directory (``<install_dir>``). By default, ``<install_dir>`` is the following:
ru_ru: Перейдите в каталог установки oneTBB (``<install_dir>``). По умолчанию ``<install_dir>`` имеет следующий вид:

source: On Linux* OS:
ru_ru: На Linux*:

source: For superusers (root): ``/opt/intel/oneapi``
ru_ru: Для суперпользователя (root): ``/opt/intel/oneapi``

source: For ordinary users (non-root): ``$HOME/intel/oneapi``
ru_ru: Для простого пользователя (не-root): ``$HOME/intel/oneapi``

source: On Windows* OS:
ru_ru: На Windows*:

source: Set the environment variables, using the script in <install_dir>, by running
ru_ru: Используя сценарий в <install_dir>, установите переменные окружения выполнив команду

source: ``vars.{sh|csh} in <install_dir>/tbb/latest/env``
ru_ru: ``vars.{sh|csh} в <install_dir>/tbb/latest/env``

source: ``vars.bat in <install_dir>/tbb/latest/env``
ru_ru: ``vars.bat в <install_dir>/tbb/latest/env``

source: Example
ru_ru: Пример

source: Below you can find a typical example for a |short_name| algorithm. The sample calculates a sum of all integer numbers from 1 to 100.
ru_ru: Ниже приведен типичный пример для алгоритма |short_name|. Пример вычисляет сумму всех целых чисел от 1 до 100.

source: Find more
ru_ru: Найти еще

source: See our `documentation <https://oneapi-src.github.io/oneTBB/>`_ to learn more about |short_name|.
ru_ru: Смотрите нашу `документацию <https://oneapi-src.github.io/oneTBB/>`_, чтобы узнать больше о |short_name|.
