Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Agglomeration.po
Languages: ru_ru

source: Agglomeration
ru_ru: Агломерация

source: Problem
ru_ru: Проблема

source: Parallelism is so fine grained that overhead of parallel scheduling or communication swamps the useful work.
ru_ru: Параллелизм настолько мелкозернистый, что накладные расходы на параллельное планирование или коммуникации перекрывают полезную работу.

source: Context
ru_ru: Контекст

source: Many algorithms permit parallelism at a very fine grain, on the order of a few instructions per task. But synchronization between threads usually requires orders of magnitude more cycles. For example, elementwise addition of two arrays can be done fully in parallel, but if each scalar addition is scheduled as a separate task, most of the time will be spent doing synchronization instead of useful addition.
ru_ru: Многие алгоритмы допускают параллелизм на очень мелком зерне, порядка нескольких инструкций на задачу. Но синхронизация между потоками обычно требует на порядки больше тактов. Например, поэлементное сложение двух массивов может быть выполнено полностью параллельно, но если каждое скалярное сложение запланировано как отдельная задача, то большая часть времени будет потрачена на выполнение синхронизации вместо полезного сложения.

source: Forces
ru_ru: Форсы

source: Individual computations can be done in parallel, but are small. For practical use of |full_name|, "small" here means less than 10,000 clock cycles.
ru_ru: Отдельные вычисления могут выполняться параллельно, но их объем невелик. Для практического использования |full_name| "небольшой" здесь означает менее 10 000 тактовых циклов.

source: The parallelism is for sake of performance and not required for semantic reasons.
ru_ru: Параллелизм существует ради производительности и не требуется по семантическим причинам.

source: Solution
ru_ru: Решение

source: Group the computations into blocks. Evaluate computations within a block serially.
ru_ru: Сгруппируй вычисления в блоки. Проводи вычисления внутри блока последовательно.

source: The block size should be chosen to be large enough to amortize parallel overhead. Too large a block size may limit parallelism or load balancing because the number of blocks becomes too small to distribute work evenly across processors.
ru_ru: Размер блока должен быть выбран достаточно большим, чтобы амортизировать параллельные накладные расходы. Слишком большой размер блока может ограничить параллелизм или балансировку нагрузки, потому что количество блоков становится слишком маленьким для равномерного распределения работы между процессорами.

source: The choice of block topology is typically driven by two concerns:
ru_ru: Выбор топологии блока обычно обусловлен двумя причинами:

source: Minimizing synchronization between blocks.
ru_ru: Минимизация синхронизации между блоками.

source: Minimizing cache traffic between blocks.
ru_ru: Минимизация кэш-трафика между блоками.

source: If the computations are completely independent, then the blocks will be independent too, and then only cache traffic issues must be considered.
ru_ru: Если вычисления полностью независимы, то блоки тоже будут независимы, и тогда нужно рассматривать только вопросы трафика кэша.

source: If the loop is "small", on the order of less than 10,000 clock cycles, then it may be impractical to parallelize at all, because the optimal agglomeration might be a single block,
ru_ru: Если цикл "маленький", порядка менее 10 000 тактов, то распараллеливание может быть непрактичным вообще, потому что оптимальным агломератом может быть один блок,

source: Examples
ru_ru: Примеры

source: TBB loop templates such as ``oneapi::tbb::parallel_for`` that take a *range* argument support automatic agglomeration.
ru_ru: Шаблоны циклов TBB, такие как ``oneapi::tbb::parallel_for``, которые принимают аргумент *range*, поддерживают автоматическую агломерацию.

source: When agglomerating, think about cache effects. Avoid having cache lines cross between groups if possible.
ru_ru: При агломерации думай об эффектах кэша. По возможности избегай пересечения кэш-линий между группами.

source: There may be boundary to interior ratio effects. For example, if the computations form a 2D grid, and communicate only with nearest neighbors, then the computation per block grows quadratically (with the block's area), but the cross-block communication grows with linearly (with the block's perimeter). The following figure shows four different ways to agglomerate an 8×8 grid. If doing such analysis, be careful to consider that information is transferred in cache line units. For a given area, the perimeter may be minimized when the block is square with respect to the underlying grid of cache lines, not square with respect to the logical grid.
ru_ru: Могут существовать эффекты соотношения границ и интерьеров. Например, если вычисления образуют двумерную сетку, а связь осуществляется только с ближайшими соседями, то вычисления на блок растут квадратично (с увеличением площади блока), но межблочная связь растет линейно (с увеличением периметра блока). На следующем рисунке показаны четыре различных способа агломерации сетки 8×8. При проведении такого анализа будь внимателен и учитывай, что информация передается в единицах кэш-линий. Для заданной площади периметр может быть минимизирован, если блок будет квадратным по отношению к лежащей в основе сетке кэш-линий, а не квадратным по отношению к логической сетке.

source: Four different agglomerations of an 8×8 grid. |image0|
ru_ru: Четыре различных агломерации сетки 8×8. |image0|

source: Also consider vectorization. Blocks that contain long contiguous subsets of data may better enable vectorization.
ru_ru: Также рассмотри возможность векторизации. Блоки, которые содержат длинные непрерывные подмножества данных, могут лучше позволить векторизацию.

source: For recursive computations, most of the work is towards the leaves, so the solution is to treat subtrees as a groups as shown in the following figure.
ru_ru: При рекурсивных вычислениях большая часть работы направлена на листья, поэтому решение заключается в том, чтобы рассматривать поддеревья как группы, как показано на следующем рисунке.

source: Agglomeration of a recursive computation |image1|
ru_ru: Агломерация рекурсивного вычисления |image1|

source: Often such an agglomeration is achieved by recursing serially once some threshold is reached. For example, a recursive sort might solve sub-problems in parallel only if they are above a certain threshold size.
ru_ru: Часто такая агломерация достигается путем последовательной рекурсии после достижения некоторого порога. Например, рекурсивная сортировка может решать подпроблемы параллельно, только если они превышают определенный пороговый размер.

source: Reference
ru_ru: Ссылка

source: Ian Foster introduced the term "agglomeration" in his book Designing and Building Parallel Programs http://www.mcs.anl.gov/~itf/dbpp. There agglomeration is part of a four step **PCAM** design method:
ru_ru: Ян Фостер ввел термин "агломерация" в своей книге Designing and Building Parallel Programs http://www.mcs.anl.gov/~itf/dbpp. Там агломерация является частью четырехшагового метода проектирования **PCAM**:

source: **P**\ artitioning - break the program into the smallest tasks possible.
ru_ru: **Р** Разбиение на разделы - разбивайте программу на минимально возможные задачи.

source: **C**\ ommunication – figure out what communication is required between tasks. When using oneTBB, communication is usually cache line transfers. Though they are automatic, understanding which ones happen between tasks helps guide the agglomeration step.
ru_ru: **C** Коммуникация - выясните, какая коммуникация требуется между задачами. При использовании oneTBB коммуникация обычно заключается в передаче строк кэша. Хотя они происходят автоматически, понимание того, какие из них происходят между задачами, помогает направлять шаг агломерации.

source: **A**\ gglomeration – combine tasks into larger tasks. His book has an extensive list of considerations that is worth reading.
ru_ru: **A** Агломерация - объединение задач в более крупные задачи. В его книге есть обширный список соображений, который стоит прочитать.

source: **M**\ apping – map tasks onto processors. The oneTBB task scheduler does this step for you.
ru_ru: **M** Сопоставление - распределение задач по процессорам. Планировщик задач oneTBB выполняет этот шаг за вас.
