Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Design_Patterns.po
Languages: ru_ru

source: Design Patterns
ru_ru: Шаблоны проектирования

source: This section provides some common parallel programming patterns and how to implement them in |full_name|.
ru_ru: В этом разделе представлены некоторые распространенные паттерны параллельного программирования и способы их реализации в |full_name|.

source: The description of each pattern has the following format:
ru_ru: Описание каждого шаблона имеет следующий формат:

source: **Problem** – describes the problem to be solved.
ru_ru: **Проблема** - описывает проблему, которую нужно решить.

source: **Context** – describes contexts in which the problem arises.
ru_ru: **Контекст** - описывает контексты, в которых возникает проблема.

source: **Forces** - considerations that drive use of the pattern.
ru_ru: **Форсы** - соображения, которые определяют использование паттерна.

source: **Solution** - describes how to implement the pattern.
ru_ru: **Решение** - описывает, как реализовать паттерн.

source: **Example** – presents an example implementation.
ru_ru: **Пример** - представляет пример реализации.

source: Variations and examples are sometimes discussed. The code examples are intended to emphasize key points and are not full-fledged code. Examples may omit obvious const overloads of non-const methods.
ru_ru: Иногда обсуждаются вариации и примеры. Примеры кода призваны подчеркнуть ключевые моменты и не являются полноценным кодом. В примерах могут быть опущены очевидные const-перегрузки не const-методов.

source: Much of the nomenclature and examples are adapted from Web pages created by Eun-Gyu and Marc Snir, and the Berkeley parallel patterns wiki. See links in the **General References** section.
ru_ru: Большая часть номенклатуры и примеров адаптирована из веб-страниц, созданных Ын-Гю и Марком Сниром, а также из вики параллельных паттернов Беркли. Смотри ссылки в разделе **Общие ссылки**.

source: For brevity, some of the code examples use C++11 lambda expressions. It is straightforward, albeit sometimes tedious, to translate such lambda expressions into equivalent C++03 code.
ru_ru: Для краткости в некоторых примерах кода используются лямбда-выражения C++11. Перевести такие лямбда-выражения в эквивалентный код C++03 просто, хотя иногда и утомительно.
