Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Divide_and_Conquer.po
Languages: ru_ru

source: Divide and Conquer
ru_ru: Разделяй и властвуй

source: Problem
ru_ru: Проблема

source: Parallelize a divide and conquer algorithm.
ru_ru: Распараллель алгоритм "разделяй и властвуй".

source: Context
ru_ru: Контекст

source: Divide and conquer is widely used in serial algorithms. Common examples are quicksort and mergesort.
ru_ru: Divide and conquer широко используется в последовательных алгоритмах. Общими примерами являются quicksort и mergesort.

source: Forces
ru_ru: Форсы

source: Problem can be transformed into subproblems that can be solved independently.
ru_ru: Проблема может быть преобразована в подпроблемы, которые могут быть решены независимо друг от друга.

source: Splitting problem or merging solutions is relatively cheap compared to cost of solving the subproblems.
ru_ru: Разделение проблемы или объединение решений относительно дешево по сравнению со стоимостью решения подпроблем.

source: Solution
ru_ru: Решение

source: There are several ways to implement divide and conquer in |full_name|. The best choice depends upon circumstances.
ru_ru: Есть несколько способов реализовать принцип "разделяй и властвуй" в |full_name|. Лучший выбор зависит от обстоятельств.

source: If division always yields the same number of subproblems, use recursion and ``oneapi::tbb::parallel_invoke``.
ru_ru: Если деление всегда дает одинаковое количество подпроблем, используй рекурсию и ``oneapi::tbb::parallel_invoke``.

source: If the number of subproblems varies, use recursion and ``oneapi::tbb::task_group``.
ru_ru: Если количество подпроблем меняется, используй рекурсию и ``oneapi::tbb::task_group``.

source: Example
ru_ru: Пример

source: Quicksort is a classic divide-and-conquer algorithm. It divides a sorting problem into two subsorts. A simple serial version looks like [1]_.
ru_ru: Quicksort - это классический алгоритм "разделяй и властвуй". Он разделяет проблему сортировки на две подсортировки. Простая последовательная версия выглядит как [1]_.

source: The number of subsorts is fixed at two, so ``oneapi::tbb::parallel_invoke`` provides a simple way to parallelize it. The parallel code is shown below:
ru_ru: Количество подсортировок фиксировано и равно двум, поэтому ``oneapi::tbb::parallel_invoke`` предоставляет простой способ распараллелить его. Параллельный код показан ниже:

source: Eventually the subsorts become small enough that serial execution is more efficient. The following variation, does sorts of less than 500 elements using the earlier serial code.
ru_ru: В конце концов, подсортировки становятся настолько маленькими, что последовательное выполнение становится более эффективным. Следующая вариация, выполняющая сортировку менее 500 элементов, использует более ранний последовательный код.

source: The change is an instance of the Agglomeration pattern.
ru_ru: Изменение является примером паттерна "Агломерация".

source: The next example considers a problem where there are a variable number of subproblems. The problem involves a tree-like description of a mechanical assembly. There are two kinds of nodes:
ru_ru: В следующем примере рассматривается проблема, в которой существует переменное количество подпроблем. Проблема включает в себя древовидное описание механического узла. Есть два вида узлов:

source: Leaf nodes represent individual parts.
ru_ru: Листовые узлы представляют отдельные части.

source: Internal nodes represent groups of parts.
ru_ru: Внутренние узлы представляют собой группы деталей.

source: The problem is to find all nodes that collide with a target node. The following code shows a serial solution that walks the tree. It records in ``Hits`` any nodes that collide with ``Target``.
ru_ru: Задача состоит в том, чтобы найти все узлы, которые сталкиваются с целевым узлом. Следующий код показывает последовательное решение, которое обходит дерево. Он записывает в ``Hits`` все узлы, которые сталкиваются с ``Target``.

source: A parallel version is shown below.
ru_ru: Параллельная версия показана ниже.

source: typedef oneapi::tbb::enumerable_thread_specific<std::list<Node*> > LocalList; LocalList LocalHits; Node* Target; // Target node void ParallelWalk( Node& x ) { if( x.is_leaf() ) { if( x.collides_with( *Target ) ) LocalHits.local().push_back(&x); } else { // Recurse on each child y of x in parallel oneapi::tbb::task_group g; for( Node::const_iterator y=x.begin(); y!=x.end(); ++y ) g.run( [=]{ParallelWalk(*y);} ); // Wait for recursive calls to complete g.wait(); } } void ParallelFindCollisions( Node& x ) { ParallelWalk(x); for(LocalList::iterator i=LocalHits.begin();i!=LocalHits.end(); ++i) Hits.splice( Hits.end(), *i ); }
ru_ru: typedef oneapi::tbb::enumerable_thread_specific<std::list<Node*> > LocalList; LocalList LocalHits; Node* Target; // Целевой узел void ParallelWalk( Node& x ) { if( x.is_leaf() ) { if( x.collides_with( *Target ) ) LocalHits.local().push_back(&x); } else { // Параллельно выполняйте рекурсию по каждому дочернему y от x oneapi::tbb::task_group g; for( Node::const_iterator y=x.begin(); y!=x.end(); ++y ) g.run( [=]{ParallelWalk(*y);} ); // Дождитесь завершения рекурсивных вызовов g.wait(); } } void ParallelFindCollisions( Node& x ) { ParallelWalk(x); for(LocalList::iterator i=LocalHits.begin();i!=LocalHits.end(); ++i) Hits.splice( Hits.end(), *i ); }

source: The recursive walk is parallelized using class ``task_group`` to do recursive calls in parallel.
ru_ru: Рекурсивное прохождение распараллеливается с помощью класса ``task_group`` для выполнения рекурсивных вызовов параллельно.

source: There is another significant change because of the parallelism that is introduced. Because it would be unsafe to update ``Hits`` concurrently, the parallel walk uses variable ``LocalHits`` to accumulate results. Because it is of type ``enumerable_thread_specific``, each thread accumulates its own private result. The results are spliced together into Hits after the walk completes.
ru_ru: Есть еще одно существенное изменение из-за введенного параллелизма. Поскольку было бы небезопасно обновлять ``Hits`` одновременно, параллельное прохождение использует переменную ``LocalHits`` для накопления результатов. Поскольку она имеет тип ``enumerable_thread_specific``, каждый поток накапливает свой собственный частный результат. После завершения прохода результаты объединяются в Hits.

source: The results will *not* be in the same order as the original serial code.
ru_ru: Результаты будут *не* в том же порядке, что и оригинальный серийный код.

source: If parallel overhead is high, use the agglomeration pattern. For example, use the serial walk for subtrees under a certain threshold.
ru_ru: Если параллельные накладные расходы высоки, используй схему агломерации. Например, используй последовательный просмотр для поддеревьев ниже определенного порога.

source: Production quality quicksort implementations typically use more sophisticated pivot selection, explicit stacks instead of recursion, and some other sorting algorithm for small subsorts. The simple algorithm is used here to focus on exposition of the parallel pattern.
ru_ru: Реализации quicksort производственного качества обычно используют более сложный выбор поворотной точки, явные стеки вместо рекурсии и какой-либо другой алгоритм сортировки для небольших подсортировок. Здесь используется простой алгоритм, чтобы сосредоточиться на изложении параллельного паттерна.
