Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Elementwise.po
Languages: ru_ru

source: Elementwise
ru_ru: По элементам

source: Problem
ru_ru: Проблема

source: Initiate similar independent computations across items in a data set, and wait until all complete.
ru_ru: Запускай аналогичные независимые вычисления для всех элементов в наборе данных и жди, пока все они завершатся.

source: Context
ru_ru: Контекст

source: Many serial algorithms sweep over a set of items and do an independent computation on each item. However, if some kind of summary information is collected, use the Reduction pattern instead.
ru_ru: Многие последовательные алгоритмы перебирают набор элементов и выполняют независимые вычисления для каждого элемента. Однако если собирается какая-то суммарная информация, используй вместо этого шаблон "Свертка".

source: Forces
ru_ru: Форсы

source: No information is carried or merged between the computations.
ru_ru: Никакая информация не переносится и не объединяется между вычислениями.

source: Solution
ru_ru: Решение

source: If the number of items is known in advance, use ``oneapi::tbb::parallel_for``. If not, consider using ``oneapi::tbb::parallel_for_each``.
ru_ru: Если количество элементов известно заранее, используй ``oneapi::tbb::parallel_for``. Если нет, рассмотри возможность использования ``oneapi::tbb::parallel_for_each``.

source: Use agglomeration if the individual computations are small relative to scheduler overheads.
ru_ru: Используй агломерацию, если отдельные вычисления малы относительно накладных расходов планировщика.

source: If the pattern is followed by a reduction on the same data, consider doing the element-wise operation as part of the reduction, so that the combination of the two patterns is accomplished in a single sweep instead of two sweeps. Doing so may improve performance by reducing traffic through the memory hierarchy.
ru_ru: Если за паттерном следует уменьшение тех же данных, подумай о том, чтобы выполнить операцию "по элементам" как часть уменьшения, чтобы комбинация двух паттернов была выполнена за один проход вместо двух проходов. Это может повысить производительность за счет уменьшения трафика через иерархию памяти.

source: Example
ru_ru: Пример

source: Convolution is often used in signal processing. The convolution of a filter ``c`` and signal ``x`` is computed as:
ru_ru: Свертка часто используется в обработке сигналов. Свертка фильтра ``c`` и сигнала ``x`` вычисляется как:

source: |image0| Serial code for this computation might look like:
ru_ru: |image0| Последовательный код для этого вычисления может выглядеть так:

source: For simplicity, the fragment assumes that ``x`` is a pointer into an array padded with zeros such that ``x[k]``\ returns zero when ``k<0`` or ``k≥xlen``.
ru_ru: Для простоты фрагмент предполагает, что ``x`` является указателем на массив, заполненный нулями так, что ``x[k]`` возвращает ноль, когда ``k<0`` или ``k≥xlen``.

source: The inner loop does not fit the elementwise pattern, because each iteration depends on the previous iteration. However, the outer loop fits the elementwise pattern. It is straightforward to render it using ``oneapi::tbb::parallel_for`` as shown:
ru_ru: Внутренний цикл не соответствует поэлементному шаблону, потому что каждая итерация зависит от предыдущей итерации. Однако внешний цикл соответствует поэлементному шаблону. Его можно легко визуализировать, используя ``oneapi::tbb::parallel_for``, как показано на рисунке:

source: ``oneapi::tbb::parallel_for`` does automatic agglomeration by implicitly using ``oneapi::tbb::auto_partitioner`` in its underlying implementation. If there is reason to agglomerate explicitly, use the overload of ``oneapi::tbb::parallel_for`` that takes an explicit range argument. The following shows the example transformed to use the overload.
ru_ru: ``oneapi::tbb::parallel_for`` делает автоматическую агломерацию, неявно используя ``oneapi::tbb::auto_partitioner`` в своей базовой реализации. Если есть причина для явного агломерирования, используй перегрузку ``oneapi::tbb::parallel_for``, которая принимает явный аргумент диапазона. Ниже показан пример, преобразованный для использования перегрузки.

source: oneapi::tbb::parallel_for( oneapi::tbb::blocked_range<int>(0,xlen+clen-1,1000), [=]( oneapi::tbb::blocked_range<int> r ) { int end = r.end(); for( int i=r.begin(); i!=end; ++i ) { float tmp = 0; for( int j=0; j<clen; ++j ) tmp += c[j]*x[i-j]; y[i] = tmp; } } );
ru_ru: oneapi::tbb::parallel_for( oneapi::tbb::blocked_range<int>(0,xlen+clen-1,1000), [=]( oneapi::tbb::blocked_range<int> r ) { int end = r.end(); for( int i=r.begin(); i!=end; ++i ) { float tmp = 0; for( int j=0; j<clen; ++j ) tmp += c[j]*x[i-j]; y[i] = tmp; } } );ч
