Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Fenced_Data_Transfer.po
Languages: ru_ru

source: Fenced Data Transfer
ru_ru: Огражденная передача данных

source: Problem
ru_ru: Проблема

source: Write a message to memory and have another processor read it on hardware that does not have a sequentially consistent memory model.
ru_ru: Запиши сообщение в память и попроси другой процессор прочитать его на оборудовании, которое не имеет последовательной согласованной модели памяти.

source: Context
ru_ru: Контекст

source: The problem normally arises only when unsynchronized threads concurrently act on a memory location, or are using reads and writes to create synchronization. High level synchronization constructs normally include mechanisms that prevent unwanted reordering.
ru_ru: Обычно проблема возникает только тогда, когда несинхронизированные потоки одновременно действуют на участок памяти или используют чтение и запись для создания синхронизации. Высокоуровневые конструкции синхронизации обычно включают механизмы, которые предотвращают нежелательное переупорядочивание.

source: Modern hardware and compilers can reorder memory operations in a way that preserves the order of a thread's operation from its viewpoint, but not as observed by other threads. A serial common idiom is to write a message and mark it as ready to ready as shown in the following code:
ru_ru: Современные аппаратные средства и компиляторы могут переупорядочивать операции с памятью таким образом, что сохраняется порядок работы потока с его точки зрения, но не так, как его наблюдают другие потоки. Последовательная распространенная идиома заключается в том, чтобы написать сообщение и пометить его как готовое, как показано в следующем коде:

source: bool Ready; std::string Message; void Send( const std::string& src ) {. // Executed by thread 1 Message=src; Ready = true; } bool Receive( std::string& dst ) { // Executed by thread 2 bool result = Ready; if( result ) dst=Message; return result; // Return true if message was received. }
ru_ru: bool Ready; std::string Message; void Send( const std::string& src ) { // Выполняется потоком 1 Message=src; Ready = true; } bool Receive( std::string& dst ) { // Выполняется потоком 2 bool result = Ready; if( result ) dst=Message; return result; // Возвращает true, если сообщение было получено. }

source: Two key assumptions of the code are:
ru_ru: Два ключевых предположения кода таковы:

source: ``Ready`` does not become true until ``Message`` is written.
ru_ru: ``Ready`` не становится истиной, пока ``Message`` не будет записано.

source: ``Message`` is not read until ``Ready`` becomes true.
ru_ru: ``Message`` не считывается до тех пор, пока ``Ready`` не станет истиной.

source: These assumptions are trivially true on uniprocessor hardware. However, they may break on multiprocessor hardware. Reordering by the hardware or compiler can cause the sender's writes to appear out of order to the receiver (thus breaking condition a) or the receiver's reads to appear out of order (thus breaking condition b).
ru_ru: Эти предположения тривиально верны на однопроцессорном оборудовании. Однако они могут нарушаться на многопроцессорном оборудовании. Переупорядочивание аппаратуры или компилятора может привести к тому, что записи отправителя будут выглядеть для получателя не по порядку (тем самым нарушая условие а) или чтения получателя будут выглядеть не по порядку (тем самым нарушая условие б).

source: Forces
ru_ru: Форсы

source: Creating synchronization via raw reads and writes.
ru_ru: Создание синхронизации через необработанные чтения и записи.

source: Solution
ru_ru: Решение

source: Change the flag from ``bool`` to ``std::atomic<bool>`` for the flag that indicates when the message is ready. Here is the previous example with modifications.
ru_ru: Измени флаг с ``bool`` на ``std::atomic<bool>`` для флага, который указывает, когда сообщение готово. Вот предыдущий пример с изменениями.

source: std::atomic<bool> Ready; std::string Message; void Send( const std::string& src ) {. // Executed by thread 1 Message=src; Ready.store(true, std::memory_order_release); } bool Receive( std::string& dst ) { // Executed by thread 2 bool result = Ready.load(std::memory_order_acquire); if( result ) dst=Message; return result; // Return true if message was received. }
ru_ru: std::atomic<bool> Ready; std::string Message; void Send( const std::string& src ) { // Выполняется потоком 1 Message=src; Ready.store(true, std::memory_order_release); } bool Receive( std::string& dst ) { // Выполняется потоком 2 bool result = Ready.load(std::memory_order_acquire); if( result ) dst=Message; return result; // Возвращает true, если сообщение было получено. }

source: A write to a ``std::atomic`` value has *release* semantics, which means that all of its prior writes will be seen before the releasing write. A read from ``std::atomic`` value has *acquire* semantics, which means that all of its subsequent reads will happen after the acquiring read. The implementation of ``std::atomic`` ensures that both the compiler and the hardware observe these ordering constraints.
ru_ru: Запись в значение ``std::atomic`` имеет семантику *release*, что означает, что все его предыдущие записи будут видны до освобождающей записи. Чтение из значения ``std::atomic`` имеет семантику *acquire*, что означает, что все его последующие чтения будут происходить после приобретающего чтения. Реализация ``std::atomic`` гарантирует, что и компилятор, и аппаратное обеспечение соблюдают эти ограничения упорядочивания.

source: Variations
ru_ru: Вариации

source: Higher level synchronization constructs normally include the necessary *acquire* and *release* fences. For example, mutexes are normally implemented such that acquisition of a lock has *acquire* semantics and release of a lock has *release* semantics. Thus a thread that acquires a lock on a mutex always sees any memory writes done by another thread before it released a lock on that mutex.
ru_ru: Конструкции синхронизации более высокого уровня обычно включают в себя необходимые ограждения *acquire* и *release*. Например, мьютексы обычно реализуются таким образом, что получение блокировки имеет семантику *acquire*, а освобождение блокировки - семантику *release*. Таким образом, поток, который приобретает блокировку на мьютексе, всегда видит все записи в память, сделанные другим потоком до того, как он освободил блокировку на этом мьютексе.

source: Non Solutions
ru_ru: Нерациональные решения

source: Mistaken solutions are so often proposed that it is worth understanding why they are wrong.
ru_ru: Ошибочные решения предлагаются так часто, что стоит понять, почему они ошибочны.

source: One common mistake is to assume that declaring the flag with the ``volatile`` keyword solves the problem. Though the ``volatile`` keyword forces a write to happen immediately, it generally has no effect on the visible ordering of that write with respect to other memory operations.
ru_ru: Одна из распространенных ошибок - считать, что объявление флага с ключевым словом ``volatile`` решает проблему. Хотя ключевое слово ``volatile`` заставляет запись происходить немедленно, оно обычно не влияет на видимое упорядочивание этой записи относительно других операций с памятью.

source: Another mistake is to assume that conditionally executed code cannot happen before the condition is tested. However, the compiler or hardware may speculatively hoist the conditional code above the condition.
ru_ru: Еще одна ошибка - предполагать, что условно выполняемый код не может произойти до того, как условие будет проверено. Однако компилятор или аппаратное обеспечение могут спекулятивно поднять условный код выше условия.

source: Similarly, it is a mistake to assume that a processor cannot read the target of a pointer before reading the pointer. A modern processor does not read individual values from main memory. It reads cache lines. The target of a pointer may be in a cache line that has already been read before the pointer was read, thus giving the appearance that the processor presciently read the pointer target.
ru_ru: Аналогично, ошибкой является предположение, что процессор не может прочитать цель указателя до чтения указателя. Современный процессор не читает отдельные значения из основной памяти. Он считывает линии кэша. Цель указателя может находиться в строке кэша, которая уже была прочитана до того, как указатель был прочитан, что создаст впечатление, что процессор прозорливо прочитал цель указателя.
