Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/GUI_Thread.po
Languages: ru_ru

source: GUI Thread
ru_ru: Поток GUI

source: Problem
ru_ru: Проблема

source: A user interface thread must remain responsive to user requests, and must not get bogged down in long computations.
ru_ru: Поток пользовательского интерфейса должен оставаться отзывчивым на запросы пользователя и не увязнуть в долгих вычислениях.

source: Context
ru_ru: Контекст

source: Graphical user interfaces often have a dedicated thread ("GUI thread") for servicing user interactions. The thread must remain responsive to user requests even while the application has long computations running. For example, the user might want to press a "cancel" button to stop the long running computation. If the GUI thread takes part in the long running computation, it will not be able to respond to user requests.
ru_ru: Графические пользовательские интерфейсы часто имеют выделенный поток ("поток GUI") для обслуживания взаимодействия с пользователем. Этот поток должен оставаться отзывчивым на запросы пользователя даже в то время, когда в приложении выполняются длительные вычисления. Например, пользователь может захотеть нажать кнопку "отмена", чтобы остановить длительное вычисление. Если поток GUI будет принимать участие в длительном вычислении, он не сможет отвечать на запросы пользователя.

source: Forces
ru_ru: Форсы

source: The GUI thread services an event loop.
ru_ru: Поток GUI обслуживает цикл событий.

source: The GUI thread needs to offload work onto other threads without waiting for the work to complete.
ru_ru: Поток GUI должен разгрузить работу на другие потоки, не дожидаясь завершения работы.

source: The GUI thread must be responsive to the event loop and not become dedicated to doing the offloaded work.
ru_ru: Поток GUI должен реагировать на цикл событий и не становиться предназначенным для выполнения разгруженной работы.

source: Related
ru_ru: Похожие

source: Non-Preemptive Priorities
ru_ru: Не упреждающие приоритеты

source: Local Serializer
ru_ru: Локальный сериализатор

source: Solution
ru_ru: Решение

source: The GUI thread offloads the work by firing off a task to do it using method ``task_arena::enqueue`` of a ``task_arena`` instance. When finished, the task posts an event to the GUI thread to indicate that the work is done. The semantics of ``enqueue`` cause the task to eventually run on a worker thread distinct from the calling thread.
ru_ru: Поток GUI разгружает работу, запуская для этого задачу с помощью метода ``task_arena::enqueue`` экземпляра ``task_arena``. Когда задача завершена, она посылает событие в поток GUI, чтобы указать, что работа выполнена. Семантика метода ``enqueue`` приводит к тому, что задача в конечном итоге выполняется на рабочем потоке, отличном от вызывающего потока.

source: The following figure sketches the communication paths. Items in black are executed by the GUI thread; items in blue are executed by another thread.
ru_ru: На следующем рисунке показаны пути взаимодействия. Элементы, выделенные черным цветом, выполняются потоком GUI; элементы, выделенные синим цветом, выполняются другим потоком.

source: Example
ru_ru: Пример

source: The example is for the Microsoft Windows\* operating systems, though similar principles apply to any GUI using an event loop idiom. For each event, the GUI thread calls a user-defined function ``WndProc`` to process an event.
ru_ru: Пример приведен для операционных систем Microsoft Windows\*, хотя аналогичные принципы применимы к любому графическому интерфейсу, использующему идиому цикла событий. Для каждого события поток GUI вызывает определяемую пользователем функцию ``WndProc`` для обработки события.

source: // Event posted from enqueued task when it finishes its work. const UINT WM_POP_FOO = WM_USER+0; // Queue for transmitting results from enqueued task to GUI thread. oneapi::tbb::concurrent_queue<Foo>ResultQueue; // GUI thread's private copy of most recently computed result. Foo CurrentResult; LRESULT CALLBACK WndProc(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam) { switch(msg) { case WM_COMMAND: switch (LOWORD(wParam)) { case IDM_LONGRUNNINGWORK: // User requested a long computation. Delegate it to another thread. LaunchLongRunningWork(hWnd); break; case IDM_EXIT: DestroyWindow(hWnd); break; default: return DefWindowProc(hWnd, msg, wParam, lParam); } break; case WM_POP_FOO: // There is another result in ResultQueue for me to grab. ResultQueue.try_pop(CurrentResult); // Update the window with the latest result. RedrawWindow( hWnd, NULL, NULL, RDW_ERASE|RDW_INVALIDATE ); break; case WM_PAINT: Repaint the window using CurrentResult break; case WM_DESTROY: PostQuitMessage(0); break; default: return DefWindowProc( hWnd, msg, wParam, lParam ); } return 0; }
ru_ru: // Событие, опубликованное от поставленной в очередь задачи, когда она завершает свою работу. const UINT WM_POP_FOO = WM_USER+0; // Очередь для передачи результатов от поставленной в очередь задачи потоку GUI. oneapi::tbb::concurrent_queue<Foo>ResultQueue; // Частная копия последнего вычисленного результата для потока GUI. Foo CurrentResult; LRESULT CALLBACK WndProc(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam) { switch(msg) { case WM_COMMAND: switch (LOWORD(wParam)) { case IDM_LONGRUNNINGWORK: // Пользователь запросил длительное вычисление. Делегируйте его другому потоку. LaunchLongRunningWork(hWnd); break; case IDM_EXIT: DestroyWindow(hWnd); break; default: return DefWindowProc(hWnd, msg, wParam, lParam); } break; case WM_POP_FOO: // Есть еще один результат в ResultQueue, который я могу захватить. ResultQueue.try_pop(CurrentResult); // Обновление окна с последним результатом. RedrawWindow( hWnd, NULL, NULL, RDW_ERASE|RDW_INVALIDATE ); break; case WM_PAINT: Repaint the window using CurrentResult break; case WM_DESTROY: PostQuitMessage(0); break; default: return DefWindowProc( hWnd, msg, wParam, lParam ); } return 0; }

source: The GUI thread processes long computations as follows:
ru_ru: Поток GUI обрабатывает длинные вычисления следующим образом:

source: The GUI thread calls ``LongRunningWork``, which hands off the work to a worker thread and immediately returns.
ru_ru: Поток GUI вызывает ``LongRunningWork``, который передает работу рабочему потоку и сразу же возвращается обратно.

source: The GUI thread continues servicing the event loop. If it has to repaint the window, it uses the value of\ ``CurrentResult``, which is the most recent ``Foo`` that it has seen.
ru_ru: Поток GUI продолжает обслуживать цикл событий. Если ему нужно перерисовать окно, он использует значение ``CurrentResult``, которое является самым последним ``Foo``, которое он видел.

source: When a worker finishes the long computation, it pushes the result into ResultQueue, and sends a message WM_POP_FOO to the GUI thread.
ru_ru: Когда рабочий заканчивает длительное вычисление, он выталкивает результат в ResultQueue и отправляет сообщение WM_POP_FOO потоку GUI.

source: The GUI thread services a ``WM_POP_FOO`` message by popping an item from ResultQueue into CurrentResult. The ``try_pop`` always succeeds because there is exactly one ``WM_POP_FOO`` message for each item in ``ResultQueue``.
ru_ru: Поток GUI обслуживает сообщение ``WM_POP_FOO``, выгружая элемент из ResultQueue в CurrentResult. Команда ``try_pop`` всегда успешна, потому что для каждого элемента в ``ResultQueue`` существует ровно одно сообщение ``WM_POP_FOO``.

source: Routine ``LaunchLongRunningWork`` creates a function task and launches it using method ``task_arena::enqueue``.
ru_ru: Маршрут ``LaunchLongRunningWork`` создает функциональную задачу и запускает ее с помощью метода ``task_arena::enqueue``.

source: class LongTask { HWND hWnd; void operator()() { Do long computation Foo x = result of long computation ResultQueue.push( x ); // Notify GUI thread that result is available. PostMessage(hWnd,WM_POP_FOO,0,0); } public: LongTask( HWND hWnd_ ) : hWnd(hWnd_) {} }; void LaunchLongRunningWork( HWND hWnd ) { oneapi::tbb::task_arena a; a.enqueue(LongTask(hWnd)); }
ru_ru: class LongTask { HWND hWnd; void operator()() { Do long computation Foo x = result of long computation ResultQueue.push( x ); // Уведомить поток GUI о том, что результат доступен. PostMessage(hWnd,WM_POP_FOO,0,0); } public: LongTask( HWND hWnd_ ) : hWnd(hWnd_) {} }; void LaunchLongRunningWork( HWND hWnd ) { oneapi::tbb::task_arena a; a.enqueue(LongTask(hWnd)); }

source: It is essential to use method ``task_arena::enqueue`` here. Even though, an explicit ``task_arena`` instance is created, the method ``enqueue`` ensures that the function task eventually executes when resources permit, even if no thread explicitly waits on the task. In contrast, ``oneapi::tbb::task_group::run`` may postpone execution of the function task until it is explicitly waited upon with the ``oneapi::tbb::task_group::wait``.
ru_ru: Здесь очень важно использовать метод ``task_arena::enqueue``. Несмотря на то, что создается явный экземпляр ``task_arena``, метод ``enqueue`` гарантирует, что задача функции в конечном итоге будет выполнена, когда позволят ресурсы, даже если ни один поток явно не ожидает выполнения задачи. В отличие от этого, ``oneapi::tbb::task_group::run`` может отложить выполнение задачи функции до тех пор, пока она не будет явно ожидаться с помощью ``oneapi::tbb::task_group::wait``.

source: The example uses a ``concurrent_queue`` for workers to communicate results back to the GUI thread. Since only the most recent result matters in the example, and alternative would be to use a shared variable protected by a mutex. However, doing so would block the worker while the GUI thread was holding a lock on the mutex, and vice versa. Using ``concurrent_queue`` provides a simple robust solution.
ru_ru: В примере используется ``concurrent_queue`` для рабочих, чтобы передавать результаты обратно в поток GUI. Поскольку в примере имеет значение только самый последний результат, альтернативой могло бы быть использование общей переменной, защищенной мьютексом. Однако это привело бы к блокировке рабочего потока, пока поток GUI держит блокировку на мьютексе, и наоборот. Использование ``concurrent_queue`` обеспечивает простое надежное решение.

source: If two long computations are in flight, there is a chance that the first computation completes after the second one. If displaying the result of the most recently requested computation is important, then associate a request serial number with the computation. The GUI thread can pop from ``ResultQueue`` into a temporary variable, check the serial number, and update ``CurrentResult`` only if doing so advances the serial number.
ru_ru: Если два длинных вычисления находятся в полёте, есть вероятность, что первое вычисление завершится позже второго. Если отображение результата последнего запрошенного вычисления важно, то свяжи серийный номер запроса с вычислением. Поток GUI может получить результат из ``ResultQueue`` во временную переменную, проверить серийный номер и обновить ``CurrentResult`` только в том случае, если это приведет к увеличению серийного номера.
