Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Local_Serializer.po
Languages: ru_ru

source: Local Serializer
ru_ru: Локальный сериализатор

source: Context
ru_ru: Контекст

source: Consider an interactive program. To maximize concurrency and responsiveness, operations requested by the user can be implemented as tasks. The order of operations can be important. For example, suppose the program presents editable text to the user. There might be operations to select text and delete selected text. Reversing the order of "select" and "delete" operations on the same buffer would be bad. However, commuting operations on different buffers might be okay. Hence the goal is to establish serial ordering of tasks associated with a given object, but not constrain ordering of tasks between different objects.
ru_ru: Рассмотри интерактивную программу. Чтобы максимизировать параллелизм и отзывчивость, операции, запрашиваемые пользователем, могут быть реализованы в виде задач. Порядок выполнения операций может быть важным. Например, предположим, что программа представляет пользователю редактируемый текст. Могут быть операции по выделению текста и удалению выделенного текста. Изменение порядка операций "выбрать" и "удалить" на одном и том же буфере было бы плохо. Однако коммутация операций на разных буферах может быть нормальной. Следовательно, цель состоит в том, чтобы установить последовательное упорядочивание задач, связанных с данным объектом, но не ограничивать упорядочивание задач между различными объектами.

source: Forces
ru_ru: Форсы

source: Operations associated with a certain object must be performed in serial order.
ru_ru: Операции, связанные с определенным объектом, должны выполняться в последовательном порядке.

source: Serializing with a lock would be wasteful because threads would be waiting at the lock when they could be doing useful work elsewhere.
ru_ru: Сериализация с блокировкой была бы расточительной, потому что потоки ожидали бы блокировки, когда они могли бы выполнять полезную работу в другом месте.

source: Solution
ru_ru: Решение

source: Sequence the work items using a FIFO (first-in first-out structure). Always keep an item in flight if possible. If no item is in flight when a work item appears, put the item in flight. Otherwise, push the item onto the FIFO. When the current item in flight completes, pop another item from the FIFO and put it in flight.
ru_ru: Упорядочивай рабочие элементы, используя структуру FIFO (first-in first-out structure). Всегда держи предмет в полете, если это возможно. Если ни один элемент не находится в полете, когда появляется рабочий элемент, помести этот элемент в полет. В противном случае вытесни элемент в FIFO. Когда текущий элемент в полёте завершится, вытолкни другой элемент из FIFO и помести его в полёт.

source: The logic can be implemented without mutexes, by using ``concurrent_queue`` for the FIFO and ``atomic<int>`` to count the number of items waiting and in flight. The example explains the accounting in detail.
ru_ru: Эту логику можно реализовать без мьютексов, используя ``concurrent_queue`` для FIFO и ``atomic<int>`` для подсчёта количества ожидающих и находящихся в полёте элементов. Пример подробно объясняет учет.

source: Example
ru_ru: Пример

source: The following example builds on the Non-Preemptive Priorities example to implement local serialization in addition to priorities. It implements three priority levels and local serializers. The user interface for it follows:
ru_ru: Следующий пример основан на примере "Приоритеты без вытеснения" и реализует локальную сериализацию в дополнение к приоритетам. Он реализует три уровня приоритетов и локальные сериализаторы. Пользовательский интерфейс для него следует ниже:

source: Template function ``EnqueueWork`` causes functor ``f`` to run when the three constraints in the following table are met.
ru_ru: Шаблонная функция ``EnqueueWork`` вызывает запуск функтора ``f``, когда выполняются три ограничения в следующей таблице.

source: Constraint
ru_ru: Constraint (Ограничение)

source: Resolved by class...
ru_ru: Решено классом...

source: Any prior work for the ``Serializer`` has completed.
ru_ru: Любая предшествующая работа для ``Serializer`` завершена.

source: A thread is available.
ru_ru: Нить можно приобрести.

source: No higher priority work is ready to run.
ru_ru: Никакая более приоритетная работа не готова к запуску.

source: Constraints on a given functor are resolved from top to bottom in the table. The first constraint does not exist when s is NULL. The implementation of ``EnqueueWork`` packages the functor in a ``SerializedWorkItem`` and routes it to the class that enforces the first relevant constraint between pieces of work.
ru_ru: Ограничения на данный вектор разрешаются сверху вниз по таблице. Первое ограничение не существует, если s равно NULL. Реализация ``EnqueueWork`` упаковывает функтор в ``SerializedWorkItem`` и направляет его в класс, который применяет первое соответствующее ограничение между частями работы.

source: A ``SerializedWorkItem`` is derived from a ``WorkItem``, which serves as a way to pass around a prioritized piece of work without knowing further details of the work.
ru_ru: ``SerializedWorkItem`` является производным от ``WorkItem``, который служит способом передачи приоритетной части работы без знания дальнейших деталей работы.

source: // Abstract base class for a prioritized piece of work. class WorkItem { public: WorkItem( Priority p ) : priority(p) {} // Derived class defines the actual work. virtual void run() = 0; const Priority priority; }; template<typename Func> class SerializedWorkItem: public WorkItem { Serializer* serializer; Func f; /*override*/ void run() { f(); Serializer* s = serializer; // Destroy f before running Serializer’s next functor. delete this; if( s ) s->noteCompletion(); } public: SerializedWorkItem( Priority p, const Func& f_, Serializer* s ) : WorkItem(p), serializer(s), f(f_) {} };
ru_ru: // Абстрактный базовый класс для приоритетной части работы. class WorkItem { public: WorkItem( Priority p ) : priority(p) {} // Производный класс определяет фактическую работу. virtual void run() = 0; const Priority priority; }; template<typename Func> class SerializedWorkItem: public WorkItem { Serializer* serializer; Func f; /*override*/ void run() { f(); Serializer* s = serializer; // Уничтожить f перед запуском следующего функтора Serializer. delete this; if( s ) s->noteCompletion(); } public: SerializedWorkItem( Priority p, const Func& f_, Serializer* s ) : WorkItem(p), serializer(s), f(f_) {} };

source: Base class ``WorkItem`` is the same as class WorkItem in the example for Non-Preemptive Priorities. The notion of serial constraints is completely hidden from the base class, thus permitting the framework to extend other kinds of constraints or lack of constraints. Class ``SerializedWorkItem`` is essentially ``ConcreteWorkItem`` from the example for Non-Preemptive Priorities, extended with a ``Serializer`` aspect.
ru_ru: Базовый класс ``WorkItem`` - это то же самое, что и класс WorkItem в примере для не вытесняющих приоритетов. Понятие последовательных ограничений полностью скрыто от базового класса, что позволяет фреймворку расширять другие виды ограничений или отсутствие ограничений. Класс ``SerializedWorkItem`` по сути является ``ConcreteWorkItem`` из примера для Non-Preemptive Priorities, расширенный аспектом ``Serializer``.

source: Virtual method ``run()`` is invoked when it becomes time to run the functor. It performs three steps:
ru_ru: Виртуальный метод ``run()`` вызывается, когда наступает время запуска функтора. Он выполняет три этапа:

source: Run the functor.
ru_ru: Запускай функтор.

source: Destroy the functor.
ru_ru: Уничтожь функтор.

source: Notify the ``Serializer`` that the functor completed, and thus unconstraining the next waiting functor.
ru_ru: Уведоми ``Serializer`` о том, что функтор завершен, и тем самым сними ограничения со следующего ожидающего функтора.

source: Step 3 is the difference from the operation of ConcreteWorkItem::run. Step 2 could be done after step 3 in some contexts to increase concurrency slightly. However, the presented order is recommended because if step 2 takes non-trivial time, it likely has side effects that should complete before the next functor runs.
ru_ru: Шаг 3 - это отличие от операции ``ConcreteWorkItem::run``. Шаг 2 может быть выполнен после шага 3 в некоторых контекстах, чтобы немного увеличить параллелизм. Однако представленный порядок рекомендуется, потому что если шаг 2 занимает нетривиальное время, то он, скорее всего, имеет побочные эффекты, которые должны завершиться до запуска следующего функтора.

source: Class ``Serializer`` implements the core of the Local Serializer pattern:
ru_ru: Класс ``Serializer`` реализует ядро паттерна Local Serializer:

source: class Serializer { oneapi::tbb::concurrent_queue<WorkItem*> queue; std::atomic<int> count; // Count of queued items and in-flight item void moveOneItemToReadyPile() { // Transfer item from queue to ReadyPile WorkItem* item; queue.try_pop(item); ReadyPile.add(item); } public: void add( WorkItem* item ) { queue.push(item); if( ++count==1 ) moveOneItemToReadyPile(); } void noteCompletion() { // Called when WorkItem completes. if( --count!=0 ) moveOneItemToReadyPile(); } };
ru_ru: class Serializer { oneapi::tbb::concurrent_queue<WorkItem*> queue; std::atomic<int> count; // Количество элементов в очереди и в полете void moveOneItemToReadyPile() { // Передача элемента из очереди в ReadyPile WorkItem* item; queue.try_pop(item); ReadyPile.add(item); } public: void add( WorkItem* item ) { queue.push(item); if( ++count==1 ) moveOneItemToReadyPile(); } void noteCompletion() { // Вызывается, когда WorkItem завершается. if( --count!=0 ) moveOneItemToReadyPile(); } };

source: The class maintains two members:
ru_ru: Класс поддерживает два члена:

source: A queue of WorkItem waiting for prior work to complete.
ru_ru: Очередь WorkItem, ожидающих завершения предыдущей работы.

source: A count of queued or in-flight work.
ru_ru: Подсчет работы в очереди или в полете.

source: Mutexes are avoided by using ``concurrent_queue<WorkItem*>`` and ``atomic<int>`` along with careful ordering of operations. The transitions of count are the key understanding how class ``Serializer`` works.
ru_ru: Мьютексов можно избежать, используя ``concurrent_queue<WorkItem*>`` и ``atomic<int>`` наряду с тщательным упорядочиванием операций. Переходы count - это ключевое понимание того, как работает класс ``Serializer``.

source: If method ``add`` increments ``count`` from 0 to 1, this indicates that no other work is in flight and thus the work should be moved to the ``ReadyPile``.
ru_ru: Если метод ``add`` увеличивает ``count`` от 0 до 1, это указывает на то, что никакая другая работа не находится в полёте, и поэтому работу следует переместить в ``ReadyPile``.

source: If method ``noteCompletion`` decrements count and it is *not* from 1 to 0, then the queue is non-empty and another item in the queue should be moved to ``ReadyPile``.
ru_ru: Если метод ``noteCompletion`` уменьшает count и он *не* от 1 до 0, то очередь не пуста, и другой элемент в очереди должен быть перемещен в ``ReadyPile``.

source: Class ``ReadyPile`` is explained in the example for Non-Preemptive Priorities.
ru_ru: Класс ``ReadyPile`` объясняется в примере для невытесняющих приоритетов.

source: If priorities are not necessary, there are two variations on method ``moveOneItemToReadyPile``, with different implications.
ru_ru: Если приоритеты не нужны, есть две вариации метода ``moveOneItemToReadyPile``, с разными последствиями.

source: Method ``moveOneItemToReadyPile`` could directly invoke\ ``item->run()``. This approach has relatively low overhead and high thread locality for a given ``Serializer``. But it is unfair. If the ``Serializer`` has a continual stream of tasks, the thread operating on it will keep servicing those tasks to the exclusion of others.
ru_ru: Метод ``moveOneItemToReadyPile`` может напрямую вызывать ``item->run()``. Этот подход имеет относительно низкие накладные расходы и высокую локальность потоков для данного ``Serializer``. Но он несправедлив. Если у ``Serializer`` есть непрерывный поток задач, то поток, работающий на нём, будет продолжать обслуживать эти задачи, исключая другие.

source: Method ``moveOneItemToReadyPile`` could invoke ``task::enqueue`` to enqueue a task that invokes ``item->run()``. Doing so introduces higher overhead and less locality than the first approach, but avoids starvation.
ru_ru: Метод ``moveOneItemToReadyPile`` может вызывать ``task::enqueue``, чтобы вызвать задачу, которая вызывает ``item->run()``. Это влечет за собой более высокие накладные расходы и меньшую локальность, чем первый подход, но позволяет избежать голодания.

source: The conflict between fairness and maximum locality is fundamental. The best resolution depends upon circumstance.
ru_ru: Конфликт между справедливостью и максимальной локальностью является фундаментальным. Лучшее разрешение зависит от обстоятельств.

source: The pattern generalizes to constraints on work items more general than those maintained by class Serializer. A generalized ``Serializer::add`` determines if a work item is unconstrained, and if so, runs it immediately. A generalized ``Serializer::noteCompletion`` runs all previously constrained items that have become unconstrained by the completion of the current work item. The term "run" means to run work immediately, or if there are more constraints, forwarding the work to the next constraint resolver.
ru_ru: Этот паттерн обобщается на ограничения на рабочие элементы более общие, чем те, которые поддерживаются классом Serializer. Обобщенный ``Serializer::add`` определяет, является ли рабочий элемент неограниченным, и если да, то запускает его немедленно. Обобщённый ``Serializer::noteCompletion`` запускает все ранее ограниченные элементы, которые стали неограниченными в результате завершения текущего рабочего элемента. Термин "запуск" означает немедленный запуск работы или, если ограничений больше, переадресацию работы следующему преобразователю ограничений.
