Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Non-Preemptive_Priorities.po
Languages: ru_ru

source: Non-Preemptive Priorities
ru_ru: Не упреждающие приоритеты

source: Problem
ru_ru: Проблема

source: Choose the next work item to do, based on priorities.
ru_ru: Выбери следующий рабочий элемент для выполнения, основываясь на приоритетах.

source: Context
ru_ru: Контекст

source: The scheduler in |full_name| chooses tasks using rules based on scalability concerns. The rules are based on the order in which tasks were spawned or enqueued, and are oblivious to the contents of tasks. However, sometimes it is best to choose work based on some kind of priority relationship.
ru_ru: Планировщик в |full_name| выбирает задачи, используя правила, основанные на соображениях масштабируемости. Правила основаны на порядке, в котором задачи были порождены или поставлены в очередь, и не обращают внимания на содержимое задач. Однако иногда лучше всего выбирать работу, основываясь на каком-то соотношении приоритетов.

source: Forces
ru_ru: Форсы

source: Given multiple work items, there is a rule for which item should be done next that is *not* the default oneTBB rule.
ru_ru: Учитывая несколько рабочих элементов, существует правило для того, какой элемент должен быть выполнен следующим, которое *не* является правилом по умолчанию oneTBB.

source: Preemptive priorities are not necessary. If a higher priority item appears, it is not necessary to immediately stop lower priority items in flight. If preemptive priorities are necessary, then non-preemptive tasking is inappropriate. Use threads instead.
ru_ru: Упреждающие приоритеты не нужны. Если появляется элемент с более высоким приоритетом, то нет необходимости немедленно останавливать в полете элементы с более низким приоритетом. Если вытесняющие приоритеты необходимы, то невытесняющая постановка задач неуместна. Вместо этого используй потоки.

source: Solution
ru_ru: Решение

source: Put the work in a shared work pile. Decouple tasks from specific work, so that task execution chooses the actual piece of work to be selected from the pile.
ru_ru: Помести работу в общую рабочую кучу. Отдели задачи от конкретной работы, чтобы выполнение задачи выбирало фактическую часть работы, которая будет выбрана из кучи.

source: Example
ru_ru: Пример

source: The following example implements three priority levels. The user interface for it and top-level implementation follow:
ru_ru: Следующий пример реализует три уровня приоритета. Далее следует пользовательский интерфейс для него и реализация верхнего уровня:

source: The caller provides a priority ``p`` and a functor ``f`` to routine ``EnqueueWork``. The functor may be the result of a lambda expression. ``EnqueueWork`` packages ``f`` as a ``WorkItem`` and adds it to global object ``ReadyPile``.
ru_ru: Вызывающая сторона предоставляет приоритет ``p`` и вектор ``f`` для процедуры ``EnqueueWork``. Функтор может быть результатом лямбда-выражения. ``EnqueueWork`` упаковывает ``f`` как ``WorkItem`` и добавляет его в глобальный объект ``ReadyPile``.

source: Class ``WorkItem`` provides a uniform interface for running functors of unknown type:
ru_ru: Класс ``WorkItem`` предоставляет единый интерфейс для запуска функторов неизвестного типа:

source: // Abstract base class for a prioritized piece of work. class WorkItem { public: WorkItem( Priority p ) : priority(p) {} // Derived class defines the actual work. virtual void run() = 0; const Priority priority; }; template<typename Func> class ConcreteWorkItem: public WorkItem { Func f; /*override*/ void run() { f(); delete this; } public: ConcreteWorkItem( Priority p, const Func& f_ ) : WorkItem(p), f(f_) {} };
ru_ru: // Абстрактный базовый класс для приоритетной части работы. class WorkItem { public: WorkItem( Priority p ) : priority(p) {} // Производный класс определяет фактическую работу. virtual void run() = 0; const Priority priority; }; template<typename Func> class ConcreteWorkItem: public WorkItem { Func f; /*override*/ void run() { f(); delete this; } public: ConcreteWorkItem( Priority p, const Func& f_ ) : WorkItem(p), f(f_) {} };

source: Class ``ReadyPile`` contains the core pattern. It maintains a collection of work and fires off tasks through the ``oneapi::tbb::task_group::run`` interface and then choose a work from the collection:
ru_ru: Класс ``ReadyPile`` содержит основной паттерн. Он поддерживает коллекцию работ и выстреливает задачи через интерфейс ``oneapi::tbb::task_group::run``, а затем выбирает работу из коллекции:

source: class ReadyPileType { // One queue for each priority level oneapi::tbb::concurrent_queue<WorkItem*> level[P_Low+1]; oneapi::tbb::task_group tg; public: void add( WorkItem* item ) { level[item->priority].push(item); tg.run(RunWorkItem()); } void runNextWorkItem() { // Scan queues in priority order for an item. WorkItem* item=NULL; for( int i=P_High; i<=P_Low; ++i ) if( level[i].try_pop(item) ) break; assert(item); item->run(); } }; ReadyPileType ReadyPile;
ru_ru: class ReadyPileType { // Одна очередь для каждого уровня приоритета oneapi::tbb::concurrent_queue<WorkItem*> level[P_Low+1]; oneapi::tbb::task_group tg; public: void add( WorkItem* item ) { level[item->priority].push(item); tg.run(RunWorkItem()); } void runNextWorkItem() { // Сканирование очередей в порядке приоритета для элемента. WorkItem* item=NULL; for( int i=P_High; i<=P_Low; ++i ) if( level[i].try_pop(item) ) break; assert(item); item->run(); } }; ReadyPileType ReadyPile;

source: The task added by ``add(item)`` does *not* necessarily execute that item. The task itself executes ``runNextWorkItem()``, which may find a higher priority item. There is one task for each item, but the mapping resolves when the task actually executes, not when it is created.
ru_ru: Задача, добавленная командой ``add(item)``, *не обязательно* выполняет этот пункт. Сама задача выполняет ``runNextWorkItem()``, которая может найти более приоритетный элемент. Для каждого элемента существует одна задача, но сопоставление решается, когда задача действительно выполняется, а не когда она создается.

source: Here are the details of class ``RunWorkItem``:
ru_ru: Вот детали класса ``RunWorkItem``:

source: ``RunWorkItem`` objects are fungible. They enable the oneTBB scheduler to choose when to do a work item, not which work item to do.
ru_ru: Объекты ``RunWorkItem`` являются взаимозаменяемыми. Они позволяют планировщику oneTBB выбирать, когда выполнять рабочий элемент, а не какой рабочий элемент выполнять.

source: Other priority schemes can be implemented by changing the internals for ``ReadyPileType``. A priority queue could be used to implement very fine grained priorities.
ru_ru: Другие схемы приоритетов могут быть реализованы путем изменения внутренних параметров для ``ReadyPileType``. Для реализации очень тонких приоритетов можно использовать очередь приоритетов.

source: The scalability of the pattern is limited by the scalability of ``ReadyPileType``. Ideally scalable concurrent containers should be used for it.
ru_ru: Масштабируемость паттерна ограничена масштабируемостью ``ReadyPileType``. В идеале для него должны использоваться масштабируемые параллельные контейнеры.
