Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Odd-Even_Communication.po
Languages: ru_ru

source: Odd-Even Communication
ru_ru: Нечетные и четные коммуникации

source: Problem
ru_ru: Проблема

source: Operations on data cannot be done entirely independently, but data can be partitioned into two subsets such that all operations on a subset can run in parallel.
ru_ru: Операции над данными не могут выполняться полностью независимо, но данные можно разделить на два подмножества так, чтобы все операции над подмножеством могли выполняться параллельно.

source: Context
ru_ru: Контекст

source: Solvers for partial differential equations can often be modified to follow this pattern. For example, for a 2D grid with only nearest-neighbor communication, it may be possible to treat the grid as a checkerboard, and alternate between updating red squares and black squares.
ru_ru: Решатели дифференциальных уравнений часто могут быть модифицированы таким образом, чтобы следовать этой схеме. Например, для двумерной сетки с единственной связью между ближайшими соседями можно рассматривать сетку как шашечную доску и чередовать обновление красных и черных квадратов.

source: Another context is staggered grid ("leap frog") Finite Difference Time Domain (FDTD solvers, which naturally fit the pattern.
ru_ru: Другой контекст - это решатели конечных разностей во временной области (FDTD) со ступенчатой сеткой ("прыгающая лягушка"), которые естественным образом вписываются в эту схему.

source: Forces
ru_ru: Форсы

source: Dependencies between items form a bipartite graph.
ru_ru: Зависимости между элементами образуют двудольный граф.

source: Solution
ru_ru: Решение

source: Alternate between updating one subset and then the other subset. Apply the elementwise pattern to each subset.
ru_ru: Попеременно обновляй сначала одно подмножество, а затем другое. Применяй поэлементную схему к каждому подмножеству.

source: References
ru_ru: Ссылки

source: Eun-Gyu Kim and Mark Snir, "Odd-Even Communication Group", http://snir.cs.illinois.edu/patterns/oddeven.pdf
ru_ru: Ын-Гю Ким и Марк Снир, "Коммуникационная группа Odd-Even", http://snir.cs.illinois.edu/patterns/oddeven.pdf
