Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Reduction.po
Languages: ru_ru

source: Reduction
ru_ru: Редукция

source: Problem
ru_ru: Проблема

source: Perform an associative reduction operation across a data set.
ru_ru: Выполни операцию ассоциативного сокращения набора данных.

source: Context
ru_ru: Контекст

source: Many serial algorithms sweep over a set of items to collect summary information.
ru_ru: Многие последовательные алгоритмы перебирают набор элементов для сбора суммарной информации.

source: Forces
ru_ru: Форсы

source: The summary can be expressed as an associative operation over the data set, or at least is close enough to associative that reassociation does not matter.
ru_ru: Резюме может быть выражено как ассоциативная операция над набором данных или, по крайней мере, достаточно близко к ассоциативной, чтобы повторная ассоциация не имела значения.

source: Solution
ru_ru: Решение

source: Two solutions exist in |full_name|. The choice on which to use depends upon several considerations:
ru_ru: В |full_name| существуют два решения. Выбор того, какое из них использовать, зависит от нескольких соображений:

source: Is the operation commutative as well as associative?
ru_ru: Является ли операция коммутативной, а также ассоциативной?

source: Are instances of the reduction type expensive to construct and destroy. For example, a floating point number is inexpensive to construct. A sparse floating-point matrix might be very expensive to construct.
ru_ru: Являются ли экземпляры редукционного типа дорогими для построения и уничтожения. Например, число с плавающей запятой является недорогим для построения. Разреженная матрица с плавающей точкой может быть очень дорогой для построения.

source: Use ``oneapi::tbb::parallel_reduce`` when the objects are inexpensive to construct. It works even if the reduction operation is not commutative.
ru_ru: Используй ``oneapi::tbb::parallel_reduce``, когда объекты недороги в построении. Это работает, даже если операция уменьшения не является коммутативной.

source: Use ``oneapi::tbb::parallel_for`` and ``oneapi::tbb::combinable`` if the reduction operation is commutative and instances of the type are expensive.
ru_ru: Используй ``oneapi::tbb::parallel_for`` и ``oneapi::tbb::combinable``, если операция редукции коммутативна, а экземпляры типа дороги.

source: If the operation is not precisely associative but a precisely deterministic result is required, use recursive reduction and parallelize it using ``oneapi::tbb::parallel_invoke``.
ru_ru: Если операция не является точно ассоциативной, но требуется точно детерминированный результат, используй рекурсивную редукцию и распараллель ее с помощью ``oneapi::tbb::parallel_invoke``.

source: Examples
ru_ru: Примеры

source: The examples presented here illustrate the various solutions and some tradeoffs.
ru_ru: Представленные здесь примеры иллюстрируют различные решения и некоторые компромиссы.

source: The first example uses ``oneapi::tbb::parallel_reduce`` to do a + reduction over sequence of type ``T``. The sequence is defined by a half-open interval [first,last).
ru_ru: Первый пример использует ``oneapi::tbb::parallel_reduce`` для выполнения +-редукции над последовательностью типа ``T``. Последовательность задается полуоткрытым интервалом [first,last).

source: T AssociativeReduce( const T* first, const T* last, T identity ) { return oneapi::tbb::parallel_reduce( // Index range for reduction oneapi::tbb::blocked_range<const T*>(first,last), // Identity element identity, // Reduce a subrange and partial sum [&]( oneapi::tbb::blocked_range<const T*> r, T partial_sum )->float { return std::accumulate( r.begin(), r.end(), partial_sum ); }, // Reduce two partial sums std::plus<T>() ); }
ru_ru: T AssociativeReduce( const T* first, const T* last, T identity ) { return oneapi::tbb::parallel_reduce( // Диапазон индексов для уменьшения oneapi::tbb::blocked_range<const T*>(first,last), // Элемент идентичности identity, // Уменьшить поддиапазон и частичную сумму [&]( oneapi::tbb::blocked_range<const T*> r, T partial_sum )->float { return std::accumulate( r.begin(), r.end(), partial_sum ); }, // Сократите две частичные суммы std::plus<T>() ); }

source: The third and fourth arguments to this form of ``parallel_reduce`` are a built in form of the agglomeration pattern. If there is an elementwise action to be performed before the reduction, incorporating it into the third argument (reduction of a subrange) may improve performance because of better locality of reference. Note that the block size for agglomeration is not explicitly specified; ``parallel_reduce`` defines blocks automatically with the help of implicitly used ``oneapi::tbb::auto_partitioner``.
ru_ru: Третий и четвертый аргументы этой формы ``parallel_reduce`` являются встроенной формой шаблона агломерации. Если перед редукцией необходимо выполнить элементарное действие, включение его в третий аргумент (редукция поддиапазона) может улучшить производительность из-за лучшей локальности ссылок. Обрати внимание, что размер блока для агломерации не задан явно; ``parallel_reduce`` определяет блоки автоматически с помощью неявно используемого ``oneapi::tbb::auto_partitioner``.

source: The second example assumes the + is commutative on ``T``. It is a good solution when ``T`` objects are expensive to construct.
ru_ru: Во втором примере предполагается, что + коммутативен на ``T``. Это хорошее решение, когда объекты ``T`` дорого строить.

source: Sometimes it is desirable to destructively use the partial results to generate the final result. For example, if the partial results are lists, they can be spliced together to form the final result. In that case use class ``oneapi::tbb::enumerable_thread_specific`` instead of ``combinable``. The ``ParallelFindCollisions`` example in :ref:`Divide_and_Conquer` demonstrates the technique.
ru_ru: Иногда желательно деструктивно использовать частичные результаты для создания конечного результата. Например, если частичные результаты представляют собой списки, они могут быть объединены вместе для формирования окончательного результата. В таком случае используй класс ``oneapi::tbb::enumerable_thread_specific`` вместо ``combinable``. Пример ``ParallelFindCollisions`` в :ref:`Divide_and_Conquer`` демонстрирует эту технику.

source: Floating-point addition and multiplication are almost associative. Reassociation can cause changes because of rounding effects. The techniques shown so far reassociate terms non-deterministically. Fully deterministic parallel reduction for a not quite associative operation requires using deterministic reassociation. The code below demonstrates this in the form of a template that does a + reduction over a sequence of values of type ``T``.
ru_ru: Сложение и умножение с плавающей точкой почти ассоциативны. Переассоциация может вызвать изменения из-за эффектов округления. Методы, показанные до сих пор, повторно ассоциируют члены недетерминированно. Полностью детерминированное параллельное сокращение для не совсем ассоциативной операции требует использования детерминированной реассоциации. Код ниже демонстрирует это в виде шаблона, который выполняет +-редукцию над последовательностью значений типа ``T``.

source: template<typename T> T RepeatableReduce( const T* first, const T* last, T identity ) { if( last-first<=1000 ) { // Use serial reduction return std::accumulate( first, last, identity ); } else { // Do parallel divide-and-conquer reduction const T* mid = first+(last-first)/2; T left, right; oneapi::tbb::parallel_invoke( [&]{left=RepeatableReduce(first,mid,identity);}, [&]{right=RepeatableReduce(mid,last,identity);} ); return left+right; } }
ru_ru: template<typename T> T RepeatableReduce( const T* first, const T* last, T identity ) { if( last-first<=1000 ) { // Используйте последовательное сокращение return std::accumulate( first, last, identity ); } else { // Выполните параллельную редукцию по принципу "разделяй и властвуй" const T* mid = first+(last-first)/2; T left, right; oneapi::tbb::parallel_invoke( [&]{left=RepeatableReduce(first,mid,identity);}, [&]{right=RepeatableReduce(mid,last,identity);} ); return left+right; } }

source: The outer if-else is an instance of the agglomeration pattern for recursive computations. The reduction graph, though not a strict binary tree, is fully deterministic. Thus the result will always be the same for a given input sequence, assuming all threads do identical floating-point rounding.
ru_ru: Внешний if-else - это экземпляр схемы агломерации для рекурсивных вычислений. Граф редукции, хотя и не является строгим двоичным деревом, полностью детерминирован. Таким образом, результат всегда будет одинаковым для заданной входной последовательности, если предположить, что все потоки выполняют одинаковое округление с плавающей запятой.

source: ``oneapi::tbb::parallel_deterministic_reduce`` is a simpler and more efficient way to get reproducible non-associative reduction. It is very similar to ``oneapi::tbb::parallel_reduce`` but, unlike the latter, builds a deterministic reduction graph. With it, the ``RepeatableReduce`` sample can be almost identical to ``AssociativeReduce``:
ru_ru: ``oneapi::tbb::parallel_deterministic_reduce`` - это более простой и эффективный способ получить воспроизводимую неассоциативную редукцию. Он очень похож на ``oneapi::tbb::parallel_reduce``, но, в отличие от последнего, строит детерминированный граф редукции. С его помощью выборка ``RepeatableReduce`` может быть практически идентична ``AssociativeReduce``:

source: Besides the function name change, note the grain size of 1000 specified for ``oneapi::tbb::blocked_range``. It defines the desired block size for agglomeration; automatic block size selection is not used due to non-determinism.
ru_ru: Помимо изменения названия функции, обрати внимание на размер зерна в 1000, указанный для ``oneapi::tbb::blocked_range``. Он определяет желаемый размер блока для агломерации; автоматический выбор размера блока не используется из-за недетерминизма.

source: The final example shows how a problem that typically is not viewed as a reduction can be parallelized by viewing it as a reduction. The problem is retrieving floating-point exception flags for a computation across a data set. The serial code might look something like:
ru_ru: Последний пример показывает, как проблема, которая обычно не рассматривается как редукция, может быть распараллелена, если рассматривать ее как редукцию. Проблема заключается в извлечении флагов исключений с плавающей точкой для вычислений по набору данных. Последовательный код может выглядеть примерно так:

source: The code can be parallelized by computing chunks of the loop separately, and merging floating-point flags from each chunk. To do this with ``tbb:parallel_reduce``, first define a "body" type, as shown below.
ru_ru: Этот код можно распараллелить, вычисляя фрагменты цикла по отдельности и объединяя флаги с плавающей точкой из каждого фрагмента. Чтобы сделать это с помощью ``tbb:parallel_reduce``, сначала определи тип "body", как показано ниже.

source: struct ComputeChunk { int flags; // Holds floating-point exceptions seen so far. void reset_fpe() { flags=0; feclearexcept(FE_ALL_EXCEPT); } ComputeChunk () { reset_fpe(); } // "Splitting constructor"called by parallel_reduce when splitting a range into subranges. ComputeChunk ( const ComputeChunk&, oneapi::tbb::split ) { reset_fpe(); } // Operates on a chunk and collects floating-point exception state into flags member. void operator()( oneapi::tbb::blocked_range<int> r ) { int end=r.end(); for( int i=r.begin(); i!=end; ++i ) C[i] = A[i]/B[i]; // It is critical to do |= here, not =, because otherwise we // might lose earlier exceptions from the same thread. flags |= fetestexcept(FE_ALL_EXCEPT); } // Called by parallel_reduce when joining results from two subranges. void join( Body& other ) { flags |= other.flags; } };
ru_ru: struct ComputeChunk { int flags; // Хранит исключения с плавающей точкой, которые были замечены до сих пор. void reset_fpe() { flags=0; feclearexcept(FE_ALL_EXCEPT); } ComputeChunk () { reset_fpe(); } // "Конструктор разбиения", вызываемый parallel_reduce при разбиении диапазона на поддиапазоны. ComputeChunk ( const ComputeChunk&, oneapi::tbb::split ) { reset_fpe(); } // Оперирует с чанком и собирает состояние исключения с плавающей точкой в член flags. void operator()( oneapi::tbb::blocked_range<int> r ) { int end=r.end(); for( int i=r.begin(); i!=end; ++i ) C[i] = A[i]/B[i]; // Очень важно сделать здесь |=, а не =, потому что в противном случае мы можем // потерять предыдущие исключения из того же потока. flags |= fetestexcept(FE_ALL_EXCEPT); } // Вызывается parallel_reduce при объединении результатов двух подрангов. void join( Body& other ) { flags |= other.flags; } };

source: Then invoke it as follows:
ru_ru: Затем вызови его следующим образом:

source: // Construction of cc implicitly resets FP exception state. ComputeChunk cc; oneapi::tbb::parallel_reduce( oneapi::tbb::blocked_range<int>(0,N), cc ); if (cc.flags & FE_DIVBYZERO) ...; if (cc.flags & FE_OVERFLOW) ...; ...
ru_ru: // Построение cc неявно сбрасывает состояние исключения FP. ComputeChunk cc; oneapi::tbb::parallel_reduce( oneapi::tbb::blocked_range<int>(0,N), cc ); if (cc.flags & FE_DIVBYZERO) ...; if (cc.flags & FE_OVERFLOW) ...; ...
