Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Reference_Counting.po
Languages: ru_ru

source: Reference Counting
ru_ru: Подсчет ссылок

source: Problem
ru_ru: Проблема

source: Destroy an object when it will no longer be used.
ru_ru: Уничтожь объект, когда он больше не будет использоваться.

source: Context
ru_ru: Контекст

source: Often it is desirable to destroy an object when it is known that it will not be used in the future. Reference counting is a common serial solution that extends to parallel programming if done carefully.
ru_ru: Часто бывает желательно уничтожить объект, когда известно, что он не будет использоваться в будущем. Подсчет ссылок - это распространенное последовательное решение, которое при аккуратном выполнении распространяется и на параллельное программирование.

source: Forces
ru_ru: Силы

source: If there are cycles of references, basic reference counting is insufficient unless the cycle is explicitly broken.
ru_ru: Если существуют циклы ссылок, то базового подсчета ссылок недостаточно, если только цикл явно не разорван.

source: Atomic counting is relatively expensive in hardware.
ru_ru: Атомный подсчет относительно дорог в аппаратном обеспечении.

source: Solution
ru_ru: Решение

source: Thread-safe reference counting is like serial reference counting, except that the increment/decrement is done atomically, and the decrement and test "count is zero?" must act as a single atomic operation. The following example uses ``std::atomic<int>`` to achieve this.
ru_ru: Потокобезопасный подсчет ссылок похож на последовательный подсчет ссылок, за исключением того, что инкремент/декремент выполняется атомарно, а декремент и проверка "count равен нулю?" должны действовать как одна атомарная операция. В следующем примере для этого используется ``std::atomic<int>``.

source: It is incorrect to use a separate read for testing if the count is zero. The following code would be an incorrect implementation of method ``remove_ref``\ () because two threads might both execute the decrement, and then both read ``my_count`` as zero. Hence two callers would both be told incorrectly that they had removed the last reference.
ru_ru: Неправильно использовать отдельное чтение для проверки того, равен ли счет нулю. Следующий код будет неправильной реализацией метода ``remove_ref``\ (), потому что два потока могут оба выполнить декремент, а затем оба прочитать ``my_count`` как ноль. Следовательно, двум вызывающим потокам будет неверно сказано, что они удалили последнюю ссылку.

source: The decrement may need to have a *release* fence so that any pending writes complete before the object is deleted.
ru_ru: Декременту может потребоваться ограждение *release*, чтобы все ожидающие записи завершились до того, как объект будет удален.

source: There is no simple way to atomically copy a pointer and increment its reference count, because there will be a timing hole between the copying and the increment where the reference count is too low, and thus another thread might decrement the count to zero and delete the object. Two ways to address the problem are "hazard pointers" and "pass the buck". See the references below for details.
ru_ru: Не существует простого способа атомарно копировать указатель и увеличивать его счётчик ссылок, потому что между копированием и увеличением будет временная дыра, когда счётчик ссылок будет слишком мал, и, таким образом, другой поток может уменьшить счётчик до нуля и удалить объект. Два способа решения этой проблемы - это "опасные указатели" и "передавать удар". Подробности смотри в ссылках ниже.

source: Variations
ru_ru: Вариации

source: Atomic increment/decrement can be more than an order of magnitude more expensive than ordinary increment/decrement. The serial optimization of eliminating redundant increment/decrement operations becomes more important with atomic reference counts.
ru_ru: Атомарный инкремент/декремент может быть более чем на порядок дороже обычного инкремента/декремента. Серийная оптимизация, заключающаяся в устранении избыточных операций инкремента/декремента, становится более важной при атомарном подсчете ссылок.

source: Weighted reference counting can be used to reduce costs if the pointers are unshared but the referent is shared. Associate a *weight* with each pointer. The reference count is the sum of the weights. A pointer ``x`` can be copied as a pointer ``x'`` without updating the reference count by splitting the original weight between ``x`` and ``x'``. If the weight of ``x`` is too low to split, then first add a constant W to the reference count and weight of ``x``.
ru_ru: Взвешенный подсчет ссылок может быть использован для снижения затрат, если указатели не разделяются, но референт является общим. Привяжи *вес* к каждому указателю. Количество ссылок равно сумме весов. Указатель ``x`` может быть скопирован как указатель ``x'`` без обновления подсчета ссылок путем разделения исходного веса между ``x`` и ``x'``. Если вес ``x`` слишком мал для разделения, то сначала добавь константу W к количеству ссылок и весу ``x``.

source: References
ru_ru: Ссылки

source: D. Bacon and V.T. Rajan, "Concurrent Cycle Collection in Reference Counted Systems" in Proc. European Conf. on Object-Oriented Programming (June 2001). Describes a garbage collector based on reference counting that does collect cycles.
ru_ru: D. Bacon и V.T. Rajan, "Concurrent Cycle Collection in Reference Counted Systems" in Proc. European Conf. on Object-Oriented Programming (июнь 2001). Описывается сборщик мусора, основанный на подсчёте ссылок, который действительно собирает циклы.

source: M. Michael, "Hazard Pointers: Safe Memory Reclamation for Lock-Free Objects" in IEEE Transactions on Parallel and Distributed Systems (June 2004). Describes the "hazard pointer" technique.
ru_ru: M. Michael, "Hazard Pointers: Safe Memory Reclamation for Lock-Free Objects" in IEEE Transactions on Parallel and Distributed Systems (June 2004). Описывает технику "опасного указателя".

source: M. Herlihy, V. Luchangco, and M. Moir, "The Repeat Offender Problem: A Mechanism for Supporting Dynamic-Sized, Lock-Free Data Structures" in Proceedings of the 16th International Symposium on Distributed Computing (Oct. 2002). Describes the "pass the buck" technique.
ru_ru: M. Herlihy, V. Luchangco, and M. Moir, "The Repeat Offender Problem: A Mechanism for Supporting Dynamic-Sized, Lock-Free Data Structures" в Proceedings of the 16th International Symposium on Distributed Computing (Oct. 2002). Описывается техника "передавать долг".
