Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/design_patterns/Wavefront.po
Languages: ru_ru

source: Wavefront
ru_ru: Фронт волны

source: Problem
ru_ru: Проблема

source: Perform computations on items in a data set, where the computation on an item uses results from computations on predecessor items.
ru_ru: Выполняй вычисления над элементами в наборе данных, где вычисления над элементом используют результаты вычислений над предшествующими элементами.

source: Context
ru_ru: Контекст

source: The dependences between computations form an acyclic graph.
ru_ru: Зависимости между вычислениями образуют ациклический граф.

source: Forces
ru_ru: Силы

source: Dependence constraints between items form an acyclic graph.
ru_ru: Ограничения зависимости между элементами образуют ациклический граф.

source: The number of immediate predecessors in the graph is known in advance, or can be determined some time before the last predecessor completes.
ru_ru: Количество непосредственных предшественников в графе известно заранее или может быть определено за некоторое время до завершения последнего предшественника.

source: Solution
ru_ru: Решение

source: The solution is a parallel variant of topological sorting, using ``oneapi::tbb::parallel_for_each`` to process items. Associate an atomic counter with each item. Initialize each counter to the number of predecessors. Invoke ``oneapi::tbb::parallel_for_each`` to process the items that have no predessors (have counts of zero). After an item is processed, decrement the counters of its successors. If a successor's counter reaches zero, add that successor to the ``oneapi::tbb::parallel_for_each`` via a "feeder".
ru_ru: Решением является параллельный вариант топологической сортировки, использующий ``oneapi::tbb::parallel_for_each`` для обработки элементов. Свяжи атомарный счетчик с каждым элементом. Инициализируй каждый счётчик количеством предшественников. Вызови команду ``oneapi::tbb::parallel_for_each`` для обработки элементов, у которых нет предшественников (счетчики равны нулю). После того как элемент обработан, уменьши счетчики его преемников. Если счётчик преемника достигает нуля, добавь этого преемника в ``oneapi::tbb::parallel_for_each`` через "фидер".

source: If the number of predecessors for an item cannot be determined in advance, treat the information "know number of predecessors" as an additional predecessor. When the number of predecessors becomes known, treat this conceptual predecessor as completed.
ru_ru: Если количество предшественников для элемента не может быть определено заранее, рассматривай информацию "известно количество предшественников" как дополнительного предшественника. Когда количество предшественников станет известно, рассматривай этого концептуального предшественника как завершенного.

source: If the overhead of counting individual items is excessive, aggregate items into blocks, and do the wavefront over the blocks.
ru_ru: Если накладные расходы на подсчет отдельных элементов чрезмерны, объединяй элементы в блоки и проводи волновой фронт по блокам.

source: Example
ru_ru: Пример

source: Below is a serial kernel for the longest common subsequence algorithm. The parameters are strings ``x`` and ``y`` with respective lengths ``xlen`` and ``ylen``.
ru_ru: Ниже приведено последовательное ядро для алгоритма самой длинной общей подпоследовательности. Параметрами являются строки ``x`` и ``y`` с соответствующими длинами ``xlen`` и ``ylen``.

source: The kernel sets ``F[i][j]`` to the length of the longest common subsequence shared by ``x[0..i-1]`` and ``y[0..j-1]``. It assumes that F[0][0..ylen] and ``F[0..xlen][0]`` have already been initialized to zero.
ru_ru: Ядро устанавливает ``F[i][j]`` в длину самой длинной общей подпоследовательности, которую разделяют ``x[0..i-1]`` и ``y[0..j-1]``. При этом предполагается, что F[0][0..ylen] и ``F[0..xlen][0]`` уже инициализированы нулем.

source: The following figure shows the data dependences for calculating ``F[i][j]``.
ru_ru: На следующем рисунке показаны зависимости данных для вычисления ``F[i][j]``.

source: Data dependences for longest common substring calculation. |image0|
ru_ru: Зависимости данных для вычисления самой длинной общей подстроки. |image0|

source: The following figure shows the gray diagonal dependence is the transitive closure of other dependencies. Thus for parallelization purposes it is a redundant dependence that can be ignored.
ru_ru: На следующем рисунке видно, что серая диагональная зависимость является транзитивным замыканием других зависимостей. Таким образом, для целей распараллеливания это избыточная зависимость, которую можно игнорировать.

source: Diagonal dependence is redundant. |image1|
ru_ru: Диагональная зависимость является избыточной. |image1|

source: It is generally good to remove redundant dependences from consideration, because the atomic counting incurs a cost for each dependence considered.
ru_ru: Как правило, хорошо убирать из рассмотрения лишние зависимости, потому что атомарный подсчет несет затраты на каждую рассматриваемую зависимость.

source: Another consideration is grain size. Scheduling each ``F[i][j]`` element calculation separately is prohibitively expensive. A good solution is to aggregate the elements into contiguous blocks, and process the contents of a block serially. The blocks have the same dependence pattern, but at a block scale. Hence scheduling overheads can be amortized over blocks.
ru_ru: Еще одно соображение - размер зерна. Планировать вычисление каждого элемента ``F[i][j]`` отдельно - непомерно дорого. Хорошее решение - объединить элементы в смежные блоки и обрабатывать содержимое блока последовательно. Блоки имеют одинаковую схему зависимости, но в масштабе блока. Следовательно, накладные расходы на планирование могут быть амортизированы по блокам.

source: The parallel code follows. Each block consists of ``N×N`` elements. Each block has an associated atomic counter. Array ``Count`` organizes these counters for easy lookup. The code initializes the counters and then rolls a wavefront using ``parallel_for_each``, starting with the block at the origin since it has no predecessors.
ru_ru: Далее следует параллельный код. Каждый блок состоит из ``N×N`` элементов. Каждый блок имеет связанный с ним атомарный счетчик. Массив ``Count`` организует эти счетчики для удобства поиска. Код инициализирует счётчики, а затем разворачивает волновой фронт с помощью ``parallel_for_each``, начиная с блока в начале координат, поскольку у него нет предшественников.

source: References
ru_ru: Ссылки

source: Eun-Gyu Kim and Mark Snir, "Wavefront Pattern", http://snir.cs.illinois.edu/patterns/wavefront.pdf
ru_ru: Ын-Гю Ким и Марк Снир, "Узор волнового фронта", http://snir.cs.illinois.edu/patterns/wavefront.pdf
