Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/scalable_memory_pools/memory_pool_allocator_cls.po
Languages: ru_ru

source: To enable this feature, set the ``TBB_PREVIEW_MEMORY_POOL`` macro to 1.
ru_ru: Чтобы включить эту функцию, установи макрос ``TBB_PREVIEW_MEMORY_POOL`` в 1.

source: A class template that provides a memory pool with a C++ allocator interface.
ru_ru: Шаблон класса, который предоставляет пул памяти с интерфейсом аллокатора C++.

source: Description
ru_ru: Описание

source: ``memory_pool_allocator`` meets the allocator requirements from the [allocator.requirements] ISO C++ Standard section It also provides a constructor to allocate and deallocate memory. This constructor is linked with an instance of either the ``memory_pool`` or the ``fixed_pool`` class. The class is mainly intended for enabling memory pools within STL containers.
ru_ru: ``memory_pool_allocator`` соответствует требованиям к аллокатору из раздела [allocator.requirements] стандарта ISO C++ Он также предоставляет конструктор для выделения и деаллокации памяти. Этот конструктор связан с экземпляром либо класса ``memory_pool``, либо класса ``fixed_pool``. Этот класс в основном предназначен для включения пулов памяти внутри контейнеров STL.

source: Header
ru_ru: Заголовок

source: Synopsis
ru_ru: Описание

source: Member Functions
ru_ru: Функции-члены

source: **Effects**: Constructs a memory pool allocator serviced by ``memory_pool`` instance pool.
ru_ru: **Эффекты**: Конструирует распределитель пула памяти, обслуживаемый пулом экземпляров ``memory_pool``.

source: **Effects**: Constructs a memory pool allocator serviced by ``fixed_pool`` instance pool.
ru_ru: **Эффекты**: Конструирует распределитель пула памяти, обслуживаемый пулом экземпляров ``fixed_pool``.

source: Examples
ru_ru: Примеры

source: The code below provides a simple example of container construction with the use of a memory pool.
ru_ru: В приведенном ниже коде представлен простой пример построения контейнера с использованием пула памяти.
