Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Advanced_Topic_Other_Kinds_of_Iteration_Spaces.po
Languages: ru_ru

source: Advanced Topic: Other Kinds of Iteration Spaces
ru_ru: Расширенная тема: Другие виды итерационных пространств

source: The examples so far have used the class ``blocked_range<T>`` to specify ranges. This class is useful in many situations, but it does not fit every situation. You can use |full_name| to define your own iteration space objects. The object must specify how it can be split into subspaces by providing a basic splitting constructor, an optional proportional splitting constructor (accompanied with a trait value that enables its usage), and two predicate methods. If your class is called ``R``, the methods and constructors should be as follows:
ru_ru: В примерах до сих пор для задания диапазонов использовался класс ``blocked_range<T>``. Этот класс полезен во многих ситуациях, но он не подходит для всех ситуаций. Вы можете использовать |full_name| для определения собственных объектов пространства итераций. Объект должен указать, как он может быть разбит на подпространства, предоставив конструктор базового разбиения, необязательный конструктор пропорционального разбиения (сопровождаемый значением признака, позволяющим его использовать) и два предикатных метода. Если ваш класс называется ``R``, то методы и конструкторы должны быть следующими:

source: class R { // True if range is empty bool empty() const; // True if range can be split into non-empty subranges bool is_divisible() const; // Splits r into subranges r and *this R( R& r, split ); // Splits r into subranges r and *this in proportion p R( R& r, proportional_split p ); // Allows usage of proportional splitting constructor static const bool is_splittable_in_proportion = true; ... };
ru_ru: class R { // Истина, если диапазон пуст bool empty() const; // Истинно, если диапазон может быть разбит на непустые поддиапазоны bool is_divisible() const; // Разделяет r на подмножества r и *this R( R& r, split ); // Делит r на подмножества r и *this в пропорции p R( R& r, proportional_split p ); // Позволяет использовать конструктор пропорционального разделения static const bool is_splittable_in_proportion = true; ... };

source: The method ``empty`` should return true if the range is empty. The method ``is_divisible`` should return true if the range can be split into two non-empty subspaces, and such a split is worth the overhead. The basic splitting constructor should take two arguments:
ru_ru: Метод ``empty`` должен возвращать true, если диапазон пуст. Метод ``is_divisible`` должен возвращать true, если диапазон может быть разбит на два непустых подпространства, и такое разбиение стоит накладных расходов. Основной конструктор разбиения должен принимать два аргумента:

source: The first of type ``R``
ru_ru: Первый из типов ``R``

source: The second of type oneapi::tbb::split
ru_ru: Второй из типов oneapi::tbb::split

source: The second argument is not used; it serves only to distinguish the constructor from an ordinary copy constructor. The basic splitting constructor should attempt to split ``r`` roughly into two halves, and update ``r`` to be the first half, and set the constructed object as the second half.
ru_ru: Второй аргумент не используется; он служит только для того, чтобы отличить конструктор от обычного конструктора копирования. Основной конструктор расщепления должен попытаться разделить ``r`` примерно на две половины, обновить ``r`` как первую половину, и установить построенный объект как вторую половину.

source: Unlike the basic splitting constructor, the proportional splitting constructor is optional and takes the second argument of type ``oneapi::tbb::proportional_split``. The type has methods ``left`` and ``right`` that return the values of the proportion. These values should be used to split ``r`` accordingly, so that the updated ``r`` corresponds to the left part of the proportion, and the constructed object corresponds to the right part. The proportional splitting constructor will be used only if the static constant ``is_splittable_in_proportion`` is defined in the class and assigned the value of ``true``.
ru_ru: В отличие от конструктора базового разбиения, конструктор пропорционального разбиения является необязательным и принимает второй аргумент типа ``oneapi::tbb::proportional_split``. Этот тип имеет методы ``left`` и ``right``, которые возвращают значения пропорции. Эти значения должны быть использованы для разделения ``r`` соответствующим образом, так чтобы обновленный ``r`` соответствовал левой части пропорции, а построенный объект - правой. Конструктор пропорционального деления будет использоваться только в том случае, если в классе определена статическая константа ``is_splittable_in_proportion`` и ей присвоено значение ``true``.

source: Both splitting constructors should guarantee that the updated ``r`` part and the constructed object are not empty. The parallel algorithm templates call the splitting constructors on ``r`` only if ``r.is_divisible`` is true.
ru_ru: Оба конструктора расщепления должны гарантировать, что обновленная часть ``r`` и построенный объект не пусты. Шаблоны параллельного алгоритма вызывают конструкторы разбиения на ``r`` только если ``r.is_divisible`` истинно.

source: The iteration space does not have to be linear. Look at ``oneapi/tbb/blocked_range2d.h`` for an example of a range that is two-dimensional. Its splitting constructor attempts to split the range along its longest axis. When used with ``parallel_for``, it causes the loop to be "recursively blocked" in a way that improves cache usage. This nice cache behavior means that using ``parallel_for`` over a ``blocked_range2d<T>`` can make a loop run faster than the sequential equivalent, even on a single processor.
ru_ru: Пространство итераций не обязательно должно быть линейным. Посмотрите на ``oneapi/tbb/blocked_range2d.h`` для примера двумерного диапазона. Его конструктор разбиения пытается разделить диапазон вдоль его самой длинной оси. При использовании с ``parallel_for`` он заставляет цикл "рекурсивно блокироваться" таким образом, что улучшается использование кэша. Это хорошее поведение кэша означает, что использование ``parallel_for`` над ``blocked_range2d<T>`` может заставить цикл работать быстрее, чем последовательный эквивалент, даже на одном процессоре.
