Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Cancellation_and_Nested_Parallelism.po
Languages: ru_ru

source: Cancellation and Nested Parallelism
ru_ru: Отмена и вложенный параллелизм

source: The discussion so far was simplified by assuming non-nested parallelism and skipping details of ``task_group_context``. This topic explains both.
ru_ru: До сих пор обсуждение было упрощено за счет допущения не вложенного параллелизма и пропуска деталей ``task_group_context``. Эта тема объясняет и то, и другое.

source: An |full_name| algorithm executes by creating ``task`` objects that execute the snippets of code that you supply to the algorithm template. By default, these ``task`` objects are associated with a ``task_group_context`` created by the algorithm. Nested oneTBB algorithms create a tree of these ``task_group_context`` objects. Cancelling a ``task_group_context`` cancels all of its child ``task_group_context`` objects, and transitively all its descendants. Hence an algorithm and all algorithms it called can be cancelled with a single request.
ru_ru: Алгоритм с именем |full_name| выполняется путем создания объектов ``task``, которые выполняют фрагменты кода, предоставленные вами в шаблоне алгоритма. По умолчанию эти объекты ``task`` связаны с ``task_group_context``, созданной алгоритмом. Вложенные алгоритмы oneTBB создают дерево этих объектов ``task_group_context``. Отмена ``task_group_context`` отменяет все его дочерние ``task_group_context`` и транзитивно все его потомки. Таким образом, алгоритм и все вызванные им алгоритмы могут быть отменены одним запросом.

source: Exceptions propagate upwards. Cancellation propagates downwards. The opposition interplays to cleanly stop a nested computation when an exception occurs. For example, consider the tree in the following figure. Imagine that each node represents an algorithm and its ``task_group_context``.
ru_ru: Исключения распространяются вверх. Отмена распространяется вниз. Противодействие взаимодействует, чтобы чисто остановить вложенные вычисления при возникновении исключения. Для примера рассмотрим дерево на следующем рисунке. Представь, что каждый узел представляет собой алгоритм и его ``task_group_context``.

source: Tree of task_group_context |image0|
ru_ru: Дерево task_group_context |image0|

source: Suppose that the algorithm in C throws an exception and no node catches the exception. oneTBB propagates the exception upwards, cancelling related subtrees downwards, as follows:
ru_ru: Предположим, что алгоритм в C выбрасывает исключение, и ни один узел не ловит это исключение. oneTBB распространяет исключение вверх, отменяя связанные поддеревья вниз, следующим образом:

source: Handle exception in C:
ru_ru: Обработка исключения в C:

source: Capture exception in C.
ru_ru: Перехват исключения в С.

source: Cancel tasks in C.
ru_ru: Отмена задачи в C.

source: Throw exception from C to B.
ru_ru: Переброска исключения из C в B.

source: Handle exception in B:
ru_ru: Обработка исключения в B:

source: Capture exception in B.
ru_ru: Перехват исключения в B.

source: Cancel tasks in B and, by downwards propagation, in D.
ru_ru: Отмена задачи в B и, путем нисходящего распространения, в D.

source: Throw an exception out of B to A.
ru_ru: Переброска исключения из B в A.

source: Handle exception in A:
ru_ru: Обработка исключения в A:

source: Capture exception in A.
ru_ru: Перехват исключения в A.

source: Cancel tasks in A and, by downwards propagation, in E, F, and G.
ru_ru: Отмена задачи в A и, путем нисходящего распространения, в E, F и G.

source: Throw an exception upwards out of A.
ru_ru: Переброска исключения из A вверх.

source: If your code catches the exception at any level, then oneTBB does not propagate it any further. For example, an exception that does not escape outside the body of a ``parallel_for`` does not cause cancellation of other iterations.
ru_ru: Если твой код поймал исключение на любом уровне, то oneTBB не распространяет его дальше. Например, исключение, которое не выходит за пределы тела ``parallel_for``, не приводит к отмене других итераций.

source: To prevent downwards propagation of cancellation into an algorithm, construct an 'isolated' ``task_group_context`` on the stack and pass it to the algorithm explicitly. The example uses C++11 lambda expressions for brevity.
ru_ru: Чтобы предотвратить нисходящее распространение отмены в алгоритм, создай "изолированный" ``task_group_context`` на стеке и передай его алгоритму в явном виде. В примере для краткости используются лямбда-выражения C++11.

source: The example performs two parallel loops: an outer loop over ``i`` and inner loop over ``j``. The creation of the isolated ``task_group_context`` ``root`` protects the inner loop from downwards propagation of cancellation from the ``i`` loop. When the exception propagates to the outer loop, any pending ``outer`` iterations are cancelled, but not inner iterations for an outer iteration that started. Hence when the program completes, each row of ``Data`` may be different, depending upon whether its iteration ``i`` ran at all, but within a row, the elements will be homogeneously ``false`` or ``true``, not a mixture.
ru_ru: В примере выполняются два параллельных цикла: внешний цикл над ``i`` и внутренний цикл над ``j``. Создание изолированного ``task_group_context`` ``root`` защищает внутренний цикл от распространения вниз отмены из цикла ``i``. Когда исключение распространяется на внешний цикл, все ожидающие ``outer`` итерации отменяются, но не внутренние итерации для начавшейся внешней итерации. Следовательно, когда программа завершается, каждый ряд ``Data`` может быть разным, в зависимости от того, выполнялась ли его итерация ``i`` вообще, но внутри ряда элементы будут однородно ``false`` или ``true``, а не смесью.

source: Removing the blue text would permit cancellation to propagate down into the inner loop. In that case, a row of ``Data`` might end up with both ``true`` and ``false`` values.
ru_ru: Удаление синего текста позволит отмене распространиться вниз во внутренний цикл. В этом случае в строке ``Data`` могут оказаться значения ``true`` и ``false``.
