Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Cook_Until_Done_parallel_do.po
Languages: ru_ru

source: Cook Until Done: parallel_for_each
ru_ru: Готовить до готовности: parallel_for_each

source: For some loops, the end of the iteration space is not known in advance, or the loop body may add more iterations to do before the loop exits. You can deal with both situations using the template class ``oneapi::tbb::parallel_for_each``.
ru_ru: Для некоторых циклов конец пространства итераций не известен заранее, или тело цикла может добавить больше итераций, которые нужно сделать до выхода из цикла. С обеими ситуациями можно справиться с помощью шаблонного класса ``oneapi::tbb::parallel_for_each``.

source: A linked list is an example of an iteration space that is not known in advance. In parallel programming, it is usually better to use dynamic arrays instead of linked lists, because accessing items in a linked list is inherently serial. But if you are limited to linked lists, the items can be safely processed in parallel, and processing each item takes at least a few thousand instructions, you can use ``parallel_for_each`` to gain some parallelism.
ru_ru: Связанный список - это пример итерационного пространства, которое не известно заранее. В параллельном программировании обычно лучше использовать динамические массивы, а не связанные списки, потому что доступ к элементам в связанном списке по своей природе является последовательным. Но если вы ограничены связанными списками, элементы можно безопасно обрабатывать параллельно, а обработка каждого элемента занимает по крайней мере несколько тысяч инструкций, вы можете использовать ``parallel_for_each`` для достижения некоторого параллелизма.

source: For example, consider the following serial code:
ru_ru: Например, рассмотрим следующий последовательный код:

source: If ``Foo`` takes at least a few thousand instructions to run, you can get parallel speedup by converting the loop to use ``parallel_for_each``. To do so, define an object with a ``const`` qualified ``operator()``. This is similar to a C++ function object from the C++ standard header ``<functional>``, except that ``operator()`` must be ``const``.
ru_ru: Если цикл ``Foo`` занимает хотя бы несколько тысяч инструкций, вы можете получить параллельное ускорение, преобразовав цикл для использования ``parallel_for_each``. Для этого определите объект с оператором ``operator()`` с квалификатором ``const``. Это похоже на функтор из стандартного заголовка C++ ``<functional>``, за исключением того, что ``operator()`` должен быть ``const``.

source: The parallel form of ``SerialApplyFooToList`` is as follows:
ru_ru: Параллельная форма ``SerialApplyFooToList`` выглядит следующим образом:

source: An invocation of ``parallel_for_each`` never causes two threads to act on an input iterator concurrently. Thus typical definitions of input iterators for sequential programs work correctly. This convenience makes ``parallel_for_each`` unscalable, because the fetching of work is serial. But in many situations, you still get useful speedup over doing things sequentially.
ru_ru: Вызов ``parallel_for_each`` никогда не приводит к одновременному действию двух потоков на входной итератор. Таким образом, типичные определения входных итераторов для последовательных программ работают корректно. Это удобство делает ``parallel_for_each`` немасштабируемым, поскольку получение работы происходит последовательно. Но во многих ситуациях вы все равно получите полезное ускорение по сравнению с последовательным выполнением задач.

source: There are two ways that ``parallel_for_each`` can acquire work scalably.
ru_ru: Существует два способа, с помощью которых ``parallel_for_each`` может получить масштабируемую работу.

source: The iterators can be random-access iterators.
ru_ru: Итераторы могут быть итераторами со случайным доступом.

source: The body argument to ``parallel_for_each``, if it takes a second argument *feeder* of type ``parallel_for_each<Item>&``, can add more work by calling ``feeder.add(item)``. For example, suppose processing a node in a tree is a prerequisite to processing its descendants. With ``parallel_for_each``, after processing a node, you could use ``feeder.add`` to add the descendant nodes. The instance of ``parallel_for_each`` does not terminate until all items have been processed.
ru_ru: Аргумент body в ``parallel_for_each``, если он принимает второй аргумент *feeder* типа ``parallel_for_each<Item>&``, может добавить больше работы, вызвав ``feeder.add(item)``. Например, предположим, что обработка узла в дереве является предпосылкой для обработки его потомков. С помощью ``parallel_for_each`` после обработки узла можно использовать ``feeder.add`` для добавления узлов-потомков. Экземпляр ``parallel_for_each`` не завершается, пока не будут обработаны все элементы.
