Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/create_token_based_system.po
Languages: ru_ru

source: Create a Token-Based System
ru_ru: Создание системы на основе токенов

source: A more flexible solution to limit the number of messages in a flow graph is to use tokens. In a token-based system, a limited number of tokens are available in the graph and a message will not be allowed to enter the graph until it can be paired with an available token. When a message is retired from the graph, its token is released, and can be paired with a new message that will then be allowed to enter.
ru_ru: Более гибким решением для ограничения количества сообщений в графе потока является использование токенов. В системе, основанной на маркерах, в графе доступно ограниченное количество маркеров, и сообщение не будет допущено в граф, пока оно не будет сопряжено с доступным маркером. Когда сообщение выбывает из графа, его токен освобождается и может быть сопряжен с новым сообщением, которое затем будет допущено к входу.

source: The ``oneapi::tbb::parallel_pipeline`` algorithm relies on a token-based system. In the flow graph interface, there is no explicit support for tokens, but ``join_node``s can be used to create an analogous system. A ``join_node`` has two template arguments, the tuple that describes the types of its inputs and a buffer policy:
ru_ru: Алгоритм ``oneapi::tbb::parallel_pipeline`` опирается на систему, основанную на токенах. В интерфейсе графа потока нет явной поддержки токенов, но ``join_node`` можно использовать для создания аналогичной системы. Узел ``join_node`` имеет два аргумента шаблона - кортеж, описывающий типы его входов, и буферную политику:

source: The buffer policy can be one of the following:
ru_ru: Буферная политика может быть одной из следующих:

source: ``queueing``. This type of policy causes inputs to be matched first-in-first-out; that is, the inputs are joined together to form a tuple in the order they are received.
ru_ru: ``queueing``. Этот тип политики приводит к тому, что входы сопоставляются в порядке поступления; то есть входы объединяются в кортеж в порядке их поступления.

source: ``tag_matching``. This type of policy joins inputs together that have matching tags.
ru_ru: ``tag_matching``. Этот тип политики соединяет вместе входы, у которых совпадают теги.

source: ``reserving``. This type of policy causes the ``join_node`` to do no internally buffering, but instead to consume inputs only when it can first reserve an input on each port from an upstream source. If it can reserve an input at each port, it gets those inputs and joins those together to form an output tuple.
ru_ru: ``reserving``. Этот тип политики заставляет узел ``join_node`` не делать никакой внутренней буферизации, а вместо этого потреблять входы только тогда, когда он может сначала зарезервировать вход на каждом порту от источника восходящего потока. Если он может зарезервировать вход на каждом порту, он получает эти входы и соединяет их вместе, чтобы сформировать выходной кортеж.

source: A token-based system can be created by using reserving join_nodes.
ru_ru: Систему на основе токенов можно создать с помощью резервирования join_nodes.

source: In the example below, there is an ``input_node`` that generates ``M`` big objects and a ``buffer_node`` that is pre-filled with three tokens. The ``token_t`` can be anything, for example it could be ``typedef int token_t;``. The ``input_node`` and ``buffer_node`` are connected to a reserving ``join_node``. The ``input_node`` will only generate an input when one is pulled from it by the reserving ``join_node``, and the reserving ``join_node`` will only pull the input from the ``input_node`` when it knows there is also an item to pull from the ``buffer_node``.
ru_ru: В примере ниже есть узел ``input_node``, который генерирует большие объекты ``M``, и узел ``buffer_node``, который предварительно заполнен тремя токенами. ``token_t`` может быть чем угодно, например, это может быть ``typedef int token_t;``. Узлы ``input_node`` и ``buffer_node`` соединены с резервирующим узлом ``join_node``. Узел ``input_node`` будет генерировать вход только тогда, когда он будет извлечен из него резервирующим узлом ``join_node``, а резервирующий узел ``join_node`` будет извлекать вход из узла ``input_node`` только тогда, когда он знает, что есть элемент для извлечения из узла ``buffer_node``.

source: In the above code, you can see that the ``function_node`` returns the token back to the ``buffer_node``. This cycle in the flow graph allows the token to be recycled and paired with another input from the ``input_node``. So like in the previous sections, there will be at most four big objects in the graph. There could be three big objects in the ``function_node`` and one buffered in the ``input_node``, awaiting a token to be paired with.
ru_ru: В приведенном выше коде ты видишь, что узел ``function_node`` возвращает токен обратно в узел ``buffer_node``. Этот цикл в графе потока позволяет повторно использовать токен и сопрягать его с другим входом из ``input_node``. Итак, как и в предыдущих разделах, в графе будет максимум четыре больших объекта. В ``function_node`` может быть три больших объекта, и один буферизованный в ``input_node``, ожидающий токена для сопряжения.

source: Since there is no specific ``token_t`` defined for the flow graph, you can use any type for a token, including objects or pointers to arrays. Therefore, unlike in the example above, the ``token_t`` doesn't need to be a dummy type; it could for example be a buffer or other object that is essential to the computation. We could, for example, modify the example above to use the big objects themselves as the tokens, removing the need to repeatedly allocate and deallocate them, and essentially create a free list of big objects using a cycle back to the ``buffer_node``.
ru_ru: Поскольку для графа потока не определен конкретный ``token_t``, ты можешь использовать для маркера любой тип, включая объекты или указатели на массивы. Поэтому, в отличие от примера выше, ``token_t`` не обязательно должен быть фиктивным типом; это может быть, например, буфер или другой объект, который необходим для вычислений. Мы можем, например, модифицировать приведенный выше пример, чтобы использовать сами большие объекты в качестве маркеров, устраняя необходимость многократно выделять и деаллоцировать их, и, по сути, создать свободный список больших объектов, используя цикл возврата к ``buffer_node``.

source: Also, in our example above, the ``buffer_node`` was prefilled by a fixed number of explicit calls to ``try_put``, but there are other options. For example, an ``input_node`` could be attached to the input of the ``buffer_node``, and it could generate the tokens. In addition, our ``function_node`` could be replaced by a ``multifunction_node`` that can optionally put 0 or more outputs to each of its output ports. Using a ``multifunction_node``, you can choose to recycle or not recycle a token, or even generate more tokens, thereby increasing or decreasing the allowed concurrency in the graph.
ru_ru: Кроме того, в нашем примере выше ``buffer_node`` был заполнен фиксированным количеством явных вызовов ``try_put``, но есть и другие варианты. Например, узел ``input_node`` может быть присоединен к входу узла ``buffer_node``, и он может генерировать токены. Кроме того, наш ``function_node`` можно заменить на ``multifunction_node``, который может по выбору подключать 0 или более выходов к каждому из своих выходных портов. Используя ``multifunction_node``, ты можешь выбрать, перерабатывать или не перерабатывать токен, или даже генерировать больше токенов, тем самым увеличивая или уменьшая допустимый параллелизм в графе.

source: A token based system is therefore very flexible. You are free to declare the token to be of any type and to inject or remove tokens from the system as it is executing, thereby having dynamic control of the allowed concurrency in the system. Since you can pair the token with an input at the source, this approach enables you to limit resource consumption across the entire graph.
ru_ru: Поэтому система, основанная на токенах, является очень гибкой. Ты волен объявлять маркер любого типа и вводить или удалять маркеры из системы по мере её выполнения, тем самым динамически контролируя допустимый параллелизм в системе. Поскольку ты можешь сопрягать токен с входом в источнике, такой подход позволяет тебе ограничить потребление ресурсов по всему графу.
