Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Data_Flow_Graph.po
Languages: ru_ru

source: Data Flow Graph
ru_ru: Граф потока данных

source: In a data flow graph, nodes are computations that send and receive data messages. Some nodes may only send messages, others may only receive messages, and others may send messages in response to messages that they receive.
ru_ru: В графе потока данных узлы - это вычисления, которые отправляют и получают сообщения с данными. Некоторые узлы могут только отправлять сообщения, другие - только получать, а третьи - отправлять сообщения в ответ на сообщения, которые они получают.

source: In the following data flow graph, the left-most node generates the integer values from 1 to 10 and passes them to two successor nodes. One of the successors squares each value it receives and passes the result downstream. The second successor cubes each value it receives and passes the result downstream. The right-most node receives values from both of the middle nodes. As it receives each value, it adds it to a running sum of values. When the application is run to completion, the value of sum will be equal to the sum of the sequence of squares and cubes from 1 to 10.
ru_ru: В следующем графе потока данных крайний левый узел генерирует целочисленные значения от 1 до 10 и передает их двум узлам-преемникам. Один из преемников возводит в квадрат каждое полученное значение и передает результат вниз по потоку. Второй преемник возводит в куб каждое полученное значение и передает результат вниз по потоку. Самый правый узел получает значения от обоих средних узлов. Получая каждое значение, он добавляет его к текущей сумме значений. Когда приложение будет выполнено до конца, значение суммы будет равно сумме последовательности квадратов и кубов от 1 до 10.

source: Simple Data Flow Graph
ru_ru: Простой граф потока данных

source: The following code snippet shows an implementation of the **Simple Data Flow Graph** shown above:
ru_ru: Следующий фрагмент кода показывает реализацию **Простого графа потока данных**, показанного выше:

source: In the implementation above, the following function_nodes are created:
ru_ru: В реализации, описанной выше, создаются следующие функциональные узлы:

source: one to square values
ru_ru: возведение в квадрат

source: one to cube values
ru_ru: возведение в куб

source: one to add values to the global sum
ru_ru: накопление глобальной суммы

source: Since the squarer and cuber nodes are side-effect free, they are created with an unlimited concurrency. The summer node updates the sum through a reference to a global variable and therefore is not safe to execute in parallel. It is therefore created with a concurrency limit of 1. The node F from **Simple Data Flow Graph** above is implemented as a loop that puts messages to both the squarer and cuber node.
ru_ru: Поскольку узлы squarer и cuber не имеют побочных эффектов, они создаются с неограниченным параллелизмом. Узел summer обновляет сумму через ссылку на глобальную переменную и поэтому небезопасен для параллельного выполнения. Поэтому он создается с ограничением параллельности в 1. Узел F **простого графа потока** выше реализован как цикл, который помещает сообщения в оба узла - squarer и cuber.

source: A slight improvement over the first implementation is to introduce an additional node type, a ``broadcast_node``. A ``broadcast_node`` broadcasts any message it receives to all of its successors.
ru_ru: Небольшим улучшением по сравнению с первой реализацией является введение дополнительного типа узла, ``broadcast_node``. Узел ``broadcast_node`` транслирует любое полученное им сообщение всем своим преемникам.

source: This enables replacing the two ``try_put``'s in the loop with a single ``try_put``:
ru_ru: Это позволяет заменить два ``try_put`` в цикле на один ``try_put``:

source: An even better option, which will make the implementation even more like the **Simple Data Flow Graph** above, is to introduce an ``input_node``. An ``input_node``, as the name implies only sends messages and does not receive messages. Its constructor takes two arguments:
ru_ru: Еще лучший вариант, который сделает реализацию еще более похожей на **Simple Data Flow Graph** выше, - это ввести ``input_node``. Узел ``input_node``, как следует из названия, только посылает сообщения и не принимает их. Его конструктор принимает два аргумента:

source: The body is a function object, or lambda expression, that contains a function operator:
ru_ru: Тело - это объект функции, или лямбда-выражение, которое содержит оператор функции:

source: You can replace the loop in the example with an ``input_node``
ru_ru: Ты можешь заменить цикл в примере на ``input_node``

source: The runtime library will repeatedly invoke the function operator in ``src_body`` until ``fc.stop()`` is invoked inside the body. You therefore need to create body that will act like the body of the loop in the **Simple Data Flow Graph** above. The final implementation after all of these changes is shown below:
ru_ru: Библиотека времени выполнения будет неоднократно вызывать оператор функции в ``src_body`` до тех пор, пока ``sfc.stop()`` не будет вызван внутри тела. Поэтому тебе нужно создать тело, которое будет действовать подобно телу цикла в **Простой схеме потока данных** выше. Окончательная реализация после всех этих изменений показана ниже:

source: This final implementation has all of the nodes and edges from the **Simple Data Flow Graph** above. In this simple example, there is not much advantage in using an ``input_node`` over an explicit loop. But, because an ``input_node`` is able to react to the behavior of downstream nodes, it can limit memory use in more complex graphs. For more information, see:ref:`create_token_based_system` .
ru_ru: Эта окончательная реализация имеет все узлы и ребра из **Простого графика потока данных**, приведенного выше. В этом простом примере нет большого преимущества в использовании ``input_node`` по сравнению с явным циклом. Но, поскольку ``input_node`` способен реагировать на поведение нижележащих узлов, он может ограничить использование памяти в более сложных графах. Для получения дополнительной информации смотри :ref:`create_token_based_system`.
