Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Debug_Versus_Release_Libraries.po
Languages: ru_ru

source: Debug Versus Release Libraries
ru_ru: Отладочные библиотеки против релизных библиотек

source: The following table details the |full_name| dynamic shared libraries that come in debug and release versions.
ru_ru: В следующей таблице подробно описаны динамические разделяемые библиотеки |full_name|, которые поставляются в отладочной и релизной версиях.

source: Library
ru_ru: Библиотека

source: Description
ru_ru: Описание

source: When to Use
ru_ru: Когда использовать

source: These versions have extensive internal checking for correct use of the library.
ru_ru: Эти версии имеют обширную внутреннюю проверку на правильность использования библиотеки.

source: Use with code that is compiled with the macro ``TBB_USE_DEBUG`` set to 1.
ru_ru: Используй с кодом, который скомпилирован с макросом ``TBB_USE_DEBUG``, установленным в 1.

source: These versions deliver top performance. They eliminate most checking for correct use of the library.
ru_ru: Эти версии обеспечивают высочайшую производительность. Они устраняют большинство проверок правильности использования библиотеки.

source: Use with code compiled with ``TBB_USE_DEBUG`` undefined or set to zero.
ru_ru: Используй с кодом, скомпилированным с ``TBB_USE_DEBUG`` неопределенным или установленным в ноль.

source: Test your programs with the debug versions of the libraries first, to assure that you are using the library correctly. With the release versions, incorrect usage may result in unpredictable program behavior.
ru_ru: Сначала протестируй свои программы с отладочными версиями библиотек, чтобы убедиться, что ты используешь библиотеку правильно. В релизных версиях неправильное использование может привести к непредсказуемому поведению программы.

source: oneTBB supports Intel® Inspector, Intel® VTune™ Profiler and Intel® Advisor. Full support of these tools requires compiling with macro ``TBB_USE_PROFILING_TOOLS=1``. That symbol defaults to 1 in the following conditions:
ru_ru: oneTBB поддерживает Intel® Inspector, Intel® VTune™ Profiler и Intel® Advisor. Полная поддержка этих инструментов требует компиляции с макросом ``TBB_USE_PROFILING_TOOLS=1``. Этот символ по умолчанию равен 1 в следующих условиях:

source: When ``TBB_USE_DEBUG=1``.
ru_ru: Когда ``TBB_USE_DEBUG=1``.

source: On the Microsoft Windows\* operating system, when ``_DEBUG=1``.
ru_ru: В операционной системе Microsoft Windows\*, когда ``_DEBUG=1``.

source: The :ref:`reference` section explains the default values in more detail.
ru_ru: В разделе :ref:`reference` более подробно объясняются значения по умолчанию.

source: The instrumentation support for Intel® Inspector becomes live after the first initialization of the task library. If the library components are used before this initialization occurs, Intel® Inspector may falsely report race conditions that are not really races.
ru_ru: Поддержка инструментария для Intel® Inspector становится активной после первой инициализации библиотеки задач. Если компоненты библиотеки используются до того, как произойдет эта инициализация, Intel® Inspector может ложно сообщать о состоянии гонки, которые на самом деле таковыми не являются.
