Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Flow_Graph_Buffering_*_Nodes.po
Languages: ru_ru

source: Flow Graph Basics: Buffering and Forwarding
ru_ru: Основы графа потока: Буферизация и переадресация

source: |full_name| flow graph nodes use messages to communicate data and to enforce dependencies. If a node passes a message successfully to any successor, no further action is taken with the message by that node. As noted in the section on Single-push vs. Broadcast-push, a message may be passed to one or to multiple successors, depending on the type of the node, how many successors are connected to the node, and whether the message is pushed or pulled.
ru_ru: Узлы графа потока |full_name| используют сообщения для передачи данных и обеспечения зависимостей. Если узел успешно передал сообщение любому преемнику, то никаких дальнейших действий с сообщением этот узел не предпринимает. Как было отмечено в разделе "Однократное нажатие против широковещательного нажатия", сообщение может быть передано одному или нескольким преемникам, в зависимости от типа узла, количества преемников, подключенных к узлу, и от того, проталкивается сообщение или вытягивается.

source: There are times when a node cannot successfully push a message to any successor. In this case what happens to the message depends on the type of the node. The two possibilities are:
ru_ru: Бывают случаи, когда узел не может успешно переслать сообщение ни одному преемнику. В этом случае то, что происходит с сообщением, зависит от типа узла. Возможны два варианта:

source: The node stores the message to be forwarded later.
ru_ru: Узел сохраняет сообщение для последующей пересылки.

source: The node discards the message.
ru_ru: Узел отбрасывает сообщение.

source: If a node discards messages that are not forwarded, and this behavior is not desired, the node should be connected to a buffering node that does store messages that cannot be pushed.
ru_ru: Если узел отбрасывает сообщения, которые не пересылаются, и такое поведение нежелательно, узел должен быть подключен к буферному узлу, который действительно хранит сообщения, которые не могут быть пересланы.

source: If a message has been stored by a node, there are two ways it can be passed to another node:
ru_ru: Если сообщение было сохранено узлом, есть два способа передать его другому узлу:

source: A successor to the node can pull the message using ``try_get()`` or ``try_reserve()``.
ru_ru: Преемник узла может вытащить сообщение, используя ``try_get()`` или ``try_reserve()``.

source: A successor can be connected using ``make_edge()``.
ru_ru: Преемник может быть подключен с помощью ``make_edge()``.

source: If a ``try_get()`` successfully forwards a message, it is removed from the node that stored it. If a node is connected using ``make_edge`` the node will attempt to push a stored message to the new successor.
ru_ru: Если ``try_get()`` успешно пересылает сообщение, оно удаляется из узла, который его хранил. Если узел соединяется с помощью ``make_edge``, то узел попытается протолкнуть сохраненное сообщение новому преемнику.
