Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Flow_Graph_Single_Vs_Broadcast.po
Languages: ru_ru

source: Flow Graph Basics: Single-push vs. Broadcast-push
ru_ru: Основы графа потока: Single-push vs. Broadcast-push

source: Nodes in the |full_name| flow graph communicate by pushing and pulling messages. Two policies for pushing messages are used, depending on the type of the node:
ru_ru: Узлы в графе потока |full_name| общаются посредством проталкивания и вытягивания сообщений. Для проталкивания сообщений используются две политики, в зависимости от типа узла:

source: **single-push**: No matter how many successors to the node exist and are able to accept a message, each message will be only sent to one successor.
ru_ru: **single-push**: Независимо от того, сколько преемников узла существует и способно принять сообщение, каждое сообщение будет отправлено только одному преемнику.

source: **broadcast-push**: A message will be pushed to every successor which is connected to the node by an edge in push mode, and which accepts the message.
ru_ru: **broadcast-push**: Сообщение будет передано каждому преемнику, который соединен с узлом ребром в режиме push и который принимает сообщение.

source: The following code demonstrates this difference:
ru_ru: Следующий код демонстрирует эту разницу:

source: The output of this code is
ru_ru: Вывод этого кода следующий

source: after single-push test, g_cnt == 3, b1==3, b2==0, b3==0 after broadcast-push test, g_cnt == 9, b1==3, b2==3, b3==3
ru_ru: после теста на одиночное нажатие, g_cnt == 3, b1==3, b2==0, b3==0 после теста broadcast-push, g_cnt == 9, b1==3, b2==3, b3==3

source: The single-push test uses a ``buffer_node``, which has a "single-push" policy for forwarding messages. Putting three messages to the ``buffer_node`` results in three messages being pushed. Notice also only the first ``function_node`` is sent to; in general there is no policy for which node is pushed to if more than one successor can accept.
ru_ru: В тесте single-push используется узел ``buffer_node``, который имеет политику пересылки сообщений "single-push". Посылка трёх сообщений на ``buffer_node`` приводит к тому, что три сообщения будут переправлены. Заметь также, что отправляется только первый узел ``function_node``; в общем случае не существует политики для того, на какой узел пересылается сообщение, если может быть принято более одного преемника.

source: The broadcast-push test uses a ``broadcast_node``, which will push any message it receives to all accepting successors. Putting three messages to the ``broadcast_node`` results in a total of nine messages pushed to the ``function_nodes``.
ru_ru: Тест broadcast-push использует узел ``broadcast_node``, который будет передавать любое полученное сообщение всем принимающим преемникам. Если поместить три сообщения в ``broadcast_node``, то в общей сложности девять сообщений будут направлены в ``function_nodes``.

source: Only nodes designed to buffer (hold and forward received messages) have a "single-push" policy; all other nodes have a "broadcast-push" policy.
ru_ru: Только узлы, предназначенные для буферизации (удержания и пересылки полученных сообщений), имеют политику "single-push"; все остальные узлы имеют политику "broadcast-push".

source: Please see the :ref:`broadcast_or_send` section of :ref:`Flow_Graph_Tips`, and :ref:`Flow_Graph_Buffering_in_Nodes` for more information.
ru_ru: Для получения дополнительной информации смотри раздел :ref:`broadcast_or_send` в :ref:`Flow_Graph_Tips`, а также :ref:`Flow_Graph_Buffering_in_Nodes`.
