Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Guiding_Task_Scheduler_Execution.po
Languages: ru_ru

source: Guiding Task Scheduler Execution
ru_ru: Управление работой планировщика задач

source: By default, the task scheduler tries to use all available computing resources. In some cases, you may want to configure the task scheduler to use only some of them.
ru_ru: По умолчанию планировщик задач пытается использовать все доступные вычислительные ресурсы. В некоторых случаях ты можешь захотеть настроить планировщик заданий на использование только некоторых из них.

source: Guiding the execution of the task scheduler may cause composability issues.
ru_ru: Руководство выполнением планировщика заданий может вызвать проблемы с композитивностью.

source: |full_name| provides the ``task_arena`` interface to guide tasks execution within the arena by:
ru_ru: |full_name| предоставляет интерфейс ``task_arena``, чтобы направлять выполнение задач в пределах арены:

source: setting the preferred computation units;
ru_ru: задание предпочтительных вычислительных блоков;

source: restricting part of computation units.
ru_ru: ограничение части вычислительных блоков.

source: Such customizations are encapsulated within the ``task_arena::constraints`` structure. To set the limitation, you have to customize the ``task_arena::constraints`` and then pass it to the ``task_arena`` instance during the construction or initialization.
ru_ru: Такие настройки заключены в структуре ``task_arena::constraints``. Чтобы установить ограничение, тебе нужно настроить структуру ``task_arena::constraints`` и затем передать ее экземпляру ``task_arena`` во время построения или инициализации.

source: The structure ``task_arena::constraints`` allows to specify the following restrictions:
ru_ru: Структура ``task_arena::constraints`` позволяет указать следующие ограничения:

source: Preferred NUMA node
ru_ru: Предпочитаемый узел NUMA

source: Preferred core type
ru_ru: Предпочтительный тип ядра

source: The maximum number of logical threads scheduled per single core simultaneously
ru_ru: Максимальное количество логических потоков, запланированных на одно ядро одновременно

source: The level of ``task_arena`` concurrency
ru_ru: Уровень параллелизма ``task_arena``

source: You may use the interfaces from ``tbb::info`` namespace to construct the ``tbb::task_arena::constraints`` instance. Interfaces from ``tbb::info`` namespace respect the process affinity mask. For instance, if the process affinity mask excludes execution on some of the NUMA nodes, then these NUMA nodes are not returned by ``tbb::info::numa_nodes()`` interface.
ru_ru: Ты можешь использовать интерфейсы из пространства имен ``tbb::info`` для построения экземпляра ``tbb::task_arena::constraints``. Интерфейсы из пространства имен ``tbb::info`` уважают маску аффинити процесса. Например, если маска аффинити процесса исключает выполнение на некоторых NUMA-узлах, то эти NUMA-узлы не возвращаются интерфейсом ``tbb::info::numa_nodes()``.

source: The following examples show how to use these interfaces:
ru_ru: В следующих примерах показано, как использовать эти интерфейсы:

source: Setting the preferred NUMA node
ru_ru: Установка предпочтительного узла NUMA

source: The execution on systems with non-uniform memory access (`NUMA <https://en.wikipedia.org/wiki/Non-uniform_memory_access>`_ systems) may cause a performance penalty if threads from one NUMA node access the memory allocated on a different NUMA node. To reduce this overhead, the work may be divided among several ``task_arena`` instances, whose execution preference is set to different NUMA nodes. To set execution preference, assign a NUMA node identifier to the ``task_arena::constraints::numa_id`` field.
ru_ru: Выполнение на системах с неравномерным доступом к памяти (`NUMA <https://en.wikipedia.org/wiki/Non-uniform_memory_access>`_ системы) может привести к снижению производительности, если потоки из одного NUMA-узла обращаются к памяти, выделенной на другом NUMA-узле. Чтобы уменьшить эти накладные расходы, работа может быть разделена между несколькими экземплярами ``task_arena``, предпочтение выполнения которых установлено на разные NUMA-узлы. Чтобы установить предпочтение выполнения, назначь идентификатор NUMA-узла полю ``task_arena::constraints::numa_id``.

source: Setting the preferred core type
ru_ru: Установка предпочтительного типа сердечника

source: The processors with `Intel® Hybrid Technology <https://www.intel.com/content/www/us/en/products/docs/processors/core/core-processors-with-hybrid-technology-brief.html>`_ contain several core types, each is suited for different purposes. For example, some applications may improve their performance by preferring execution on the most performant cores. To set execution preference, assign specific core type identifier to the ``task_arena::constraints::core_type`` field.
ru_ru: Процессоры с `Intel® Hybrid Technology <https://www.intel.com/content/www/us/en/products/docs/processors/core/core-processors-with-hybrid-technology-brief.html>`_ содержат несколько типов ядер, каждое из которых подходит для различных целей. Например, некоторые приложения могут улучшить свою производительность, предпочитая выполнение на наиболее производительных ядрах. Чтобы установить предпочтение выполнения, назначь конкретный идентификатор типа ядра полю ``task_arena::constraints::core_type``.

source: The example shows how to set the most performant core type as preferable for work execution:
ru_ru: В примере показано, как установить наиболее производительный тип ядра как предпочтительный для выполнения работы:

source: Limiting the maximum number of threads simultaneously scheduled to one core
ru_ru: Ограничение максимального количества потоков, одновременно запланированных на одном ядре

source: The processors with `Intel® Hyper-Threading Technology <https://www.intel.com/content/www/us/en/architecture-and-technology/hyper-threading/hyper-threading-technology.html>`_ allow more than one thread to run on each core simultaneously. However, there might be situations when there is need to lower the number of simultaneously running threads per core. In such cases, assign the desired value to the ``task_arena::constraints::max_threads_per_core`` field.
ru_ru: Процессоры с технологией `Intel® Hyper-Threading Technology <https://www.intel.com/content/www/us/en/architecture-and-technology/hyper-threading/hyper-threading-technology.html>`_ позволяют одновременно запускать более одного потока на каждом ядре. Однако могут возникнуть ситуации, когда необходимо снизить количество одновременно работающих потоков на ядро. В таких случаях присвой нужное значение полю ``task_arena::constraints::max_threads_per_core``.

source: The example shows how to allow only one thread to run on each core at a time:
ru_ru: В примере показано, как разрешить одновременно запускать только один поток на каждом ядре:

source: A more composable way to limit the number of threads executing on cores is by setting the maximal concurrency of the ``tbb::task_arena``:
ru_ru: Более композиционный способ ограничить количество потоков, выполняющихся на ядрах, заключается в установке максимального параллелизма ``tbb::task_arena``:

source: Similarly to the previous example, the number of threads inside the arena is equal to the number of available cores. However, this one results in fewer overheads and better composability by imposing a less constrained execution.
ru_ru: Аналогично предыдущему примеру, количество потоков внутри арены равно количеству доступных ядер. Однако этот приводит к меньшим накладным расходам и лучшей композитивности за счет наложения менее ограниченного выполнения.
