Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Linux_C_Dynamic_Memory_Interface_Replacement.po
Languages: ru_ru

source: Linux\* OS C/C++ Dynamic Memory Interface Replacement
ru_ru: Linux\* OS C/C++ Замена интерфейса динамической памяти

source: Release version of the proxy library is ``libtbbmalloc_proxy.so``, debug version is ``libtbbmalloc_proxy_debug.so``.
ru_ru: Release-версия библиотеки прокси - ``libtbbmalloc_proxy.so``, отладочная версия - ``libtbbmalloc_proxy_debug.so``.

source: The following dynamic memory functions are replaced:
ru_ru: Заменяются следующие функции динамической памяти:

source: Standard C library functions: ``malloc``, ``calloc``, ``realloc``, ``free``, (added in C11) ``aligned_alloc``
ru_ru: Стандартные функции библиотеки C: ``malloc``, ``calloc``, ``realloc``, ``free``, (добавлена в C11) ``aligned_alloc``

source: Standard POSIX\* function: ``posix_memalign``
ru_ru: Стандартная функция POSIX\*: ``posix_memalign``

source: Obsolete functions: ``valloc``, ``memalign``, ``pvalloc``, ``mallopt``
ru_ru: Устаревшие функции: ``valloc``, ``memalign``, ``pvalloc``, ``mallopt``

source: Replaceable global C++ operators ``new`` and ``delete``
ru_ru: Заменяемые глобальные операторы C++ ``new`` и ``delete``

source: GNU C library (glibc) specific functions: ``malloc_usable_size``, ``__libc_malloc``, ``__libc_calloc``, ``__libc_memalign``, ``__libc_free``, ``__libc_realloc``, ``__libc_pvalloc``, ``__libc_valloc``
ru_ru: Специфические функции библиотеки GNU C (glibc): ``malloc_usable_size``, ``__libc_malloc``, ``__libc_calloc``, ``__libc_memalign``, ``__libc_free``, ``__libc_realloc``, ``__libc_pvalloc``, ``__libc_valloc``

source: You can do the replacement either by loading the proxy library at program load time using the ``LD_PRELOAD`` environment variable (without changing the executable file), or by linking the main executable file with the proxy library.
ru_ru: Ты можешь сделать замену либо загрузив прокси-библиотеку во время загрузки программы с помощью переменной окружения ``LD_PRELOAD`` (без изменения исполняемого файла), либо соединив основной исполняемый файл с прокси-библиотекой.

source: The OS program loader must be able to find the proxy library and the scalable memory allocator library at program load time. For that you may include the directory containing the libraries in the ``LD_LIBRARY_PATH`` environment variable or add it to ``/etc/ld.so.conf``.
ru_ru: Загрузчик программ ОС должен уметь находить библиотеку прокси и библиотеку масштабируемого распределителя памяти во время загрузки программы. Для этого ты можешь включить каталог, содержащий библиотеки, в переменную окружения ``LD_LIBRARY_PATH`` или добавить его в ``/etc/ld.so.conf``.

source: There are limitations for dynamic memory replacement:
ru_ru: Существуют ограничения для динамической замены памяти:

source: glibc memory allocation hooks, such as ``__malloc_hook``, are not supported.
ru_ru: хуки выделения памяти glibc, такие как ``__malloc_hook``, не поддерживаются.

source: Mono is not supported.
ru_ru: Mono не поддерживается.

source: Examples
ru_ru: Примеры

source: These examples show how to set ``LD_PRELOAD`` and how to link a program to use the memory allocation replacements.
ru_ru: Эти примеры показывают, как установить ``LD_PRELOAD`` и как скомпоновать программу для использования замены распределения памяти.

source: To use the debug version of the library, replace *tbbmalloc_proxy* with *tbbmalloc_proxy_debug* in the above examples.
ru_ru: Чтобы использовать отладочную версию библиотеки, замени *tbbmalloc_proxy* на *tbbmalloc_proxy_debug* в приведенных выше примерах.
