Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/More_on_HashCompare.po
Languages: ru_ru

source: More on HashCompare
ru_ru: Подробнее о HashCompare

source: There are several ways to make the ``HashCompare`` argument for ``concurrent_hash_map`` work for your own types.
ru_ru: Есть несколько способов заставить аргумент ``HashCompare`` для ``concurrent_hash_map`` работать для твоих собственных типов.

source: Specify the ``HashCompare`` argument explicitly
ru_ru: Укажите аргумент ``HashCompare`` в явном виде

source: Let the ``HashCompare`` default to ``tbb_hash_compare<Key>`` and do one of the following:
ru_ru: Пусть ``HashCompare`` по умолчанию будет ``tbb_hash_compare<Key>`` и сделай одно из следующих действий:

source: Define a specialization of template ``tbb_hash_compare<Key>``.
ru_ru: Определи специализацию шаблона ``tbb_hash_compare``.

source: For example, if you have keys of type ``Foo``, and ``operator==`` is defined for ``Foo``, you just have to provide a definition of ``tbb_hasher`` as shown below:
ru_ru: Например, если у тебя есть ключи типа ``Foo``, и ``operator==`` определен для ``Foo``, тебе просто нужно предоставить определение ``tbb_hasher``, как показано ниже:

source: In general, the definition of ``tbb_hash_compare<Key>`` or ``HashCompare`` must provide two signatures:
ru_ru: В общем, определение ``tbb_hash_compare<Key>`` или ``HashCompare`` должно предоставлять две сигнатуры:

source: A method ``hash`` that maps a ``Key`` to a ``size_t``
ru_ru: Метод ``hash``, который отображает ``Key`` в ``size_t``

source: A method ``equal`` that determines if two keys are equal
ru_ru: Метод ``equal``, который определяет, равны ли два ключа

source: The signatures go together in a single class because *if two keys are equal, then they must hash to the same value*, otherwise the hash table might not work. You could trivially meet this requirement by always hashing to ``0``, but that would cause tremendous inefficiency. Ideally, each key should hash to a different value, or at least the probability of two distinct keys hashing to the same value should be kept low.
ru_ru: Сигнатуры объединяются в один класс, потому что *если два ключа равны, то они должны хэшироваться на одно и то же значение*, иначе хэш-таблица может не работать. Ты можешь тривиально выполнить это требование, всегда хэшируя на ``0``, но это приведет к огромной неэффективности. В идеале каждый ключ должен хэшироваться на разное значение, или, по крайней мере, вероятность того, что два разных ключа хэшируются на одно и то же значение, должна быть низкой.

source: The methods of ``HashCompare`` should be ``static`` unless you need to have them behave differently for different instances. If so, then you should construct the ``concurrent_hash_map`` using the constructor that takes a ``HashCompare`` as a parameter. The following example is a variation on an earlier example with instance-dependent methods. The instance performs both case-sensitive or case-insensitive hashing, and comparison, depending upon an internal flag ``ignore_case``.
ru_ru: Методы ``HashCompare`` должны быть ``static``, если только тебе не нужно, чтобы они вели себя по-разному для разных экземпляров. Если это так, то тебе следует построить ``concurrent_hash_map`` с помощью конструктора, который принимает ``HashCompare`` в качестве параметра. Следующий пример является вариацией предыдущего примера с методами, зависящими от экземпляра. Экземпляр выполняет хеширование с учётом или без учёта регистра, а также сравнение в зависимости от внутреннего флага ``ignore_case``.

source: // Structure that defines hashing and comparison operations class VariantHashCompare { // If true, then case of letters is ignored. bool ignore_case; public: size_t hash(const string& x) const { size_t h = 0; for(const char* s = x.c_str(); *s; s++) h = (h*16777179)^*(ignore_case?tolower(*s):*s); return h; } // True if strings are equal bool equal(const string& x, const string& y) const { if( ignore_case ) strcasecmp(x.c_str(), y.c_str())==0; else return x==y; } VariantHashCompare(bool ignore_case_) : ignore_case(ignore_case_) {} }; typedef concurrent_hash_map<string,int, VariantHashCompare> VariantStringTable; VariantStringTable CaseSensitiveTable(VariantHashCompare(false)); VariantStringTable CaseInsensitiveTable(VariantHashCompare(true));
ru_ru: // Структура, определяющая операции хэширования и сравнения class VariantHashCompare { // Если true, то регистр букв игнорируется. bool ignore_case; public: size_t hash(const string& x) const { size_t h = 0; for(const char* s = x.c_str(); *s; s++) h = (h*16777179)^*(ignore_case?tolower(*s):*s); return h; } // Истина, если строки равны bool equal(const string& x, const string& y) const { if( ignore_case ) strcasecmp(x.c_str(), y.c_str())==0; else return x==y; } VariantHashCompare(bool ignore_case_) : ignore_case(ignore_case_) {} }; typedef concurrent_hash_map<string,int, VariantHashCompare> VariantStringTable; VariantStringTable CaseSensitiveTable(VariantHashCompare(false)); VariantStringTable CaseInsensitiveTable(VariantHashCompare(true));
