Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Mutual_Exclusion.po
Languages: ru_ru

source: Mutual Exclusion
ru_ru: Взаимное исключение

source: Mutual exclusion controls how many threads can simultaneously run a region of code. In |full_name|, mutual exclusion is implemented by *mutexes* and *locks.* A mutex is an object on which a thread can acquire a lock. Only one thread at a time can have a lock on a mutex; other threads have to wait their turn.
ru_ru: Взаимное исключение контролирует, сколько потоков могут одновременно выполнять ту или иную область кода. В |full_name| взаимное исключение реализуется с помощью *мьютексов* и *блокировок.* Мьютекс - это объект, на который поток может получить блокировку. Только один поток одновременно может иметь блокировку на мьютексе; другие потоки должны ждать своей очереди.

source: The simplest mutex is ``spin_mutex``. A thread trying to acquire a lock on a ``spin_mutex`` busy waits until it can acquire the lock. A ``spin_mutex`` is appropriate when the lock is held for only a few instructions. For example, the following code uses a mutex ``FreeListMutex`` to protect a shared variable ``FreeList``. It checks that only a single thread has access to ``FreeList`` at a time.
ru_ru: Самый простой мьютекс - это ``spin_mutex``. Поток, пытающийся получить блокировку на занятом ``spin_mutex``, ждет, пока он сможет получить блокировку. ``spin_mutex`` подходит, когда блокировка удерживается всего на несколько инструкций. Например, следующий код использует мьютекс ``FreeListMutex`` для защиты общей переменной ``FreeList``. Он проверяет, что только один поток имеет доступ к ``FreeList`` одновременно.

source: The constructor for ``scoped_lock`` waits until there are no other locks on ``FreeListMutex``. The destructor releases the lock. The braces inside routine ``AllocateNode`` may look unusual. Their role is to keep the lifetime of the lock as short as possible, so that other waiting threads can get their chance as soon as possible.
ru_ru: Конструктор для ``scoped_lock`` ждет, пока не будет других блокировок на ``FreeListMutex``. Деструктор освобождает блокировку. Скобки внутри рутины ``AllocateNode`` могут выглядеть необычно. Их роль заключается в том, чтобы сделать время жизни блокировки как можно короче, чтобы другие ожидающие потоки могли получить свой шанс как можно скорее.

source: Be sure to name the lock object, otherwise it will be destroyed too soon. For example, if the creation of the ``scoped_lock`` object in the example is changed to
ru_ru: Обязательно присвой объекту блокировки имя, иначе он будет уничтожен слишком рано. Например, если создание объекта ``scoped_lock`` в примере изменить на

source: then the ``scoped_lock`` is destroyed when execution reaches the semicolon, which releases the lock *before* ``FreeList`` is accessed.
ru_ru: то ``scoped_lock`` уничтожается, когда выполнение достигает точки с запятой, что освобождает блокировку *перед* обращением к ``FreeList``.

source: The following shows an alternative way to write ``AllocateNode``:
ru_ru: Ниже показан альтернативный способ написания ``AllocateNode``:

source: Method ``acquire`` waits until it can acquire a lock on the mutex; method ``release`` releases the lock.
ru_ru: Метод ``acquire`` ждет, пока не сможет приобрести блокировку на мьютексе; метод ``release`` освобождает блокировку.

source: It is recommended that you add extra braces where possible, to clarify to maintainers which code is protected by the lock.
ru_ru: Рекомендуется, по возможности, добавлять дополнительные скобки, чтобы пояснить сопровождающим, какой код защищен блокировкой.

source: If you are familiar with C interfaces for locks, you may be wondering why there are not simply acquire and release methods on the mutex object itself. The reason is that the C interface would not be exception safe, because if the protected region threw an exception, control would skip over the release. With the object-oriented interface, destruction of the ``scoped_lock`` object causes the lock to be released, no matter whether the protected region was exited by normal control flow or an exception. This is true even for our version of ``AllocateNode`` that used methods ``acquire`` and ``release –`` the explicit release causes the lock to be released earlier, and the destructor then sees that the lock was released and does nothing.
ru_ru: Если ты знаком с интерфейсами C для блокировок, то тебе может быть интересно, почему на самом объекте мьютекса нет просто методов ``acquire`` и ``release``. Причина в том, что интерфейс языка Си не был бы безопасным для исключений, потому что если бы защищенная область выбросила исключение, управление пропустило бы освобождение. В объектно-ориентированном интерфейсе уничтожение объекта ``scoped_lock`` приводит к освобождению блокировки, независимо от того, была ли защищённая область выведена обычным потоком управления или исключением. Это верно даже для нашей версии ``AllocateNode``, которая использовала методы ``acquire`` и ``release - явное освобождение приводит к тому, что блокировка освобождается раньше, а деструктор видит, что блокировка была освобождена, и ничего не делает.

source: All mutexes in oneTBB have a similar interface, which not only makes them easier to learn, but enables generic programming. For example, all of the mutexes have a nested ``scoped_lock`` type, so given a mutex of type ``M``, the corresponding lock type is ``M::scoped_lock``.
ru_ru: Все мьютексы в oneTBB имеют схожий интерфейс, что не только облегчает их изучение, но и позволяет осуществлять универсальное программирование. Например, все мьютексы имеют вложенный тип ``scoped_lock``, поэтому, если дать мьютексу тип ``M``, то соответствующий тип блокировки будет ``M::scoped_lock``.

source: It is recommended that you always use a ``typedef`` for the mutex type, as shown in the previous examples. That way, you can change the type of the lock later without having to edit the rest of the code. In the examples, you could replace the ``typedef`` with ``typedef queuing_mutex FreeListMutexType``, and the code would still be correct.
ru_ru: Рекомендуется, чтобы ты всегда использовал ``typedef`` для типа мьютекса, как показано в предыдущих примерах. Таким образом, ты сможешь изменить тип блокировки позже без необходимости редактировать остальной код. В примерах ты можешь заменить ``typedef`` на ``typedef queuing_mutex FreeListMutexType``, и код все равно будет правильным.
