Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/parallel_reduce.po
Languages: ru_ru

source: A loop can do a reduction, as in this summation:
ru_ru: Цикл может выполнять свертку, как в этом суммировании:

source: If the iterations are independent, you can parallelize this loop using the template class ``parallel_reduce`` as follows:
ru_ru: Если итерации независимы, ты можешь распараллелить этот цикл с помощью шаблонного класса ``parallel_reduce`` следующим образом:

source: The class ``SumFoo`` specifies details of the reduction, such as how to accumulate subsums and combine them. Here is the definition of class ``SumFoo``:
ru_ru: Класс ``SumFoo`` определяет детали свертки, например, как накапливать подсуммы и объединять их. Вот определение класса ``SumFoo``:

source: Note the differences with class ``ApplyFoo`` from parallel_for. First, ``operator()`` is *not* ``const``. This is because it must update SumFoo::my_sum. Second, ``SumFoo`` has a *splitting constructor* and a method ``join`` that must be present for ``parallel_reduce`` to work. The splitting constructor takes as arguments a reference to the original object, and a dummy argument of type ``split``, which is defined by the library. The dummy argument distinguishes the splitting constructor from a copy constructor.
ru_ru: Обрати внимание на различия с классом ``ApplyFoo`` из parallel_for. Во-первых, ``operator()`` является *не* ``const``. Это потому, что он должен обновлять SumFoo::my_sum. Во-вторых, у ``SumFoo`` есть конструктор *разделения* и метод ``join``, которые должны присутствовать для работы ``parallel_reduce``. Конструктор разделения принимает в качестве аргументов ссылку на исходный объект и фиктивный аргумент типа ``split`, который определяется библиотекой. Фиктивный аргумент отличает конструктор расщепления от конструктора копирования.

source: In the example, the definition of ``operator()`` uses local temporary variables (``a``, ``sum``, ``end``) for scalar values accessed inside the loop. This technique can improve performance by making it obvious to the compiler that the values can be held in registers instead of memory. If the values are too large to fit in registers, or have their address taken in a way the compiler cannot track, the technique might not help. With a typical optimizing compiler, using local temporaries for only written variables (such as ``sum`` in the example) can suffice, because then the compiler can deduce that the loop does not write to any of the other locations, and hoist the other reads to outside the loop.
ru_ru: В примере определение ``operator()`` использует локальные временные переменные (``a``, ``sum``, ``end``) для скалярных значений, доступных внутри цикла. Эта техника может улучшить производительность, делая очевидным для компилятора, что значения могут храниться в регистрах, а не в памяти. Если значения слишком велики, чтобы поместиться в регистры, или их адрес взят таким образом, что компилятор не может его отследить, эта техника может не помочь. Для типичного оптимизирующего компилятора может быть достаточно использования локальных временных хранилищ только для записанных переменных (таких как ``sum`` в примере), потому что тогда компилятор может сделать вывод, что цикл не записывает ни в одно из других мест, и перенести остальные чтения за пределы цикла.

source: When a worker thread is available, as decided by the task scheduler, ``parallel_reduce`` invokes the splitting constructor to create a subtask for the worker. When the subtask completes, ``parallel_reduce`` uses method ``join`` to accumulate the result of the subtask. The graph at the top of the following figure shows the split-join sequence that happens when a worker is available:
ru_ru: Когда рабочий поток доступен, что определяется планировщиком задач, ``parallel_reduce`` вызывает конструктор расщепления, чтобы создать подзадачу для рабочего потока. Когда подзадача завершается, ``parallel_reduce`` использует метод ``join`` для накопления результата подзадачи. График в верхней части следующего рисунка показывает последовательность split-join, которая происходит, когда доступен рабочий поток:

source: Graph of the Split-join Sequence |image0|
ru_ru: Граф последовательности Split-join |image0|

source: An arrows in the above figure indicate order in time. The splitting constructor might run concurrently while object ``x`` is being used for the first half of the reduction. Therefore, all actions of the splitting constructor that creates y must be made thread safe with respect to ``x``. So if the splitting constructor needs to increment a reference count shared with other objects, it should use an atomic increment.
ru_ru: Стрелки на рисунке выше указывают на порядок во времени. Конструктор расщепления может выполняться параллельно, пока объект ``x`` используется для первой половины интревала. Поэтому все действия конструктора расщепления, создающего y, должны быть потокобезопасными по отношению к ``x``. Поэтому если конструктору расщепления нужно увеличить счетчик ссылок, разделяемый с другими объектами, он должен использовать атомарный инкремент.

source: If a worker is not available, the second half of the iteration is reduced using the same body object that reduced the first half. That is the reduction of the second half starts where reduction of the first half finished.
ru_ru: Если рабочего потока нет, то вторая половина итерации сокращается с использованием того же объекта тела, который сокращал первую половину. То есть редукция второй половины начинается там, где закончилась редукция первой половины.

source: Since split/join are not used if workers are unavailable, ``parallel_reduce`` does not necessarily do recursive splitting.
ru_ru: Поскольку split/join не используются, если свободные потоки недоступны, ``parallel_reduce`` не обязательно выполняет рекурсивное расщепление.

source: Since the same body might be used to accumulate multiple subranges, it is critical that ``operator()`` not discard earlier accumulations. The code below shows an incorrect definition of ``SumFoo::operator()``.
ru_ru: Поскольку одно и то же тело может использоваться для накопления нескольких подрезультатов, очень важно, чтобы ``operator()`` не отбрасывал более ранние накопления. Код ниже показывает неправильное определение ``SumFoo::operator()``.

source: With the mistake, the body returns a partial sum for the last subrange instead of all subranges to which ``parallel_reduce`` applies it.
ru_ru: При ошибке тело возвращает частичную сумму для последнего поддиапазона вместо всех поддиапазонов, к которым применяется ``parallel_reduce``.

source: The rules for partitioners and grain sizes for ``parallel_reduce`` are the same as for ``parallel_for``.
ru_ru: Правила для разделителей и размеров зерен для ``parallel_reduce`` такие же, как и для ``parallel_for``.

source: ``parallel_reduce`` generalizes to any associative operation. In general, the splitting constructor does two things:
ru_ru: ``parallel_reduce`` обобщается на любую ассоциативную операцию. В общем, конструктор расщепления делает две вещи:

source: Copy read-only information necessary to run the loop body.
ru_ru: Скопируй информацию только для чтения, необходимую для запуска тела цикла.

source: Initialize the reduction variable(s) to the identity element of the operation(s).
ru_ru: Инициализируй переменную(ые) редукции на элемент(ы) идентичности операции(ий).

source: The join method should do the corresponding merge(s). You can do more than one reduction at the same time: you can gather the min and max with a single ``parallel_reduce``.
ru_ru: Метод join должен выполнить соответствующее слияние (слияния). Ты можешь выполнять более одной свертки одновременно: ты можешь собрать min и max с помощью одного ``parallel_reduce``.

source: The reduction operation can be non-commutative. The example still works if floating-point addition is replaced by string concatenation.
ru_ru: Операция редукции может быть некоммутативной. Пример по-прежнему работает, если сложение с плавающей точкой заменить конкатенацией строк.
