Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Partitioner_Summary.po
Languages: ru_ru

source: Partitioner Summary
ru_ru: Выводы раздела

source: The parallel loop templates ``parallel_for`` and ``parallel_reduce`` take an optional *partitioner* argument, which specifies a strategy for executing the loop. The following table summarizes partitioners and their effect when used in conjunction with ``blocked_range``.
ru_ru: Шаблоны параллельных циклов ``parallel_for`` и ``parallel_reduce`` принимают необязательный аргумент *partitioner*, который определяет стратегию выполнения цикла. В следующей таблице приведены разделители и их влияние при использовании в сочетании с ``blocked_range``.

source: Partitioner
ru_ru: Алгоритм разделения

source: Description
ru_ru: Описание

source: When Used with ``blocked_range(i,j,g)``
ru_ru: При использовании с ``blocked_range(i,j,g)``

source: Chunksize bounded by grain size.
ru_ru: Размер кусков, ограниченный размером зерна.

source: ``auto_partitioner`` (default)
ru_ru: ``auto_partitioner`` (по-умолчанию)

source: Automatic chunk size.
ru_ru: Автоматический размер блока.

source: Automatic chunk size, cache affinity and uniform distribution of iterations.
ru_ru: Автоматический размер блока, сродство к кэшу и равномерное распределение итераций.

source: Deterministic chunk size, cache affinity and uniform distribution of iterations without load balancing.
ru_ru: Детерминированный размер блока, сродство кэша и равномерное распределение итераций без балансировки нагрузки.

source: An ``auto_partitioner`` is used when no partitioner is specified. In general, the ``auto_partitioner`` or ``affinity_partitioner`` should be used, because these tailor the number of chunks based on available execution resources. ``affinity_partitioner`` and ``static_partitioner`` may take advantage of ``Range`` ability to split in a given ratio (see "Advanced Topic: Other Kinds of Iteration Spaces") for distributing iterations in nearly equal chunks between computing resources.
ru_ru: Когда не указан разделитель, используется ``auto_partitioner``. В общем случае следует использовать ``auto_partitioner`` или ``affinity_partitioner``, поскольку они подбирают количество блока в зависимости от доступных ресурсов выполнения. ``affinity_partitioner`` и ``static_partitioner`` могут воспользоваться способностью ``Range`` разбивать в заданном соотношении (см. :ref:`Exceptions_and_Cancellation`) для распределения итераций почти равными частями между вычислительными ресурсами.

source: ``simple_partitioner`` can be useful in the following situations:
ru_ru: ``simple_partitioner`` может быть полезен в следующих ситуациях:

source: The subrange size for ``operator()`` must not exceed a limit. That might be advantageous, for example, if your ``operator()`` needs a temporary array proportional to the size of the range. With a limited subrange size, you can use an automatic variable for the array instead of having to use dynamic memory allocation.
ru_ru: Размер поддиапазона для ``operator()`` не должен превышать предел. Это может быть выгодно, например, если твой ``operator()`` нуждается во временном массиве, пропорциональном размеру диапазона. При ограниченном размере поддиапазона ты можешь использовать локальную переменную для массива вместо того, чтобы прибегать к динамическому выделению памяти.

source: A large subrange might use cache inefficiently. For example, suppose the processing of a subrange involves repeated sweeps over the same memory locations. Keeping the subrange below a limit might enable the repeatedly referenced memory locations to fit in cache.
ru_ru: Большой поддиапазон может использовать кэш неэффективно. Например, предположим, что обработка поддиапазона включает в себя повторные обращения к одним и тем же местам памяти. Если держать поддиапазон ниже предельного значения, то это может позволить многократным обращениям к одним и тем же местам памяти поместиться в кэш.

source: You want to tune to a specific machine.
ru_ru: Ты хочешь настроиться на конкретную машину.
