Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Task-Based_Programming.po
Languages: ru_ru

source: Task-Based Programming
ru_ru: Программирование на основе задач

source: When striving for performance, programming in terms of threads can be a poor way to do multithreaded programming. It is much better to formulate your program in terms of *logical tasks*, not threads, for several reasons.
ru_ru: Если стремиться к производительности, программирование в терминах потоков может быть плохим способом многопоточного программирования. Гораздо лучше формулировать свою программу в терминах *логических задач*, а не потоков, по нескольким причинам.

source: Matching parallelism to available resources
ru_ru: Сопоставление параллелизма с доступными ресурсами

source: Faster task startup and shutdown
ru_ru: Более быстрый запуск и завершение задач

source: More efficient evaluation order
ru_ru: Более эффективный порядок оценки

source: Improved load balancing
ru_ru: Улучшенная балансировка нагрузки

source: Higher–level thinking
ru_ru: Мышление более высокого уровня

source: The following paragraphs explain these points in detail.
ru_ru: Следующие параграфы подробно объясняют эти моменты.

source: The threads you create with a threading package are *logical* threads, which map onto the *physical threads* of the hardware. For computations that do not wait on external devices, highest efficiency usually occurs when there is exactly one running logical thread per physical thread. Otherwise, there can be inefficiencies from the mismatch\ *. Undersubscription* occurs when there are not enough running logical threads to keep the physical threads working. *Oversubscription* occurs when there are more running logical threads than physical threads. Oversubscription usually leads to *time sliced* execution of logical threads, which incurs overheads as discussed in Appendix A, *Costs of Time Slicing*. The scheduler tries to avoid oversubscription, by having one logical thread per physical thread, and mapping tasks to logical threads, in a way that tolerates interference by other threads from the same or other processes.
ru_ru: Потоки, которые ты создаешь с помощью пакета потоков, являются *логическими* потоками, которые отображаются на *физические потоки* аппаратного обеспечения. Для вычислений, которые не ждут от внешних устройств, наивысшая эффективность обычно имеет место, когда на один физический поток приходится ровно один работающий логический поток. В противном случае может возникнуть неэффективность из-за несоответствия. *Неподписка* возникает, когда не хватает запущенных логических потоков для поддержания работоспособности физических потоков. *Переподписка* возникает, когда работающих логических потоков больше, чем физических. Переподписка обычно приводит к *временной нарезке* выполнения логических потоков, что влечет за собой накладные расходы, которые обсуждаются в Приложении А, *Стоимость временной нарезки*. Планировщик пытается избежать переподписки, имея один логический поток на один физический поток, и сопоставляя задачи с логическими потоками таким образом, чтобы не допустить вмешательства других потоков из того же или других процессов.

source: The key advantage of tasks versus logical threads is that tasks are much *lighter weight* than logical threads. On Linux systems, starting and terminating a task is about 18 times faster than starting and terminating a thread. On Windows systems, the ratio is more than 100. This is because a thread has its own copy of a lot of resources, such as register state and a stack. On Linux, a thread even has its own process id. A task in |full_name|, in contrast, is typically a small routine, and also, cannot be preempted at the task level (though its logical thread can be preempted).
ru_ru: Ключевое преимущество задач по сравнению с логическими потоками заключается в том, что задачи намного *легче*, чем логические потоки. В системах Linux запуск и завершение задачи происходит примерно в 18 раз быстрее, чем запуск и завершение потока. В системах Windows это соотношение больше 100. Это происходит потому, что поток имеет свою собственную копию многих ресурсов, таких как состояние регистров и стек. В Linux поток даже имеет свой собственный идентификатор процесса. Задача в |full_name|, напротив, обычно является небольшой рутиной, и, кроме того, не может быть вытеснена на уровне задачи (хотя ее логический поток может быть вытеснен).

source: Tasks in oneTBB are efficient too because *the scheduler is unfair*. Thread schedulers typically distribute time slices in a round-robin fashion. This distribution is called "fair", because each logical thread gets its fair share of time. Thread schedulers are typically fair because it is the safest strategy to undertake without understanding the higher-level organization of a program. In task-based programming, the task scheduler does have some higher-level information, and so can sacrifice fairness for efficiency. Indeed, it often delays starting a task until it can make useful progress.
ru_ru: Задачи в oneTBB эффективны еще и потому, что *планировщик несправедлив*. Планировщики потоков обычно распределяют временные срезы по кругу. Такое распределение называется "справедливым", потому что каждый логический поток получает свою справедливую долю времени. Планировщики потоков обычно справедливы, потому что это самая безопасная стратегия, которую можно предпринять, не понимая высокоуровневой организации программы. В программировании на основе задач планировщик задач действительно обладает некоторой информацией более высокого уровня, и поэтому может пожертвовать справедливостью ради эффективности. Действительно, он часто откладывает запуск задачи до тех пор, пока она не сможет добиться полезного прогресса.

source: The scheduler does *load balancing*. In addition to using the right number of threads, it is important to distribute work evenly across those threads. As long as you break your program into enough small tasks, the scheduler usually does a good job of assigning tasks to threads to balance load. With thread-based programming, you are often stuck dealing with load-balancing yourself, which can be tricky to get right.
ru_ru: Планировщик выполняет *балансировку нагрузки*. Помимо использования нужного количества потоков, важно равномерно распределить работу между этими потоками. Пока ты разбиваешь свою программу на достаточно мелкие задачи, планировщик обычно хорошо справляется с распределением задач по потокам, чтобы сбалансировать нагрузку. При программировании на основе потоков тебе часто приходится самому решать вопросы балансировки нагрузки, что может быть непросто.

source: Design your programs to try to create many more tasks than there are threads, and let the task scheduler choose the mapping from tasks to threads.
ru_ru: Разрабатывай свои программы так, чтобы стараться создавать гораздо больше задач, чем потоков, и позволь планировщику задач выбирать отображение от задач к потокам.

source: Finally, the main advantage of using tasks instead of threads is that they let you think at a higher, task-based, level. With thread-based programming, you are forced to think at the low level of physical threads to get good efficiency, because you have one logical thread per physical thread to avoid undersubscription or oversubscription. You also have to deal with the relatively coarse grain of threads. With tasks, you can concentrate on the logical dependences between tasks, and leave the efficient scheduling to the scheduler.
ru_ru: Наконец, главное преимущество использования задач вместо потоков заключается в том, что они позволяют тебе мыслить на более высоком, основанном на задачах, уровне. При программировании на основе потоков ты вынужден думать на низком уровне физических потоков, чтобы добиться хорошей эффективности, потому что у тебя есть один логический поток на физический поток, чтобы избежать недописки или переписки. Тебе также приходится иметь дело с относительно крупным зерном потоков. С задачами ты можешь сосредоточиться на логических зависимостях между задачами, а эффективное планирование оставить планировщику.
