Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Windows_OS_*.po
Languages: ug

source: This section uses <*tbb_install_dir*> to indicate the top-level installation directory. The following table describes the subdirectory structure for Windows\*, relative to <*tbb_install_dir*>.
ug: В этом разделе используется <*tbb_install_dir*> для обозначения каталога установки верхнего уровня. Следующая таблица описывает структуру подкаталогов для Windows\*, относительно <*tbb_install_dir*>.

source: Item
ug: Элемент

source: Location
ug: Местоположение

source: Environment Variable
ug: Переменная окружения

source: Header files
ug: Заголовочные файлы

source: .lib files
ug: файлы .lib

source: .dll files
ug: файлы .dll

source: .pdb files
ug: файлы .pdb

source: Same as corresponding ``.dll`` file.
ug: То же самое, что и соответствующий файл ``.dll``.

source: where
ug: где

source: ``<arch>`` - ``ia32`` or ``intel64``
ug: ``<arch>`` - ``ia32`` или ``intel64``

source: ``<lib>`` - ``tbb``, ``tbbmalloc``, ``tbbmalloc_proxy`` or ``tbbbind``
ug: ``<lib>`` - ``tbb``, ``tbbmalloc``, ``tbbmalloc_proxy`` или ``tbbbind``

source: ``14`` - use for dynamic linkage with the CRT
ug: ``14`` - используйте для динамической связи с CRT

source: ``14_uwp`` - use for Windows 10 Universal Windows applications
ug: ``14_uwp`` - использование для приложений Windows 10 Universal Windows

source: ``14_uwd`` - use for Universal Windows Drivers
ug: ``14_uwd`` - использование для универсальных драйверов Windows

source: ``_mt`` - use for static linkage with the CRT
ug: ``_mt`` - используется для статической связи с CRT

source: ``<variant>`` - ``_debug`` or empty
ug: ``<variant>`` - ``_debug`` или пусто

source: ``<version>`` - binary version
ug: ``<version>`` - бинарная версия

source: The last column shows which environment variables are used by the Microsoft\* Visual C++\* or Intel® C++ Compiler Classic or Intel® oneAPI DPC++/C++ Compiler to find these subdirectories.
ug: Последний столбец показывает, какие переменные окружения используются Microsoft\* Visual C++\* или Intel® C++ Compiler Classic или Intel® oneAPI DPC++/C++ Compiler для поиска этих подкаталогов.

source: Ensure that the relevant product directories are mentioned by the environment variables; otherwise the compiler might not find the required files.
ug: Убедись, что соответствующие каталоги продукта упомянуты переменными окружения, иначе компилятор может не найти нужные файлы.

source: Microsoft\* C/C++ run-time libraries come in static and dynamic forms. Either can be used with oneTBB. Linking to the oneTBB library is always dynamic.
ug: Библиотеки времени выполнения Microsoft\* C/C++ бывают в статической и динамической формах. Любая из них может быть использована с oneTBB. Связывание с библиотекой oneTBB всегда динамическое.
