Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Windows_C_Dynamic_Memory_Interface_Replacement.po
Languages: ru_ru

source: Windows\* OS C/C++ Dynamic Memory Interface Replacement
ru_ru: Windows\* OS C/C++ Замена интерфейса динамической памяти

source: Release version of the proxy library is ``tbbmalloc_proxy.dll``, debug version is ``tbbmalloc_proxy_debug.dll``.
ru_ru: Release-версия библиотеки прокси - ``tbbmalloc_proxy.dll``, отладочная версия - ``tbbmalloc_proxy_debug.dll``.

source: The following dynamic memory functions are replaced:
ru_ru: Заменяются следующие функции динамической памяти:

source: Standard C library functions: ``malloc``, ``calloc``, ``realloc``, ``free``
ru_ru: Стандартные функции библиотеки C: ``malloc``, ``calloc``, ``realloc``, ``free``

source: Replaceable global C++ operators ``new`` and ``delete``
ru_ru: Заменяемые глобальные операторы C++ ``new`` и ``delete``

source: Microsoft\* C run-time library functions: ``_msize``, ``_aligned_malloc``, ``_aligned_realloc``, ``_aligned_free``, ``_aligned_msize``
ru_ru: Microsoft\* Функции библиотеки времени выполнения C: ``_msize``, ``_aligned_malloc``, ``_aligned_realloc``, ``_aligned_free``, ``_aligned_msize``

source: Replacement of memory allocation functions is not supported for Universal Windows Platform applications.
ru_ru: Замена функций распределения памяти не поддерживается для приложений Universal Windows Platform.

source: To do the replacement use one of the following methods:
ru_ru: Чтобы произвести замену, используй один из следующих методов:

source: Add the following header to a source code of any binary which is loaded during application startup.
ru_ru: Добавь следующий заголовок в исходный код любого бинарного файла, который загружается во время запуска приложения.

source: Alternatively, add the following parameters to the linker options for the .exe or .dll file that is loaded during application startup.
ru_ru: В качестве альтернативы добавь следующие параметры в опции компоновщика для файла .exe или .dll, который загружается при запуске приложения.

source: For 32-bit code (note the triple underscore):
ru_ru: Для 32-битного кода (обрати внимание на тройное подчеркивание):

source: For 64-bit code (note the double underscore):
ru_ru: Для 64-битного кода (обрати внимание на двойное подчеркивание):

source: The OS program loader must be able to find the proxy library and the scalable memory allocator library at program load time. For that you may include the directory containing the libraries in the ``PATH`` environment variable.
ru_ru: Загрузчик программ ОС должен уметь находить библиотеку прокси и библиотеку масштабируемого распределителя памяти во время загрузки программы. Для этого ты можешь включить каталог, содержащий библиотеки, в переменную окружения ``PATH``.

source: The replacement uses in-memory binary instrumentation of Visual C++\* runtime libraries. To ensure correctness, it must first recognize a subset of dynamic memory functions in these libraries. If a problem occurs, the replacement is skipped, and the program continues to use the standard memory allocation functions. You can use the ``TBB_malloc_replacement_log`` function to check if the replacement has succeeded and to get additional information.
ru_ru: Замена использует бинарный инструментарий в памяти библиотек времени выполнения Visual C++\*. Чтобы обеспечить корректность, она должна сначала распознать подмножество функций динамической памяти в этих библиотеках. Если возникает проблема, замена пропускается, и программа продолжает использовать стандартные функции распределения памяти. Ты можешь использовать функцию ``TBB_malloc_replacement_log`` для проверки успешности замены и получения дополнительной информации.

source: Set the ``TBB_MALLOC_DISABLE_REPLACEMENT`` environment variable to 1 to disable replacement for a specific program invocation. In this case, the program will use standard dynamic memory allocation functions. Note that the oneTBB memory allocation libraries are still required for the program to start even if their usage is disabled.
ru_ru: Установи переменную окружения ``TBB_MALLOC_DISABLE_REPLACEMENT`` в 1, чтобы отключить замещение для конкретного вызова программы. В этом случае программа будет использовать стандартные функции динамического распределения памяти. Обрати внимание, что библиотеки распределения памяти oneTBB по-прежнему необходимы для запуска программы, даже если их использование отключено.
