Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/work_isolation.po
Languages: ru_ru

source: Work Isolation
ru_ru: Изоляция работы

source: In |full_name|, a thread waiting for a group of tasks to complete might execute other available tasks. In particular, when a parallel construct calls another parallel construct, a thread can obtain a task from the outer-level construct while waiting for completion of the inner-level one.
ru_ru: В |full_name| поток, ожидающий завершения группы задач, может выполнять другие доступные задачи. В частности, когда параллельная конструкция вызывает другую параллельную конструкцию, поток может получить задание от конструкции внешнего уровня, ожидая завершения работы конструкции внутреннего уровня.

source: In the following example with two ``parallel_for`` calls, the call to the second (nested) parallel loop blocks execution of the first (outer) loop iteration:
ru_ru: В следующем примере с двумя вызовами ``parallel_for`` вызов второго (вложенного) параллельного цикла блокирует выполнение первой (внешней) итерации цикла:

source: The blocked thread is allowed to take tasks belonging to the first parallel loop. As a result, two or more iterations of the outer loop might be simultaneously assigned to the same thread. In other words, in oneTBB execution of functions constituting a parallel construct is *unsequenced* even within a single thread. In most cases, this behavior is harmless or even beneficial because it does not restrict parallelism available for the thread.
ru_ru: Заблокированному потоку разрешается брать задачи, принадлежащие первому параллельному циклу. В результате две или более итераций внешнего цикла могут быть одновременно назначены одному и тому же потоку. Другими словами, в oneTBB выполнение функций, составляющих параллельную конструкцию, является *непоследовательным* даже в пределах одного потока. В большинстве случаев такое поведение безвредно или даже полезно, потому что оно не ограничивает параллелизм, доступный для потока.

source: However, in some cases such unsequenced execution may result in errors. For example, a thread-local variable might unexpectedly change its value after a nested parallel construct:
ru_ru: Однако в некоторых случаях такое непоследовательное выполнение может привести к ошибкам. Например, переменная, локальная для потока, может неожиданно изменить свое значение после вложенной параллельной конструкции:

source: In other scenarios, the described behavior might lead to deadlocks and other issues. In these cases, a stronger guarantee of execution being sequenced within a thread is desired. For that, oneTBB provides ways to *isolate* execution of a parallel construct, for its tasks to not interfere with other simultaneously running tasks.
ru_ru: В других сценариях описанное поведение может привести к тупиковым ситуациям и другим проблемам. В этих случаях требуется более надежная гарантия последовательности выполнения в рамках потока. Для этого OneTBB предоставляет способы *изолировать* выполнение параллельной конструкции, чтобы ее задачи не мешали другим одновременно выполняющимся задачам.

source: One of these ways is to execute the inner level loop in a separate ``task_arena``:
ru_ru: Один из этих способов - выполнение цикла внутреннего уровня в отдельной ``task_arena``:

source: oneapi::tbb::enumerable_thread_specific<int> ets; oneapi::tbb::task_arena nested; oneapi::tbb::parallel_for( 0, N1, [&]( int i ) { // Set a thread specific value ets.local() = i; nested.execute( []{ // Run the inner parallel_for in a separate arena to prevent the thread // from taking tasks of the outer parallel_for. oneapi::tbb::parallel_for( 0, N2, []( int j ) { /* Some work */ } ); } ); assert( ets.local()==i ); // Valid assertion } );
ru_ru: oneapi::tbb::enumerable_thread_specific<int> ets; oneapi::tbb::task_arena nested; oneapi::tbb::parallel_for( 0, N1, [&]( int i ) { // Установите значение для конкретного потока ets.local() = i; nested.execute( []{ // Запустите внутренний parallel_for на отдельной арене, // чтобы поток не забрал задачи внешнего parallel_for. oneapi::tbb::parallel_for( 0, N2, []( int j ) { /* Some work */ } ); } ); assert( ets.local()==i ); // Valid assertion } );

source: However, using a separate arena for work isolation is not always convenient, and might have noticeable overheads. To address these shortcomings, oneTBB provides ``this_task_arena::isolate`` function which runs a user-provided functor in isolation by restricting the calling thread to process only tasks scheduled in the scope of the functor (also called the isolation region).
ru_ru: Однако использование отдельной арены для изоляции работы не всегда удобно и может иметь заметные накладные расходы. Для устранения этих недостатков oneTBB предоставляет функцию ``this_task_arena::isolate``, которая запускает предоставленный пользователем функтор в изоляции, ограничивая вызывающий поток обработкой только задач, запланированных в области действия функтора (также называемой областью изоляции).

source: When entered a task waiting call or a blocking parallel construct inside an isolated region, a thread can only execute tasks spawned within the region and their child tasks spawned by other threads. The thread is prohibited from executing any outer level tasks or tasks belonging to other isolated regions.
ru_ru: Когда вводится вызов ожидания задачи или блокирующая параллельная конструкция внутри изолированного региона, поток может выполнять только задачи, порожденные внутри региона, и их дочерние задачи, порожденные другими потоками. Потоку запрещено выполнять любые задачи внешнего уровня или задачи, принадлежащие другим изолированным регионам.

source: The isolation region imposes restrictions only upon the thread that called it. Other threads running in the same task arena have no restrictions on task selection unless isolated by a distinct call to ``this_task_arena::isolate``.
ru_ru: Область изоляции накладывает ограничения только на тот поток, который её вызвал. Другие потоки, работающие в той же области задач, не имеют ограничений на выбор задач, если только они не изолированы отдельным вызовом ``this_task_arena::isolate``.

source: The following example demonstrates the use of ``this_task_arena::isolate`` to ensure that a thread-local variable is not changed unexpectedly during the call to a nested parallel construct.
ru_ru: Следующий пример демонстрирует использование ``this_task_arena::isolate`` для обеспечения того, чтобы переменная, локальная для потока, не была неожиданно изменена во время вызова вложенной параллельной конструкции.

source: #include "oneapi/tbb/task_arena.h" #include "oneapi/tbb/parallel_for.h" #include "oneapi/tbb/enumerable_thread_specific.h" #include <cassert> int main() { const int N1 = 1000, N2 = 1000; oneapi::tbb::enumerable_thread_specific<int> ets; oneapi::tbb::parallel_for( 0, N1, [&ets]( int i ) { // Set a thread specific value ets.local() = i; // Run the second parallel loop in an isolated region to prevent the current thread // from taking tasks related to the outer parallel loop. oneapi::tbb::this_task_arena::isolate( []{ oneapi::tbb::parallel_for( 0, N2, []( int j ) { /* Some work */ } ); } ); assert( ets.local()==i ); // Valid assertion } ); return 0; }
ru_ru: #include "oneapi/tbb/task_arena.h" #include "oneapi/tbb/parallel_for.h" #include "oneapi/tbb/enumerable_thread_specific.h" #include <cassert> int main() { const int N1 = 1000, N2 = 1000; oneapi::tbb::enumerable_thread_specific<int> ets; oneapi::tbb::parallel_for( 0, N1, [&ets]( int i ) { // Установите значение для конкретного потока ets.local() = i; // Запустите второй параллельный цикл в изолированной области, чтобы предотвратить // выполнение текущим потоком задач, связанных с внешним параллельным циклом. oneapi::tbb::this_task_arena::isolate( []{ oneapi::tbb::parallel_for( 0, N2, []( int j ) { /* Some work */ } ); } ); assert( ets.local()==i ); // Valid assertion } ); return 0; }
