Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/intro/Benefits.po
Languages: ru_ru

source: |short_name| Benefits
ru_ru: Преимущества |short_name|

source: |full_name| is a library that helps you leverage multi-core performance without having to be a threading expert. Typically you can improve performance for multi-core processors by implementing the key points explained in the early sections of the Developer Guide. As your expertise grows, you may want to dive into more complex subjects that are covered in advanced sections.
ru_ru: |full_name| - это библиотека, которая поможет вам использовать производительность многоядерных процессоров без необходимости быть экспертом в области потоков. Как правило, вы можете повысить производительность многоядерных процессоров, выполнив ключевые моменты, описанные в первых разделах руководства разработчика. По мере роста вашего опыта вы можете захотеть погрузиться в более сложные темы, которые рассматриваются в продвинутых разделах.

source: There are a variety of approaches to parallel programming, ranging from using platform-dependent threading primitives to exotic new languages. The advantage of oneTBB is that it works at a higher level than raw threads, yet does not require exotic languages or compilers. You can use it with any compiler supporting ISO C++. The library differs from typical threading packages in the following ways:
ru_ru: Существует множество подходов к параллельному программированию, начиная от использования примитивов потоков, зависящих от платформы, и заканчивая экзотическими новыми языками. Преимущество oneTBB в том, что он работает на более высоком уровне, чем сырые потоки, но при этом не требует экзотических языков или компиляторов. Вы можете использовать ее с любым компилятором, поддерживающим ISO C++. Библиотека отличается от типичных пакетов для работы с потоками следующим образом:

source: **oneTBB enables you to specify logical paralleism instead of threads**. Most threading packages require you to specify threads. Programming directly in terms of threads can be tedious and lead to inefficient programs, because threads are low-level, heavy constructs that are close to the hardware. Direct programming with threads forces you to efficiently map logical tasks onto threads. In contrast, the oneTBB run-time library automatically maps logical parallelism onto threads in a way that makes efficient use of processor resources.
ru_ru: **oneTBB позволяет вам указывать логический параллелизм вместо потоков**. Большинство пакетов для работы с потоками требуют указания потоков. Программирование непосредственно в терминах потоков может быть утомительным и приводить к неэффективным программам, поскольку потоки - это низкоуровневые, тяжелые конструкции, близкие к аппаратным средствам. Прямое программирование с использованием потоков заставляет вас эффективно отображать логические задачи на потоки. В отличие от этого, библиотека времени выполнения oneTBB автоматически сопоставляет логический параллелизм с потоками таким образом, чтобы эффективно использовать ресурсы процессора.

source: **oneTBB targets threading for performance**. Most general-purpose threading packages support many different kinds of threading, such as threading for asynchronous events in graphical user interfaces. As a result, general-purpose packages tend to be low-level tools that provide a foundation, not a solution. Instead, oneTBB focuses on the particular goal of parallelizing computationally intensive work, delivering higher-level, simpler solutions.
ru_ru: **oneTBB нацелен на потоковую обработку для повышения производительности**. Большинство пакетов потоков общего назначения поддерживают множество различных видов потоков, например, потоки для асинхронных событий в графических пользовательских интерфейсах. В результате пакеты общего назначения, как правило, являются низкоуровневыми инструментами, которые обеспечивают основу, а не решение. Вместо этого oneTBB фокусируется на конкретной цели распараллеливания интенсивных вычислений, предоставляя более высокоуровневые и простые решения.

source: **oneTBB is compatible with other threading packages.** Because the library is not designed to address all threading problems, it can coexist seamlessly with other threading packages.
ru_ru: **oneTBB совместима с другими потоковыми пакетами.** Поскольку библиотека не предназначена для решения всех проблем потоковой обработки, она может органично сосуществовать с другими потоковыми пакетами.

source: **oneTBB emphasizes scalable, data parallel programming**. Breaking a program up into separate functional blocks, and assigning a separate thread to each block is a solution that typically does not scale well since typically the number of functional blocks is fixed. In contrast, oneTBB emphasizes *data-parallel* programming, enabling multiple threads to work on different parts of a collection. Data-parallel programming scales well to larger numbers of processors by dividing the collection into smaller pieces. With data-parallel programming, program performance increases as you add processors.
ru_ru: **oneTBB делает упор на масштабируемое, параллельное программирование по данным**. Разбиение программы на отдельные функциональные блоки и назначение отдельного потока для каждого блока - это решение, которое обычно плохо масштабируется, поскольку обычно количество функциональных блоков фиксировано. В отличие от этого, oneTBB делает упор на *параллельное программирование по данным*, позволяя нескольким потокам работать над различными частями коллекции. Параллельное программирование данных хорошо масштабируется на большее количество процессоров за счет разделения коллекции на более мелкие части. При параллельном программировании данных производительность программы увеличивается по мере добавления процессоров.

source: **oneTBB relies on generic programming**. Traditional libraries specify interfaces in terms of specific types or base classes. Instead, oneAPI Threading Building Blocks uses generic programming. The essence of generic programming is writing the best possible algorithms with the fewest constraints. The C++ Standard Template Library (STL) is a good example of generic programming in which the interfaces are specified by *requirements* on types. For example, C++ STL has a template function ``sort`` that sorts a sequence abstractly defined in terms of iterators on the sequence. The requirements on the iterators are:
ru_ru: **oneTBB полагается на общее программирование**. Традиционные библиотеки определяют интерфейсы в терминах конкретных типов или базовых классов. Вместо этого oneAPI Threading Building Blocks использует обобщенное программирование. Суть обобщенного программирования заключается в написании наилучших возможных алгоритмов с наименьшими ограничениями. Библиотека стандартных шаблонов C++ (STL) является хорошим примером обобщенного программирования, в котором интерфейсы задаются *требованиями* к типам. Например, в C++ STL есть шаблонная функция ``sort``, которая сортирует последовательность, абстрактно определенную в терминах итераторов последовательности. Требования к итераторам таковы:

source: Provide random access
ru_ru: Обеспечить произвольный доступ

source: The expression ``*i<*j`` is true if the item pointed to by iterator ``i`` should precede the item pointed to by iterator ``j``, and false otherwise.
ru_ru: Выражение ``*i<*j`` истинно, если элемент, на который указывает итератор ``i``, должен предшествовать элементу, на который указывает итератор ``j``, и ложно в противном случае.

source: The expression ``swap(*i,*j)`` swaps two elements.
ru_ru: Выражение ``swap(*i,*j)`` меняет местами два элемента.

source: Specification in terms of requirements on types enables the template to sort many different representations of sequences, such as vectors and deques. Similarly, the oneTBB templates specify requirements on types, not particular types, and thus adapt to different data representations. Generic programming enables oneTBB to deliver high performance algorithms with broad applicability.
ru_ru: Спецификация в терминах требований к типам позволяет шаблону сортировать множество различных представлений последовательностей, таких как векторы и двусвязные списки. Аналогично, шаблоны oneTBB определяют требования к типам, а не к конкретным типам, и таким образом адаптируются к различным представлениям данных. Общее программирование позволяет oneTBB создавать высокопроизводительные алгоритмы с широким применением.
