Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/intro/notation.po
Languages: ru_ru

source: Notational Conventions
ru_ru: Условные обозначения

source: The following conventions may be used in this document.
ru_ru: В данном документе могут использоваться следующие условные обозначения.

source: Convention
ru_ru: Соглашение

source: Explanation
ru_ru: Пояснение

source: Example
ru_ru: Пример

source: \ *Italic*
ru_ru: \ *курсив*

source: Used for introducing new terms, denotation of terms, placeholders, or titles of manuals.
ru_ru: Используется для введения новых терминов, обозначения терминов, обозначений или названий пособий.

source: The filename consists of the *basename* and the *extension*.
ru_ru: Имя файла состоит из *базового имени* и *расширения*.

source: \ ``Monospace``
ru_ru: \ ``моноширинный``

source: Indicates directory paths and filenames, commands and command line options, function names, methods, classes, data structures in body text, source code.
ru_ru: Указывает пути к каталогам и имена файлов, команды и опции командной строки, имена функций, методов, классов, структур данных в основном тексте, исходном коде.

source: \ ``ippsapi.h`` \ ``\alt\include`` Use the okCreateObjs() function to... \ ``printf("hello, world\n");``
ru_ru: \ ``ippsapi.h`` \ ``alt\include`` Используйте функцию okCreateObjs(), чтобы... \ ``printf("hello, world\n");``

source: Items enclosed in brackets are optional.
ru_ru: Элементы, заключенные в скобки, являются необязательными.

source: Fa[c] Indicates Fa or Fac.
ru_ru: Fa[c] Указывает на Fa или Fac.

source: Braces and vertical bars indicate the choice of one item from a selection of two or more items.
ru_ru: Скобки и вертикальные полосы указывают на выбор одного предмета из двух или более предметов.

source: X{K \| W \| P} Indicates XK, XW, or XP.
ru_ru: X{K \| W \| P} Указывает на XK, XW или XP.

source: Writing a metacharacter in quotation marks negates the syntactical meaning stated above; | the character is taken as a literal.
ru_ru: Запись метасимвола в кавычках отрицает синтаксическое значение, указанное выше; символ | воспринимается как литерал.

source: "[" X "]" [ Y ] Denotes the letter X enclosed in brackets, optionally followed by the letter Y.
ru_ru: "[" X "]" [ Y ] Обозначает букву X, заключенную в скобки, за которой по желанию следует буква Y.

source: The ellipsis indicates that the previous item can be repeated several times.
ru_ru: Многоточие означает, что предыдущий пункт может быть повторен несколько раз.

source: \ ``filename`` ... Indicates that one or more filenames can be specified.
ru_ru: \ ``filename`` ... Указывает, что может быть указано одно или несколько имен файлов.

source: The ellipsis preceded by a comma indicates that the previous item can be repeated several times, | separated by commas.
ru_ru: Многоточие перед запятой означает, что предыдущий пункт может быть повторен несколько раз,| разделенных запятыми.

source: \ ``word`` ,... Indicates that one or more words can be specified. If more than one word is specified, the words are comma-separated.
ru_ru: \ ``word`` ,... Указывает, что может быть указано одно или несколько слов. Если указано более одного слова, слова разделяются запятыми.

source: Class members are summarized by informal class declarations that describe the class as it seems to clients, not how it is actually implemented. For example, here is an informal declaration of class ``Foo``:
ru_ru: Члены класса обобщаются неформальными объявлениями класса, которые описывают класс так, как он представляется клиентам, а не так, как он реализован на самом деле. Например, вот неформальное объявление класса ``Foo'':

source: The actual implementation might look like:
ru_ru: Фактическая реализация может выглядеть следующим образом:

source: The example shows two cases where the actual implementation departs from the informal declaration:
ru_ru: В примере показаны два случая, когда фактическая реализация отличается от неформальной декларации:

source: ``Foo`` is actually a typedef to ``Foo_v3``.
ru_ru: ``Foo`` на самом деле является определением типа ``Foo_v3``.

source: Method ``x()`` is inherited from a protected base class.
ru_ru: Метод ``x()`` унаследован от защищенного базового класса.

source: The destructor is an implicit method generated by the compiler.
ru_ru: Деструктор - это неявный метод, генерируемый компилятором.

source: The informal declarations are intended to show you what you need to know to use the class without the distraction of irrelevant clutter particular to the implementation.
ru_ru: Неформальные объявления предназначены для того, чтобы показать вам все, что нужно знать для использования класса, не отвлекаясь на несущественный беспорядок, характерный для реализации.
