Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Migration_Guide/Task_Scheduler_Init.po
Languages: ru_ru

source: Migrating from tbb::task_scheduler_init
ru_ru: Переход от tbb::task_scheduler_init

source: ``tbb::task_scheduler_init`` was a multipurpose functionality in the previous versions of Threading Building Blocks (TBB). This section considers different use cases and how they can be covered with oneTBB.
ru_ru: ``tbb::task_scheduler_init`` был многоцелевой функциональностью в предыдущих версиях Threading Building Blocks (TBB). В этом разделе рассматриваются различные случаи использования и то, как они могут быть охвачены с помощью oneTBB.

source: Managing the number of threads
ru_ru: Управление количеством потоков

source: Querying the default number of threads
ru_ru: Запрос количества нитей по умолчанию

source: `oneapi::tbb::info::default_concurrency() <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/info_namespace.html>`_ returns the maximum concurrency that will be created by *default* in implicit or explicit ``task_arena``.
ru_ru: `oneapi::tbb::info::default_concurrency() <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/info_namespace.html>`_ возвращает максимальный параллелизм, который будет создан *по умолчанию* в неявной или явной ``task_arena``.

source: `oneapi::tbb::this_task_arena::max_concurrency() <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/this_task_arena_ns.html>`_ returns the maximum number of threads available for the parallel algorithms within the current context (or *default* if an implicit arena is not initialized)
ru_ru: `oneapi::tbb::this_task_arena::max_concurrency() <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/this_task_arena_ns.html>`_ возвращает максимальное количество потоков, доступных для параллельных алгоритмов в рамках текущего контекста (или *по умолчанию*, если неявная арена не инициализирована)

source: `oneapi::tbb::global_control::active_value(tbb::global_control::max_allowed_parallelism) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ returns the current limit of the thread pool (or *default* if oneTBB scheduler is not initialized)
ru_ru: `oneapi::tbb::global_control::active_value(tbb::global_control::max_allowed_parallelism) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ возвращает текущий предел пула потоков (или *по умолчанию*, если планировщик oneTBB не инициализирован)

source: Setting the maximum concurrency
ru_ru: Установка максимального параллелизма

source: `task_arena(/* max_concurrency */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/this_task_arena_ns.html>`_ limits the maximum concurrency of the parallel algorithm running inside ``task_arena``
ru_ru: `task_arena(/* max_concurrency */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/this_task_arena_ns.html>`_ ограничивает максимальный параллельный параллельный алгоритм, запущенный внутри ``task_arena``

source: `tbb::global_control(tbb::global_control::max_allowed_parallelism, /* max_concurrency */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ limits the total number of oneTBB worker threads
ru_ru: `tbb::global_control(tbb::global_control::max_allowed_parallelism, /* max_concurrency */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ ограничивает общее количество рабочих потоков OneTBB

source: Examples
ru_ru: Примеры

source: The default parallelism:
ru_ru: Параллелизм по умолчанию:

source: The limited parallelism:
ru_ru: Ограниченный параллелизм:

source: Setting thread stack size
ru_ru: Установка размера стека нитей

source: Use `oneapi::tbb::global_control(oneapi::tbb::global_control::thread_stack_size, /* stack_size */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ to set the stack size for oneTBB worker threads:
ru_ru: Используй `oneapi::tbb::global_control(oneapi::tbb::global_control::thread_stack_size, /* stack_size */) <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/global_control_cls.html>`_ для установки размера стека для рабочих потоков oneTBB:

source: Terminating oneTBB scheduler
ru_ru: Прекращение работы планировщика oneTBB

source: :ref:`task_scheduler_handle_reference` allows waiting for oneTBB worker threads completion:
ru_ru: :ref:`task_scheduler_handle_reference` позволяет ждать завершения рабочих потоков oneTBB:
