Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/tbb_userguide/Migration_Guide/Task_API.po
Languages: ru_ru

source: Migrating from low-level task API
ru_ru: Переход от низкоуровневого API задач

source: The low-level task API of Intel(R) Threading Building Blocks (TBB) was considered complex and hence error-prone, which was the primary reason it had been removed from oneAPI Threading Building Blocks (oneTBB). This guide helps with the migration from TBB to oneTBB for the use cases where low-level task API is used.
ru_ru: Низкоуровневый API задач в Intel(R) Threading Building Blocks (TBB) считался сложным и, следовательно, подверженным ошибкам, что стало основной причиной его удаления из oneAPI Threading Building Blocks (oneTBB). Это руководство поможет в миграции с TBB на oneTBB для тех случаев использования, когда применяется низкоуровневый API задач.

source: Spawning of individual tasks
ru_ru: Размножение отдельных задач

source: For most use cases, the spawning of individual tasks can be replaced with the use of either ``oneapi::tbb::task_group`` or ``oneapi::tbb::parallel_invoke``.
ru_ru: Для большинства случаев использования порождение отдельных задач можно заменить использованием ``oneapi::tbb::task_group`` или ``oneapi::tbb::parallel_invoke``.

source: For example, ``RootTask``, ``ChildTask1``, and ``ChildTask2`` are the user-side functors that inherit ``tbb::task`` and implement its interface. Then spawning of ``ChildTask1`` and ``ChildTask2`` tasks that can execute in parallel with each other and waiting on the ``RootTask`` is implemented as:
ru_ru: Например, ``RootTask``, ``ChildTask1`` и ``ChildTask2`` - это пользовательские функторы, которые наследуют ``tbb::task`` и реализуют его интерфейс. Тогда порождение задач ``ChildTask1`` и ``ChildTask2``, которые могут выполняться параллельно друг с другом и ожидать ``RootTask``, реализуется следующим образом:

source: #include <tbb/task.h> int main() { // Assuming RootTask, ChildTask1, and ChildTask2 are defined. RootTask& root = *new(tbb::task::allocate_root()) RootTask{}; ChildTask1& child1 = *new(root.allocate_child()) ChildTask1{/*params*/}; ChildTask2& child2 = *new(root.allocate_child()) ChildTask2{/*params*/}; root.set_ref_count(3); tbb::task::spawn(child1); tbb::task::spawn(child2); root.wait_for_all(); }
ru_ru: #include <tbb/task.h> int main() { // Предположим, что определены RootTask, ChildTask1 и ChildTask2. RootTask& root = *new(tbb::task::allocate_root()) RootTask{}; ChildTask1& child1 = *new(root.allocate_child()) ChildTask1{/*params*/}; ChildTask2& child2 = *new(root.allocate_child()) ChildTask2{/*params*/}; root.set_ref_count(3); tbb::task::spawn(child1); tbb::task::spawn(child2); root.wait_for_all(); }

source: Using ``oneapi::tbb::task_group``
ru_ru: Использование ``oneapi::tbb::task_group``

source: The code above can be rewritten using ``oneapi::tbb::task_group``:
ru_ru: Код выше можно переписать, используя ``oneapi::tbb::task_group``:

source: #include <oneapi/tbb/task_group.h> int main() { // Assuming ChildTask1, and ChildTask2 are defined. oneapi::tbb::task_group tg; tg.run(ChildTask1{/*params*/}); tg.run(ChildTask2{/*params*/}); tg.wait(); }
ru_ru: #include <oneapi/tbb/task_group.h> int main() { // Предположим, что определены ChildTask1 и ChildTask2. oneapi::tbb::task_group tg; tg.run(ChildTask1{/*params*/}); tg.run(ChildTask2{/*params*/}); tg.wait(); }

source: The code looks more concise now. It also enables lambda functions and does not require you to implement ``tbb::task`` interface that overrides the ``tbb::task* tbb::task::execute()`` virtual method. With this new approach, you work with functors in a C++-standard way by implementing ``void operator() const``:
ru_ru: Теперь код выглядит более лаконичным. Он также включает лямбда-функции и не требует от тебя реализации интерфейса ``tbb::task``, который переопределяет виртуальный метод ``tbb::task* tbb::task::execute()``. С помощью этого нового подхода ты работаешь с функторами стандартным для C++ способом, реализуя ``void operator() const``:

source: Using ``oneapi::tbb::parallel_invoke``
ru_ru: Использование ``oneapi::tbb::parallel_invoke``

source: It is also possible to use ``oneapi::tbb::parallel_invoke`` to rewrite the original code and make it even more concise:
ru_ru: Также можно использовать ``oneapi::tbb::parallel_invoke``, чтобы переписать исходный код и сделать его еще более лаконичным:

source: #include <oneapi/tbb/parallel_invoke.h> int main() { // Assuming ChildTask1, and ChildTask2 are defined. oneapi::tbb::parallel_invoke( ChildTask1{/*params*/}, ChildTask2{/*params*/} ); }
ru_ru: #include <oneapi/tbb/parallel_invoke.h> int main() { // Предположим, что определены ChildTask1 и ChildTask2. oneapi::tbb::parallel_invoke( ChildTask1{/*params*/}, ChildTask2{/*params*/} ); }

source: Adding more work during task execution
ru_ru: Добавление дополнительной работы во время выполнения задания

source: ``oneapi::tbb::parallel_invoke`` follows a blocking style of programming, which means that it completes only when all functors passed to the parallel pattern complete their execution.
ru_ru: ``oneapi::tbb::parallel_invoke`` следует блокирующему стилю программирования, что означает, что он завершается только тогда, когда все функторы, переданные параллельному паттерну, завершают свое выполнение.

source: In TBB, cases when the amount of work is not known in advance and the work needs to be added during the execution of a parallel algorithm were mostly covered by ``tbb::parallel_do`` high-level parallel pattern. The ``tbb::parallel_do`` algorithm logic may be implemented using the task API as:
ru_ru: В TBB случаи, когда количество работы не известно заранее и работу нужно добавить во время выполнения параллельного алгоритма, в основном покрывались высокоуровневым параллельным паттерном ``tbb::parallel_do``. Логика алгоритма ``tbb::parallel_do`` может быть реализована с помощью API задач как:

source: #include <cstddef> #include <vector> #include <tbb/task.h> // Assuming RootTask and OtherWork are defined and implement tbb::task interface. struct Task : public tbb::task { Task(tbb::task& root, int i) : m_root(root), m_i(i) {} tbb::task* execute() override { // ... do some work for item m_i ... if (add_more_parallel_work) { tbb::task& child = *new(m_root.allocate_child()) OtherWork; tbb::task::spawn(child); } return nullptr; } tbb::task& m_root; int m_i; }; int main() { std::vector<int> items = { 0, 1, 2, 3, 4, 5, 6, 7 }; RootTask& root = *new(tbb::task::allocate_root()) RootTask{/*params*/}; root.set_ref_count(items.size() + 1); for (std::size_t i = 0; i < items.size(); ++i) { Task& task = *new(root.allocate_child()) Task(root, items[i]); tbb::task::spawn(task); } root.wait_for_all(); return 0; }
ru_ru: #include <cstddef> #include <vector> #include <tbb/task.h> // Предполагается, что RootTask и OtherWork определены и реализуют tbb::task interface. struct Task : public tbb::task { Task(tbb::task& root, int i) : m_root(root), m_i(i) {} tbb::task* execute() override { // ... выполнять работу за объект m_i ... if (add_more_parallel_work) { tbb::task& child = *new(m_root.allocate_child()) OtherWork; tbb::task::spawn(child); } return nullptr; } tbb::task& m_root; int m_i; }; int main() { std::vector<int> items = { 0, 1, 2, 3, 4, 5, 6, 7 }; RootTask& root = *new(tbb::task::allocate_root()) RootTask{/*params*/}; root.set_ref_count(items.size() + 1); for (std::size_t i = 0; i < items.size(); ++i) { Task& task = *new(root.allocate_child()) Task(root, items[i]); tbb::task::spawn(task); } root.wait_for_all(); return 0; }

source: In oneTBB ``tbb::parallel_do`` interface was removed. Instead, the functionality of adding new work was included into the ``oneapi::tbb::parallel_for_each`` interface.
ru_ru: В oneTBB интерфейс ``tbb::parallel_do`` был удален. Вместо этого функциональность добавления новой работы была включена в интерфейс ``oneapi::tbb::parallel_for_each``.

source: The previous use case can be rewritten in oneTBB as follows:
ru_ru: Предыдущий вариант использования может быть переписан в OneTBB следующим образом:

source: #include <vector> #include <oneapi/tbb/parallel_for_each.h> int main() { std::vector<int> items = { 0, 1, 2, 3, 4, 5, 6, 7 }; oneapi::tbb::parallel_for_each( items.begin(), items.end(), [](int& i, tbb::feeder<int>& feeder) { // ... do some work for item i ... if (add_more_parallel_work) feeder.add(i); } ); }
ru_ru: #include <vector> #include <oneapi/tbb/parallel_for_each.h> int main() { std::vector<int> items = { 0, 1, 2, 3, 4, 5, 6, 7 }; oneapi::tbb::parallel_for_each( items.begin(), items.end(), [](int& i, tbb::feeder<int>& feeder) { // ... выполнять работу за объект i ... if (add_more_parallel_work) feeder.add(i); } ); }

source: Since both TBB and oneTBB support nested expressions, you can run additional functors from within an already running functor.
ru_ru: Поскольку и TBB, и oneTBB поддерживают вложенные выражения, ты можешь запускать дополнительные функторы изнутри уже запущенного функтора.

source: The previous use case can be rewritten using ``oneapi::tbb::task_group`` as:
ru_ru: Предыдущий вариант использования можно переписать, используя ``oneapi::tbb::task_group`` как:

source: Task recycling
ru_ru: Повтор заданий

source: You can re-run the functor by passing ``*this`` to the ``oneapi::tbb::task_group::run()`` method. The functor will be copied in this case. However, its state can be shared among instances:
ru_ru: Ты можешь повторно запустить функтор, передав ``*this`` методу ``oneapi::tbb::task_group::run()``. Функтор в этом случае будет скопирован. Однако его состояние может быть разделено между экземплярами:

source: Such patterns are particularly useful when the work within a functor is not completed but there is a need for the task scheduler to react to outer circumstances, such as cancellation of group execution. To avoid issues with concurrent access, it is recommended to submit it for re-execution as the last step:
ru_ru: Такие паттерны особенно полезны в тех случаях, когда работа внутри функтора не завершена, но есть необходимость, чтобы планировщик задач реагировал на внешние обстоятельства, например, отмену выполнения группы. Чтобы избежать проблем с одновременным доступом, рекомендуется отправлять его на повторное выполнение в качестве последнего шага:

source: #include <memory> #include <oneapi/tbb/task_group.h> struct SharedStateFunctor { std::shared_ptr<Data> m_shared_data; oneapi::tbb::task_group& m_task_group; void operator()() const { // do some work processing m_shared_data if (need_to_yield) { m_task_group.run(*this); return; } } }; int main() { // Assuming Data is defined. std::shared_ptr<Data> data = std::make_shared<Data>(/*params*/); oneapi::tbb::task_group tg; tg.run(SharedStateFunctor{data, tg}); tg.wait(); }
ru_ru: #include <memory> #include <oneapi/tbb/task_group.h> struct SharedStateFunctor { std::shared_ptr<Data> m_shared_data; oneapi::tbb::task_group& m_task_group; void operator()() const { // выполнить определенную обработку m_shared_data if (need_to_yield) { m_task_group.run(*this); return; } } }; int main() { // Предполагается, что данные определены. std::shared_ptr<Data> data = std::make_shared<Data>(/*params*/); oneapi::tbb::task_group tg; tg.run(SharedStateFunctor{data, tg}); tg.wait(); }

source: Recycling as child or continuation
ru_ru: Повтор как ребенок или продолжение

source: In oneTBB this kind of recycling is done manually. You have to track when it is time to run the task:
ru_ru: В OneTBB такая переработка выполняется вручную. Ты должен отслеживать, когда наступает время выполнения задания:

source: #include <cstddef> #include <vector> #include <atomic> #include <cassert> #include <oneapi/tbb/task_group.h> struct ContinuationTask { ContinuationTask(std::vector<int>& data, int& result) : m_data(data), m_result(result) {} void operator()() const { for (const auto& item : m_data) m_result += item; } std::vector<int>& m_data; int& m_result; }; struct ChildTask { ChildTask(std::vector<int>& data, int& result, std::atomic<std::size_t>& tasks_left, std::atomic<std::size_t>& tasks_done, oneapi::tbb::task_group& tg) : m_data(data), m_result(result), m_tasks_left(tasks_left), m_tasks_done(tasks_done), m_tg(tg) {} void operator()() const { std::size_t index = --m_tasks_left; m_data[index] = produce_item_for(index); std::size_t done_num = ++m_tasks_done; if (index % 2 != 0) { // Recycling as child m_tg.run(*this); return; } else if (done_num == m_data.size()) { assert(m_tasks_left == 0); // Spawning a continuation that does reduction m_tg.run(ContinuationTask(m_data, m_result)); } } std::vector<int>& m_data; int& m_result; std::atomic<std::size_t>& m_tasks_left; std::atomic<std::size_t>& m_tasks_done; oneapi::tbb::task_group& m_tg; }; int main() { int result = 0; std::vector<int> items(10, 0); std::atomic<std::size_t> tasks_left{items.size()}; std::atomic<std::size_t> tasks_done{0}; oneapi::tbb::task_group tg; for (std::size_t i = 0; i < items.size(); i+=2) { tg.run(ChildTask(items, result, tasks_left, tasks_done, tg)); } tg.wait(); }
ru_ru: #include <cstddef> #include <vector> #include <atomic> #include <cassert> #include <oneapi/tbb/task_group.h> struct ContinuationTask { ContinuationTask(std::vector<int>& data, int& result) : m_data(data), m_result(result) {} void operator()() const { for (const auto& item : m_data) m_result += item; } std::vector<int>& m_data; int& m_result; }; struct ChildTask { ChildTask(std::vector<int>& data, int& result, std::atomic<std::size_t>& tasks_left, std::atomic<std::size_t>& tasks_done, oneapi::tbb::task_group& tg) : m_data(data), m_result(result), m_tasks_left(tasks_left), m_tasks_done(tasks_done), m_tg(tg) {} void operator()() const { std::size_t index = --m_tasks_left; m_data[index] = produce_item_for(index); std::size_t done_num = ++m_tasks_done; if (index % 2 != 0) { // Обработка дочерних m_tg.run(*this); return; } else if (done_num == m_data.size()) { assert(m_tasks_left == 0); // Порождение продолжения, которое выполняет свертку m_tg.run(ContinuationTask(m_data, m_result)); } } std::vector<int>& m_data; int& m_result; std::atomic<std::size_t>& m_tasks_left; std::atomic<std::size_t>& m_tasks_done; oneapi::tbb::task_group& m_tg; }; int main() { int result = 0; std::vector<int> items(10, 0); std::atomic<std::size_t> tasks_left{items.size()}; std::atomic<std::size_t> tasks_done{0}; oneapi::tbb::task_group tg; for (std::size_t i = 0; i < items.size(); i+=2) { tg.run(ChildTask(items, result, tasks_left, tasks_done, tg)); } tg.wait(); }

source: Scheduler Bypass
ru_ru: Обход планировщика

source: TBB ``task::execute()`` method can return a pointer to a task that can be executed next by the current thread. This might reduce scheduling overheads compared to direct ``spawn``. Similar to ``spawn``, the returned task is not guaranteed to be executed next by the current thread.
ru_ru: Метод TBB ``task::execute()`` может возвращать указатель на задачу, которая может быть выполнена следующей текущим потоком. Это может снизить накладные расходы на планирование по сравнению с прямым ``spawn``. Как и в случае с ``spawn``, возвращенная задача не гарантируется, что она будет выполнена следующей текущим потоком.

source: In oneTBB, this can be done using ``oneapi::tbb::task_group``.
ru_ru: В oneTBB это можно сделать с помощью ``oneapi::tbb::task_group``.

source: Here ``oneapi::tbb::task_group::defer`` adds a new task into the ``tg``. However, the task is not put into a queue of tasks ready for execution via ``oneapi::tbb::task_group::run``, but bypassed to the executing thread directly via function return value.
ru_ru: Здесь ``oneapi::tbb::task_group::defer`` добавляет новую задачу в ``tg``. Однако задача не помещается в очередь задач, готовых к выполнению через ``oneapi::tbb::task_group::run``, а передается исполняющему потоку напрямую через возвращаемое значение функции.

source: Deferred task creation
ru_ru: Отложенное создание задачи

source: The TBB low-level task API separates the task creation from the actual spawning. This separation allows to postpone the task spawning, while the parent task and final result production are blocked from premature leave. For example, ``RootTask``, ``ChildTask``, and ``CallBackTask`` are the user-side functors that inherit ``tbb::task`` and implement its interface. Then, blocking the ``RootTask`` from leaving prematurely and waiting on it is implemented as follows:
ru_ru: Низкоуровневый API задач TBB отделяет создание задачи от фактического порождения. Это разделение позволяет отложить порождение задачи, в то время как родительская задача и производство конечного результата блокируются от преждевременного выхода. Например, ``RootTask``, ``ChildTask`` и ``CallBackTask`` - это пользовательские функторы, которые наследуют ``tbb::task`` и реализуют его интерфейс. Далее, блокировка ``RootTask`` от преждевременного выхода и ожидание на ней реализуется следующим образом:

source: Here ``oneapi::tbb::task_group::defer`` adds a new task into the ``tg``. However, the task is not spawned until ``oneapi::tbb::task_arena::enqueue`` is called.
ru_ru: Здесь ``oneapi::tbb::task_group::defer`` добавляет новую задачу в ``tg``. Однако задача не порождается до тех пор, пока не будет вызвана ``oneapi::tbb::task_arena::enqueue``.

source: The call to ``oneapi::tbb::task_group::wait`` will not return control until both ``ChildTask`` and ``CallBackTask`` are executed.
ru_ru: Вызов ``oneapi::tbb::task_group::wait`` не вернет управление, пока не будут выполнены и ``ChildTask``, и ``CallBackTask``.
