Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/concurrent_lru_cache_cls.po
Languages: ru_ru

source: To enable this feature, define the ``TBB_PREVIEW_CONCURRENT_LRU_CACHE`` macro to 1.
ru_ru: Чтобы включить эту функцию, установите макрос ``TBB_PREVIEW_CONCURRENT_LRU_CACHE`` в 1.

source: A Class Template for Least Recently Used cache with concurrent operations.
ru_ru: Шаблон класса для кэша Least Recently Used с одновременными операциями.

source: Description
ru_ru: Описание

source: A ``concurrent_lru_cache`` container maps keys to values with the ability to limit the number of stored unused values. For each key, there is at most one item stored in the container.
ru_ru: Контейнер ``concurrent_lru_cache`` отображает ключи на значения с возможностью ограничения количества хранимых неиспользуемых значений. Для каждого ключа в контейнере хранится не более одного элемента.

source: The container permits multiple threads to concurrently retrieve items from it.
ru_ru: Контейнер позволяет нескольким потокам одновременно извлекать из него элементы.

source: The container tracks which items are in use by returning a proxy ``concurrent_lru_cache::handle`` object that refers to an item instead of its value. Once there are no ``handle`` objects holding reference to an item, it is considered unused.
ru_ru: Контейнер отслеживает, какие элементы используются, возвращая прокси-объект ``concurrent_lru_cache::handle``, который ссылается на элемент вместо его значения. Если нет объектов ``handle``, ссылающихся на элемент, он считается неиспользуемым.

source: The container stores all the items that are currently in use plus a limited number of unused items. Excessive unused items are erased according to least recently used policy.
ru_ru: В контейнере хранятся все используемые в данный момент элементы плюс ограниченное количество неиспользуемых элементов. Избыток неиспользуемых элементов стирается в соответствии с политикой наименьшего последнего использования.

source: When no item is found for a given key, the container calls the user-specified ``value_function_type`` object to construct a value for the key, and stores that value. The ``value_function_type`` object must be thread-safe.
ru_ru: Если для данного ключа не найдено ни одного элемента, контейнер вызывает указанный пользователем объект ``value_function_type`` для построения значения для ключа и сохраняет это значение. Объект ``value_function_type`` должен быть потокобезопасным.

source: Header
ru_ru: Заголовок

source: Synopsis
ru_ru: Описание

source: Member Functions
ru_ru: Функции-члены

source: **Effects**: Constructs an empty cache that can keep up to ``number_of_lru_history_items`` unused values, with a function object ``f`` for constructing new values.
ru_ru: **Эффекты**: Создает пустой кэш, который может хранить до ``number_of_lru_history_items`` неиспользованных значений, с функтором ``f`` для создания новых значений.

source: **Effects**: Destroys the ``concurrent_lru_cache``. Calls the destructors of the stored elements and deallocates the used storage.
ru_ru: **Эффекты**: Уничтожает ``concurrent_lru_cache``. Вызывает деструкторы сохраненных элементов и деаллоцирует использованное хранилище.

source: The behavior is undefined in case of concurrent operations with ``*this``.
ru_ru: Поведение не определено в случае одновременных операций с ``*this``.

source: **Effects**: Searches the container for an item that corresponds to the given key. If such an item is not found, the user-specified function object is called to construct a value that is inserted into the container.
ru_ru: **Эффекты**: Поиск в контейнере элемента, соответствующего заданному ключу. Если такой элемент не найден, вызывается указанный пользователем функтор для создания значения, которое вставляется в контейнер.

source: **Returns**: a ``handle`` object holding reference to the matching value.
ru_ru: **Возвращает**: объект ``handle``, содержащий ссылку на соответствующее значение.

source: Member Objects
ru_ru: Объекты-члены

source: ``handle`` class
ru_ru: класс ``handle``

source: **Member Functions**
ru_ru: **Функции-члены**

source: **Effects**: Constructs a ``handle`` object that does not refer to any value.
ru_ru: **Эффекты**: Создает объект ``handle``, который не ссылается ни на какое значение.

source: **Effects**: Transfers the reference to the value stored in ``concurrent_lru_cache`` from ``other`` to the newly constructed object. Upon completion, ``other`` no longer refers to any value.
ru_ru: **Эффекты**: Передает ссылку на значение, хранящееся в ``concurrent_lru_cache``, из ``other`` в новый построенный объект. После завершения ``other`` больше не ссылается ни на какое значение.

source: **Effects**: Releases the reference (if it exists) to a value stored in ``concurrent_lru_cache``.
ru_ru: **Эффекты**: Освобождает ссылку (если она существует) на значение, хранящееся в ``concurrent_lru_cache``.

source: The behavior is undefined for concurrent operations with ``*this``.
ru_ru: Поведение не определено для одновременных операций с ``*this``.

source: **Effects**: Transfers the reference to a value stored in ``concurrent_lru_cache`` from ``other`` to ``*this``. If existed, the previous reference held by ``*this`` is released. Upon completion ``other`` no longer refers to any value.
ru_ru: **Эффекты**: Передает ссылку на значение, хранящееся в ``concurrent_lru_cache``, от ``other`` к ``*this``. Если существовала, предыдущая ссылка, хранившаяся в ``*this``, освобождается. После завершения ``other`` больше не ссылается ни на какое значение.

source: **Returns**: a reference to ``*this``.
ru_ru: **Возвращает**: ссылку на ``*this``.

source: **Returns**: ``true`` if ``*this`` holds reference to a value, ``false`` otherwise.
ru_ru: **Возвращает**: ``true``, если ``*this`` содержит ссылку на значение, ``false`` в противном случае.

source: **Returns**: a reference to a ``value_type`` object stored in ``concurrent_lru_cache``.
ru_ru: **Возвращает**: ссылку на объект ``value_type``, хранящийся в ``concurrent_lru_cache``.

source: The behavior is undefined if ``*this`` does not refer to any value.
ru_ru: Поведение не определено, если ``*this`` не ссылается на какое-либо значение.
