Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/constraints_extensions.po
Languages: ru_ru

source: task_arena::constraints extensions
ru_ru: Расширение task_arena::constraints

source: To enable this feature, set the ``TBB_PREVIEW_TASK_ARENA_CONSTRAINTS_EXTENSION`` macro to 1.
ru_ru: Чтобы включить эту функцию, установи макрос ``TBB_PREVIEW_TASK_ARENA_CONSTRAINTS_EXTENSION`` в значение 1.

source: Description
ru_ru: Описание

source: These extensions allow to customize ``tbb::task_arena::constraints`` with the following properties:
ru_ru: Эти расширения позволяют настраивать ``tbb::task_arena::constraints`` со следующими свойствами:

source: On machines with Intel® Hybrid Technology set the preferred core type for threads working within the task arena.
ru_ru: На машинах с технологией Intel® Hybrid Technology установить предпочтительный тип ядра для потоков, работающих в области задач.

source: Limit the maximum number of threads that can be scheduled to one core simultaneously.
ru_ru: Ограничить максимальное количество потоков, которые могут быть запланированы на одном ядре одновременно.

source: Header
ru_ru: Заголовок

source: Synopsis
ru_ru: Описание

source: Member Functions
ru_ru: Функции-члены

source: Sets the ``numa_id`` field to the ``id``.
ru_ru: Устанавливает поле ``numa_id`` в значение ``id``.

source: **Returns:** Reference to ``*this``.
ru_ru: **Возвращает**: ссылку на ``*this``.

source: Sets the ``max_concurrency`` field to the ``maximal_concurrency``.
ru_ru: Устанавливает поле ``max_concurrency`` в значение ``maximal_concurrency``.

source: Sets the ``core_type`` field to the ``id``.
ru_ru: Устанавливает поле ``core_type`` на ``id``.

source: Sets the ``max_threads_per_core`` field to the ``threads_number``.
ru_ru: Устанавливает поле ``max_threads_per_core`` в значение ``threads_number``.

source: Member Objects
ru_ru: Объекты-члены

source: An integral logical index uniquely identifying a NUMA node. All threads joining the ``task_arena`` are bound to this NUMA node.
ru_ru: Интегральный логический индекс, однозначно идентифицирующий узел NUMA. Все потоки, присоединяющиеся к ``task_arena``, привязываются к этому NUMA-узлу.

source: To obtain a valid NUMA node ID, call ``oneapi::tbb::info::numa_nodes()``.
ru_ru: Чтобы получить действительный идентификатор NUMA-узла, вызови ``oneapi::tbb::info::numa_nodes()``.

source: The maximum number of threads that can participate in work processing within the ``task_arena`` at the same time.
ru_ru: Максимальное количество потоков, которые могут одновременно участвовать в обработке работы в пределах ``task_arena``.

source: An integral logical index uniquely identifying a core type. All threads joining the ``task_arena`` are bound to this core type.
ru_ru: Интегральный логический индекс, однозначно идентифицирующий тип ядра. Все потоки, присоединяющиеся к ``task_arena``, привязываются к этому типу ядра.

source: To obtain a valid core type node ID, call ``oneapi::tbb::info::core_types()``.
ru_ru: Чтобы получить действительный идентификатор узла core type, вызови ``oneapi::tbb::info::core_types()``.

source: The maximum number of threads that can be scheduled to one core simultaneously.
ru_ru: Максимальное количество потоков, которые могут быть запланированы на одно ядро одновременно.

source: See also:
ru_ru: См. также

source: :doc:`oneapi::tbb::info namespace preview extensions <info_namespace_extensions>`
ru_ru: :doc:`предварительное расширение пространства имен oneapi::tbb::info <info_namespace_extensions>`

source: `oneapi::tbb::task_arena specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/task_arena_cls.html>`_
ru_ru: `спецификация oneapi::tbb::task_arena <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_arena/task_arena_cls.html>`_
