Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/follows_and_precedes_functions.po
Languages: ru_ru

source: ``follows`` and ``precedes`` function templates
ru_ru: Шаблоны функций ``follows`` и ``precedes``

source: To enable this feature, define the ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` macro to 1.
ru_ru: Чтобы включить эту функцию, определи макрос ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` в 1.

source: The ``follows`` and ``precedes`` helper functions aid in expressing dependencies between nodes when building oneTBB flow graphs. These helper functions can only be used while constructing the node.
ru_ru: Вспомогательные функции ``follows`` и ``precedes`` помогают выразить зависимости между узлами при построении графов потока OneTBB. Эти вспомогательные функции можно использовать только при построении узла.

source: Description
ru_ru: Описание

source: The ``follows`` helper function specifies that the node being constructed is the successor of the set of nodes passed as an argument.
ru_ru: Вспомогательная функция ``follows`` указывает, что конструируемый узел является преемником множества узлов, переданных в качестве аргумента.

source: The ``precedes`` helper function specifies that the node being constructed is the predecessor of the set of nodes passed as an argument.
ru_ru: Вспомогательная функция ``precedes`` указывает, что конструируемый узел является предшественником множества узлов, переданных в качестве аргумента.

source: Functions ``follows`` and ``precedes`` are meant to replace the graph argument, which is passed as the first argument to the constructor of the node. The graph argument for the node being constructed is obtained either from the specified node set or the sequence of nodes passed to ``follows`` or ``precedes``.
ru_ru: Функции ``follows`` и ``precedes`` предназначены для замены аргумента graph, который передается в качестве первого аргумента конструктору узла. Аргумент graph для конструируемого узла получается либо из указанного набора узлов, либо из последовательности узлов, переданных в ``follows`` или ``precedes``.

source: If the nodes passed to ``follows`` or ``precedes`` belong to different graphs, the behavior is undefined.
ru_ru: Если узлы, переданные в ``follows`` или ``precedes``, принадлежат разным графам, поведение будет неопределенным.

source: Header
ru_ru: Заголовок

source: Syntax
ru_ru: Синтаксис

source: Input Parameters
ru_ru: Входные параметры

source: Either a set or a sequence of nodes can be used as arguments for ``follows`` and ``precedes``. The following expressions are equivalent:
ru_ru: В качестве аргументов для ``follows`` и ``precedes`` можно использовать либо набор, либо последовательность узлов. Следующие выражения эквивалентны:

source: A set of nodes as an input
ru_ru: Набор узлов в качестве входа

source: A sequence of nodes as an input
ru_ru: Последовательность узлов в качестве входа
