Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/helpers_for_expressing_graphs.po
Languages: ru_ru

source: Helper Functions for Expressing Graphs
ru_ru: Вспомогательные функции для выражения графов

source: To enable this feature, define the ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` macro to 1.
ru_ru: Чтобы включить эту функцию, определи макрос ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` в 1.

source: Helper functions are intended to make creation of the flow graphs less verbose.
ru_ru: Вспомогательные функции предназначены для того, чтобы сделать создание графов потока менее многословным.

source: Description
ru_ru: Описание

source: This feature adds ``make_edges``, ``make_node_set``, ``follows`` and ``precedes`` functions to ``oneapi::tbb::flow`` namespace. These functions simplify the process of building flow graphs by allowing to gather nodes into sets and connect them to other nodes in the graph.
ru_ru: Эта функция добавляет функции ``make_edges``, ``make_node_set``, ``follows`` и ``precedes`` в пространство имен ``oneapi::tbb::flow``. Эти функции упрощают процесс построения графов потоков, позволяя собирать узлы в наборы и соединять их с другими узлами графа.

source: Example
ru_ru: Пример

source: Consider the graph depicted below.
ru_ru: Рассмотри граф, изображенный ниже.

source: In the examples below, C++17 Class Template Argument Deduction is used to avoid template parameter specification where possible.
ru_ru: В примерах ниже используется C++17 Class Template Argument Deduction, чтобы по возможности избежать спецификации параметров шаблона.

source: **Regular API**
ru_ru: **Регулярный API**

source: **Preview API**
ru_ru: **Тестовый API**
