Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/parallel_for_each_semantics.po
Languages: ru_ru

source: parallel_for_each Body semantics and requirements
ru_ru: parallel_for_each Семантика и требования к телу

source: Description
ru_ru: Описание

source: This page clarifies `ParallelForEachBody <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/named_requirements/algorithms/par_for_each_body.html>`_ named requirements for ``tbb::parallel_for_each`` algorithm specification.
ru_ru: Эта страница разъясняет `ParallelForEachBody <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/named_requirements/algorithms/par_for_each_body.html>`_ именованные требования для спецификации алгоритма ``tbb::parallel_for_each``.

source: Terms
ru_ru: Условия

source: ``iterator`` determines the type of the iterator passed into ``parallel_for_each`` algorithm (which is ``InputIterator`` for overloads `(1)` and `(2)` and ``decltype(std::begin(c))`` for overloads `(3) - (6)`)
ru_ru: ``iterator`` определяет тип итератора, передаваемого в алгоритм ``parallel_for_each`` (который является ``InputIterator`` для перегрузок `(1)` и `(2)` и ``decltype(std::begin(c))`` для перегрузок `(3) - (6)`)

source: ``value_type`` - the type ``typename std::iterator_traits<iterator>::value_type``
ru_ru: ``value_type`` - тип ``typename std::iterator_traits<iterator>::value_type``

source: ``reference`` - the type ``typename std::iterator_traits<iterator>::reference``.
ru_ru: ``reference`` - тип ``typename std::iterator_traits<iterator>::reference``.

source: Requirements for different iterator types
ru_ru: Требования к различным типам итераторов

source: If the ``iterator`` satisfies `Input iterator` named requirements from [input.iterators] ISO C++ Standard section and do not satisfies `Forward iterator` named requirements from [forward.iterators] ISO C++ Standard section, ``tbb::parallel_for_each`` requires the execution of the ``body`` with an object of type ``const value_type&`` or ``value_type&&`` to be well-formed. If both forms are well-formed, an overload with rvalue reference will be preferred.
ru_ru: Если ``iterator`` удовлетворяет требованиям `Input iterator` из раздела [input.iterators] ISO C++ Standard и не удовлетворяет требованиям `Forward iterator` из раздела [forward.iterators] ISO C++ Standard, ``tbb::parallel_for_each`` требует, чтобы выполнение ``body`` с объектом типа ``const value_type&`` или ``value_type&&&`` было хорошо сформировано. Если обе формы хорошо сформированы, предпочтительнее будет перегрузка со ссылкой на rvalue.

source: If the ``Body`` only takes non-const lvalue reference to ``value_type``, named requirements above are violated and the program can be ill-formed.
ru_ru: Если ``Body`` принимает только неконстантную ссылку lvalue на ``value_type``, то вышеприведенные требования нарушаются, и программа может быть некорректно сформирована.

source: If the ``iterator`` satisfies `Forward iterator` named requirements from [forward.iterators] ISO C++ Standard section, ``tbb::parallel_for_each`` requires the execution of the ``body`` with an object of type ``reference`` to be well-formed.
ru_ru: Если ``iterator`` удовлетворяет требованиям имени `Forward iterator` из раздела [forward.iterators] ISO C++ Standard, ``tbb::parallel_for_each`` требует, чтобы выполнение ``body`` с объектом типа ``reference`` было хорошо сформировано.

source: Requirements for ``Body`` with ``feeder`` argument
ru_ru: Требования к ``Body`` с аргументом ``feeder``

source: Additional elements submitted into ``tbb::parallel_for_each`` through the ``feeder::add`` passes to the ``Body`` as rvalues and therefore the corresponding execution of the ``Body`` is required to be well-formed.
ru_ru: Дополнительные элементы, переданные в ``tbb::parallel_for_each`` через ``feeder::add``, передаются в ``Body`` как rvalues и поэтому соответствующее выполнение ``Body`` должно быть хорошо сформировано.
