Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/reference.po
Languages: ru_ru

source: |short_name| API Reference
ru_ru: Справочник по API |short_name|

source: For oneTBB API Reference, refer to `oneAPI Specification <https://spec.oneapi.com/>`_. The current supported version of oneAPI Specification is 1.0.
ru_ru: Справочник по API oneTBB приведен в `oneAPI Specification <https://spec.oneapi.com/>`_. Текущая поддерживаемая версия спецификации oneAPI - 1.0.

source: Specification extensions
ru_ru: Расширения спецификации

source: |full_name| implements the `oneTBB specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/nested-index.html>`_. This document provides additional details or restrictions where necessary. It also describes features that are not included in the oneTBB specification.
ru_ru: |full_name| реализует спецификацию `oneTBB <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/nested-index.html>`_. Этот документ содержит дополнительные детали или ограничения, где это необходимо. Он также описывает возможности, которые не включены в спецификацию oneTBB.

source: Preview features
ru_ru: Особенности предпросмотра

source: A preview feature is a component of oneTBB introduced to receive early feedback from users.
ru_ru: Функция предварительного просмотра - это компонент oneTBB, введенный для получения ранних отзывов от пользователей.

source: The key properties of a preview feature are:
ru_ru: Основными свойствами функции предварительного просмотра являются:

source: It is off by default and must be explicitly enabled.
ru_ru: По умолчанию он выключен и должен быть явно включен.

source: It is intended to have a high quality implementation.
ru_ru: Предполагается высокое качество реализации.

source: There is no guarantee of future existence or compatibility.
ru_ru: Нет никакой гарантии существования или совместимости в будущем.

source: It may have limited or no support in tools such as correctness analyzers, profilers and debuggers.
ru_ru: Он может иметь ограниченную поддержку или не иметь поддержки в таких инструментах, как анализаторы корректности, профилировщики и отладчики.

source: A preview feature is subject to change in future. It might be removed or significantly altered in future releases. Changes to a preview feature do NOT require usual deprecation and removal process. Therefore, using preview features in production code is strongly discouraged.
ru_ru: Функция предварительного просмотра может быть изменена в будущем. Она может быть удалена или значительно изменена в будущих выпусках. Изменения в функциях предварительного просмотра НЕ требуют обычного процесса устаревания и удаления. Поэтому использовать функции предварительного просмотра в производственном коде настоятельно не рекомендуется.
