Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/scalable_memory_pools.po
Languages: ru_ru

source: Scalable Memory Pools
ru_ru: Масштабируемые пулы памяти

source: To enable this feature, set the ``TBB_PREVIEW_MEMORY_POOL`` macro to 1.
ru_ru: Чтобы включить эту функцию, установи макрос ``TBB_PREVIEW_MEMORY_POOL`` в 1.

source: Memory pools allocate and free memory from a specified region or an underlying allocator using thread-safe, scalable operations. The following table summarizes the Memory Pool named requirement. Here, ``P`` represents an instance of the memory pool class.
ru_ru: Пулы памяти выделяют и освобождают память из указанного региона или базового аллокатора, используя потокобезопасные, масштабируемые операции. В следующей таблице приведены требования к именованному пулу памяти. Здесь ``P`` представляет экземпляр класса пула памяти.

source: Pseudo-Signature
ru_ru: Псевдосигнатура

source: Semantics
ru_ru: Семантика

source: Destructor. Frees all the allocated memory.
ru_ru: Деструктор. Освобождает всю выделенную память.

source: Frees all the allocated memory.
ru_ru: Освобождает всю выделенную память.

source: Returns a pointer to ``n`` bytes allocated from the memory pool.
ru_ru: Возвращает указатель на ``n`` байт, выделенных из пула памяти.

source: Frees the memory object specified via ``ptr`` pointer.
ru_ru: Освобождает объект памяти, указанный через указатель ``ptr``.

source: Reallocates the memory object pointed by ``ptr`` to ``n`` bytes.
ru_ru: Перераспределяет объект памяти, на который указывает ``ptr``, на ``n`` байт.

source: Model Types
ru_ru: Типы моделей

source: The ``memory_pool`` template class and the ``fixed_pool`` class meet the Memory Pool named requirement.
ru_ru: Шаблонный класс ``memory_pool`` и класс ``fixed_pool`` отвечают требованию именованного пула памяти.
