Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/task_group_extensions.po
Languages: ru_ru

source: task_group extensions
ru_ru: Расширение task_group

source: To enable these extensions, set the ``TBB_PREVIEW_TASK_GROUP_EXTENSIONS`` macro to 1.
ru_ru: Чтобы включить эти расширения, установи макрос ``TBB_PREVIEW_TASK_GROUP_EXTENSIONS`` в 1.

source: Description
ru_ru: Описание

source: |full_name| implementation extends the `tbb::task_group specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_cls.html>`_ with the following members:
ru_ru: |full_name| расширяет спецификацию `tbb::task_group <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_cls.html>`_ со следующими членами:

source: requirements for a user-provided function object
ru_ru: требования к функциональному объекту, предоставляемому пользователем

source: Header
ru_ru: Заголовок

source: Synopsis
ru_ru: Описание

source: namespace oneapi { namespace tbb { class task_group { public: //only the requirements for the return type of function F are changed template<typename F> task_handle defer(F&& f); //only the requirements for the return type of function F are changed template<typename F> task_group_status run_and_wait(const F& f); //only the requirements for the return type of function F are changed template<typename F> void run(F&& f); }; } // namespace tbb } // namespace oneapi
ru_ru: namespace oneapi { namespace tbb { class task_group { public: //изменяются только требования к типу возврата функции F template<typename F> task_handle defer(F&& f); //изменяются только требования к типу возврата функции F template<typename F> task_group_status run_and_wait(const F& f); //изменяются только требования к типу возврата функции F template<typename F> void run(F&& f); }; } // namespace tbb } // namespace oneapi

source: Member Functions
ru_ru: Функции-члены

source: As an optimization hint, ``F`` might return a ``task_handle``, which task object can be executed next.
ru_ru: В качестве подсказки для оптимизации, ``F`` может вернуть ``task_handle``, объект задачи которого может быть выполнен следующим.

source: The ``task_handle`` returned by the function must be created using ``*this`` ``task_group``. That is, the one for which the run method is called, otherwise it is undefined behavior.
ru_ru: Возвращаемая функцией ``task_handle`` должна быть создана с помощью ``*this`` ``task_group``. То есть той, для которой вызывается метод run, иначе это неопределенное поведение.

source: The ``task_handle`` returned by the function must be created with ``*this`` ``task_group``. It means, with the one for which run method is called, otherwise it is an undefined behavior.
ru_ru: Возвращаемая функцией ``task_handle`` должна быть создана с ``*this`` ``task_group``. Это значит, с той, для которой вызывается метод run, иначе это неопределенное поведение.

source: See also
ru_ru: Смотри также

source: `oneapi::tbb::task_group specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_cls.html>`_
ru_ru: `Спецификация oneapi::tbb::task_group <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_cls.html>`_

source: `oneapi::tbb::task_group_context specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/task_group_context_cls.html>`_
ru_ru: `Спецификация oneapi::tbb::task_group_context <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/scheduling_controls/task_group_context_cls.html>`_

source: `oneapi::tbb::task_group_status specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_status_enum.html>`_
ru_ru: `Спецификация oneapi::tbb::task_group_status <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/task_scheduler/task_group/task_group_status_enum.html>`_

source: :doc:`oneapi::tbb::task_handle class <task_group_extensions/task_handle>`
ru_ru: :doc:`Класс oneapi::tbb::task_handle <task_group_extensions/task_handle>`
