Repository: schmidtevgeny/oneTBB-doc-ru
Catalog: locales/*/LC_MESSAGES/main/reference/type_specified_message_keys.po
Languages: ru_ru

source: Type-specified message keys for join_node
ru_ru: Определяемые типом ключи сообщения для join_node

source: To enable this feature, define the ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` macro to 1.
ru_ru: Чтобы включить эту функцию, определи макрос ``TBB_PREVIEW_FLOW_GRAPH_FEATURES`` в 1.

source: Description
ru_ru: Описание

source: The extension allows a key matching ``join_node`` to obtain keys via functions associated with its input types. The extension simplifies the existing approach by removing the need to provide a function object for each input port of ``join_node``.
ru_ru: Расширение позволяет узлу сопоставления ключей ``join_node`` получать ключи через функции, связанные с его входными типами. Расширение упрощает существующий подход, устраняя необходимость предоставлять объект функции для каждого входного порта ``join_node``.

source: Header
ru_ru: Заголовок

source: Syntax
ru_ru: Синтаксис

source: The extension adds a special constructor to the ``join_node`` interface when the ``key_matching<typename K, class KHash=tbb_hash_compare>`` policy is used. The constructor has the following signature:
ru_ru: Расширение добавляет специальный конструктор в интерфейс ``join_node``, когда используется политика ``key_matching<typename K, class KHash=tbb_hash_compare>``. Конструктор имеет следующую сигнатуру:

source: When constructed this way, a ``join_node`` calls the ``key_from_message`` function for each incoming message to obtain the key associated with it. The default implementation of ``key_from_message`` is the following
ru_ru: При таком построении узел ``join_node`` вызывает функцию ``key_from_message`` для каждого входящего сообщения, чтобы получить связанный с ним ключ. По умолчанию функция ``key_from_message`` реализуется следующим образом

source: ``T`` is one of the user-provided types in ``OutputTuple`` and is used to construct the ``join_node``, and ``K`` is the key type of the node. By default, the ``key()`` method defined in the message class will be called. Alternatively, the user can define its own ``key_from_message`` function in the same namespace with the message type. This function will be found via C++ argument-dependent lookup and used in place of the default implementation.
ru_ru: ``T`` является одним из типов, предоставляемых пользователем в ``OutputTuple`` и используется для построения ``join_node``, а ``K`` - это тип ключа узла. По умолчанию будет вызван метод ``key()``, определенный в классе сообщения. В качестве альтернативы пользователь может определить собственную функцию ``key_from_message`` в одном пространстве имен с типом сообщения. Эта функция будет найдена через зависимый от аргументов поиск C++ и использована вместо реализации по умолчанию.

source: See Also
ru_ru: Читайте также

source: `join_node Specification <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/flow_graph/join_node_cls.html>`_
ru_ru: `Спецификация join_node <https://spec.oneapi.com/versions/latest/elements/oneTBB/source/flow_graph/join_node_cls.html>`_
